Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: If you are **not using the standard `5269` port**, you must also add a SRV record for `_xmpp-server._tcp.your_instance.tld.` (same as above, just without the `room.` prefix). Of course, you can also add this record if you use the standard port. It will also work.
ca: Si **no utilitzeu el port estàndard `5269`**, també heu d'afegir un registre SRV per a `_xmpp-server._tcp.exemple.cat.` (igual que a dalt, sense el prefix `room.`). Per descomptat, també podeu afegir aquest registre si feu servir el port estàndard. També funcionarà.
fr: Si vous **n'utilisez pas le port standard `5269`**, vous devez ajouter un autre enregistrement SRV pour `_xmpp-server._tcp.votre_instance.tld.` (pareil que précédemment, mais en enlevant le préfixe `room.`). Bien sûr, vous pouvez l'ajouter même si vous utilisez le port standard. Cela fonctionnera également.
pt_br: Se você **não estiver usando a porta padrão `5269`**, também precisará adicionar um registro SRV para `_xmpp-server._tcp.your_instance.tld.` (o mesmo que acima, mas sem o prefixo `room.`). É claro que você também pode adicionar este registro se usar a porta padrão. Também funcionará.

source: Using trusted certificates
ca: Ús de certificats de confiança
fr: Utilisation de certificats de confiance
pt_br: Usando certificados confiáveis

source: The self-signed certificates that this plugin uses by default can be rejected by some XMPP servers, for security reasons.
ca: Els certificats autodignats que el connector utilitza de manera predeterminada poden no ser adequats per a tots els servidors XMPP. De fet, poden rebutjar-los per motius de seguretat.
fr: Les certificats auto-signés que le plugin utilise par défaut peuvent ne pas convenir à tous les serveurs distants. En effet, ceux-ci peuvent les refuser pour raison de sécurité.
pt_br: Os certificados autoassinados que este plugin usa por padrão podem ser rejeitados por alguns servidores XMPP, por motivos de segurança.

source: It is possible to use certificates validated by a certification authority. However, this requires advanced system administration knowledge. Indeed, due to the multitude of possible use cases, it is impossible to document all situations here. This documentation will therefore only explain the goal to be reached, and give an example which will only be suitable for a "basic" situation (manual installation of Peertube, using letsencrypt). If you are in another situation (Docker installation, certificates signed by another authority, etc...), you will have to adapt this approach by yourself.
ca: És possible utilitzar certificats validats per una autoritat de certificació. Tanmateix, això requereix coneixements avançats d'administració de sistemes. De fet, donada la multitud de casos possibles, aquí és impossible documentar totes les situacions. Per tant, aquesta documentació simplement explicarà l'objectiu a assolir i donarà un exemple que només serà adequat per a una situació «bàsica» (instal·lació manual de PeerTube, amb l'ús de letsencrypt). Si us trobeu en una altra situació (instal·lació de Docker, certificats signats per una altra autoritat, etc.), haureu d'adaptar l'enfocament.
fr: Il est possible d'utiliser des certificats validés par une autorité de certification. Cependant cela demande des connaissances d'administration système avancées. En effet, devant la multitude de cas possibles, il est impossible de documenter ici toutes les situations. La présente documentation va donc se contenter de vous expliquer le but à atteindre, et donner un example qui ne conviendra qu'à une situation «basique» (installation manuelle de Peertube, avec utilisation de letsencrypt). Si vous êtes dans une autre situation (installation Docker, certificats signés par une autre autorité, etc...), il vous faudra adapter la démarche.
pt_br: É possível usar certificados validados por uma autoridade certificadora. No entanto, isso requer conhecimentos avançados de administração de sistemas. De fato, devido à multiplicidade de casos de uso possíveis, é impossível documentar todas as situações aqui. Esta documentação, portanto, explicará apenas o objetivo a ser alcançado e fornecerá um exemplo adequado apenas para uma situação "básica" (instalação manual do Peertube, usando letsencrypt). Se você estiver em outra situação (instalação do Docker, certificados assinados por outra autoridade, etc.), terá que adaptar essa abordagem por conta própria.

source: Basic principle
ca: Principi bàsic
fr: Principe de base
pt_br: Princípio básico

source: It is up to you to generate valid certificates for domains `your_instance.tld` and `room.your_instance.tld`. You can use any [method supported by Prosody](https://prosody.im/doc/certificates).
ca: Depèn de vosaltres generar certificats vàlids per als dominis `exemple.cat i `room.exemple.cat`. Podeu utilitzar qualsevol [mètode compatible amb Prosody](https://prosody.im/doc/certificates).
fr: À vous de générer des certificats valides pour les domaines `votre_instance.tld` et `room.votre_instance.tld`. Vous pouvez utiliser n'importe quelle [méthode supportées par Prosody](https://prosody.im/doc/certificates).
pt_br: Cabe a você gerar certificados válidos para os domínios `sua_instância.tld` e `room.sua_instância.tld`. Você pode usar qualquer [método suportado pelo Prosody](https://prosody.im/doc/certificates).

source: You must then place these certificates in a folder that will be accessible to the `peertube` user, and specify this folder in the plugin setting "Certificate folder".
ca: A continuació, heu de col·locar aquests certificats en una carpeta la qual serà accessible per l'usuari `peertube`, i després indicar aquesta carpeta al paràmetre del connector «Carpetes de certificats».
fr: Vous devez ensuite placer ces certificats dans un dossier qui sera accessible au user `peertube`, puis indiquer ce dossier dans le paramètre du plugin «Dossiers des certificats».
pt_br: Você deve então colocar esses certificados em uma pasta que seja acessível ao usuário `peertube` e especificar essa pasta na configuração do plugin "Pasta de certificados".

source: If you want to use the ProsodyCtl utility to import certificates, this utility is available (once Peertube is started) using the following command (adapting the path to your Peertube data folder, and replacing "xxx" with the arguments you wish to pass to prosodyctl): `sudo -u peertube /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua xxx`
ca: Si voleu utilitzar la utilitat ProsodyCtl per importar certificats, aquesta utilitat està disponible (un cop iniciat PeerTube) mitjançant l'ordre següent (adaptant el camí a la carpeta de dades de PeerTube i substituint «xxx» amb els arguments que voleu passar a prosodyctl ): `sudo -u peertube /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody /prosody.cfg.lua xxx`
fr: Si vous voulez utiliser l'utilitaire ProsodyCtl (pour importer des certificats letsencrypts, générer des certificats, etc...), cet utilitaire est disponible (une fois Peertube démarré) en utilisant la commande qui suit (en adaptant le chemin vers votre dossier data Peertube, et en remplaçant «xxx» par les arguments que vous souhaitez passer à prosodyctl) : `sudo -u peertube /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua xxx`
pt_br: Se você quiser usar o utilitário ProsodyCtl para importar certificados, este utilitário estará disponível (após o Peertube ser iniciado) usando o seguinte comando (adaptando o caminho para sua pasta de dados do Peertube e substituindo "xxx" pelos argumentos que você deseja passar para o prosodyctl): `sudo -u peertube /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua xxx`

source: The plugin will check once a day to see if any files have been modified in this folder, and reload Prosody if necessary.
ca: El connector comprovarà un cop al dia si s'ha modificat algun fitxer en aquesta carpeta i tornarà a carregar Prosody si cal.
fr: Le plugin va vérifier une fois par jour si des fichiers ont été modifiés dans ce dossier, et recharger Prosody le cas échéant.
pt_br: O plugin verificará uma vez por dia se algum arquivo foi modificado nesta pasta e recarregará o Prosody, se necessário.

source: Method for the simple case
ca: Mètode per al cas simple
fr: Méthode dans le cas simple
pt_br: Método para o caso simples

source: We assume here that your Peertube installation is "classic" (no use of Docker), and that the certificates are generated by letsencrypt, using the certbot tool.
ca: Suposem aquí que la vostra instal·lació de Peertube és «clàssica» (no fa servir Docker) i que els certificats es generen mitjançant letsencrypt, utilitzant l'eina certbot.
fr: Nous supposons ici que votre installation de Peertube est «classique» (pas d'utilisation de Docker), et que les certificats sont générés par letsencrypt, en utilisant l'outils certbot.
pt_br: Assumimos aqui que sua instalação do Peertube é "clássica" (sem uso do Docker) e que os certificados são gerados pelo letsencrypt, usando a ferramenta certbot.

source: First of all, we'll have to create a certificate for the subdomain `room.your_instance.tld` : this is the uri of the MUC (XMPP chat rooms) component. Even if the connections are made on `your_instance.tld`, we will need a valid certificate for this subdomain.
ca: En primer lloc haurem de crear un certificat per al subdomini `room.exemple.cat`: aquest és l'URI del component MUC (sales de xat XMPP). Fins i tot si les connexions es fan a `exemple.cat`, necessitarem un certificat vàlid per a aquest subdomini.
fr: Tout d'abord, on va devoir créer un certificat pour le sous-domain `room.votre_instance.tld` : c'est l'uri du composant MUC (salons de discussion XMPP). Même si les connections se font sur `votre_instance.tld`, il va nous falloir un certificat valide pour ce sous-domaine.
pt_br: Primeiramente, precisamos criar um certificado para o subdomínio `room.your_instance.tld`: este é o URI do componente MUC (salas de bate-papo XMPP). Mesmo que as conexões sejam feitas em `your_instance.tld`, precisaremos de um certificado válido para este subdomínio.

source: So start by setting up a DNS entry for `room.your_instance.tld`, which points to your server. You can use a CNAME entry (or an A entry and a AAAA entry).
ca: Així que comenceu configurant una entrada DNS per a `room.exemple.cat`, que apunta al vostre servidor. Podeu fer una entrada CNAME (o una entrada A i una entrada AAAA).
fr: Commencez donc par paramétrer une entrée DNS pour `room.votre_instance.tld`, qui pointe sur votre serveur. Vous pouvez tout à fait faire une entrée CNAME (ou une entrée A et une entrée AAAA).
pt_br: Comece configurando uma entrada DNS para `room.your_instance.tld`, que aponta para o seu servidor. Você pode usar uma entrada CNAME (ou uma entrada A e uma entrada AAAA).

source: Next, we'll use nginx (already installed for your Peertube) to generate the certbot certificate. We will create a new site. In the file `/etc/nginx/site-available/room.peertube`, add:
ca: A continuació, utilitzarem nginx (ja instal·lat per al vostre PeerTube) per generar el certificat de certbot. Anem a crear un nou lloc. Al fitxer `/etc/nginx/site-available/room.peertube`, afegiu:
fr: Ensuite, nous allons utiliser nginx (déjà installé pour votre Peertube) pour générer le certificat certbot. On va créer un nouveau site. Dans le fichier `/etc/nginx/site-available/room.peertube`, ajoutez :
pt_br: Em seguida, usaremos o nginx (já instalado no seu Peertube) para gerar o certificado certbot. Criaremos um novo site. No arquivo `/etc/nginx/site-available/room.peertube`, adicione:

source: server { listen 80; listen [::]:80; server_name room.your_instance.tld; location /.well-known/acme-challenge/ { default_type "text/plain"; root /var/www/certbot; } location / { return 301 https://your_instance.tld; } }
ca: server { listen 80; listen [::]:80; server_name room.exemple.cat; location /.well-known/acme-challenge/ { default_type "text/plain"; root /var/www/certbot; } location / { return 301 https://exemple.cat;; } }
fr: server { listen 80; listen [::]:80; server_name room.votre_instance.tld; location /.well-known/acme-challenge/ { default_type "text/plain"; root /var/www/certbot; } location / { return 301 https://votre_instance.tld; } }
pt_br: servidor { ouvir 80; ouvir [::]:80; nome_do_servidor sala.sua_instância.tld; localização /.well-known/acme-challenge/ { tipo_padrão "texto/simples"; raiz /var/www/certbot; } localização / { retornar 301 https://sua_instância.tld; } }

source: Then enable the site:
ca: Aleshores activeu el lloc:
fr: Ensuite on active ce site :
pt_br: Em seguida, habilite o site:

source: Then we prepare the folder in which we will later import the certificates. We assume here that you already have the plugin active. We will create the following folder (if it doesn't already exist), with the user `peertube` to make sure there are no permissions issues:
ca: A continuació preparem el fitxer al qual més tard importarem els certificats. Suposem aquí que ja teniu el connector actiu. Crearem la següent carpeta (si encara no existeix), amb l'usuari `peertube` per assegurar-nos que no hi ha cap problema de permisos:
fr: On prépare ensuite le dossier dans lequel on va plus tard importer les certificats. On suppose ici que vous avez déjà le plugin actif. On va créer le dossier suivant (s'il n'existe pas déjà), avec le user `peertube` pour être sûr qu'il n'y a pas de problème de droits :
pt_br: Em seguida, preparamos a pasta para a qual importaremos os certificados. Presumimos que você já tenha o plugin ativo. Criaremos a seguinte pasta (se ainda não existir), com o usuário `peertube`, para garantir que não haja problemas de permissão:

source: Now you have to configure this folder in the plugin settings, for the parameter "Certificate folders". It's important to do this now, otherwise the certificate import script will put the certificates in the wrong folder.
ca: Ara heu de configurar aquesta carpeta a la configuració del connector, per a «Carpetes de certificats». És important fer-ho abans de continuar, en cas contrari, l'script d'importació de certificats els col·locarà al lloc equivocat.
fr: Il faut maintenant configurer ce dossier dans les paramètres du plugin, pour «Dossiers des certificats». C'est important de le faire avant la suite, sinon le script d'import des certificats va les placer au mauvais endroit.
pt_br: Agora você precisa configurar esta pasta nas configurações do plugin, no parâmetro "Pastas de certificados". É importante fazer isso agora, caso contrário, o script de importação de certificados colocará os certificados na pasta errada.

source: We will configure certbot to import the generated certificates into the Prosody folder. We can use the ProsodyCtl utility packaged in the plugin.
ca: Configurarem certbot perquè importi els certificats generats a la carpeta Prosody. Podrem utilitzar la utilitat ProsodyCtl empaquetada al connector.
fr: On va configurer certbot pour qu'il importe les certificats générés dans le dossier de Prosody. On va pouvoir utiliser l'utilistaire ProsodyCtl packagé dans le plugin.
pt_br: Configuraremos o certbot para importar os certificados gerados para a pasta Prosody. Podemos usar o utilitário ProsodyCtl incluído no plugin.

source: Note: for it to be available, the plugin must have been started at least once.
ca: Nota: perquè estigui disponible, el connector s'ha d'haver iniciat almenys una vegada.
fr: Note : pour qu'il soit disponible, il faut que le plugin ai démarré au moins une fois.
pt_br: Observação: para estar disponível, o plugin deve ter sido iniciado pelo menos uma vez.

source: We will create a file `/etc/letsencrypt/renewal-hooks/deploy/prosody.sh` containing:
ca: Crearem un fitxer `/etc/letsencrypt/renewal-hooks/deploy/prosody.sh` que conté:
fr: On va créer un fichier `/etc/letsencrypt/renewal-hooks/deploy/prosody.sh` contenant :
pt_br: Criaremos um arquivo `/etc/letsencrypt/renewal-hooks/deploy/prosody.sh` contendo:

source: #!/usr/bin/env sh /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl \ --root \ --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua \ cert import \ room.your_instance.tld your_instance.tld /etc/letsencrypt/live
fr: #!/usr/bin/env sh /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl \ --root \ --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua \ cert import \ room.votre_instance.tld votre_instance.tld /etc/letsencrypt/live
pt_br: #!/bin/sh /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl &#13; --root &#13; --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua &#13; cert import &#13; room.sua_instância.tld sua_instância.tld /etc/letsencrypt/live

source: Then we ask to generate the certificate:
ca: Aleshores demanem generar el certificat:
fr: Puis on demande à générer le certificat :
pt_br: Então pedimos para gerar o certificado:

source: If certbot offers you several methods to generate the certificate, choose "nginx".
ca: Si certbot us ofereix diversos mètodes per generar el certificat, trieu «nginx».
fr: Si certbot vous propose plusieurs méthodes pour générer le certificat, choisissez «nginx».
pt_br: Se o certbot oferecer vários métodos para gerar o certificado, escolha "nginx".

source: Normally you should now find the certificates in the configured folder.
ca: Normalment ara hauríeu de trobar els certificats a la carpeta configurada.
fr: Normalement vous devriez maintenant trouver les certificats dans le dossier configuré.
pt_br: Normalmente, agora você deve encontrar os certificados na pasta configurada.

source: Note: the first time you do this, you will have to reload Prosody. The easiest way to do this is to restart Peertube.
ca: Nota: la primera vegada que ho feu, haureu de tornar a carregar Prosody. La manera més senzilla de fer-ho és reiniciar PeerTube.
fr: Note : la première fois que vous faites tout ça, il va falloir recharger Prosody. Le plus simple pour cela est de redémarrer Peertube.
pt_br: Observação: na primeira vez que fizer isso, você precisará reiniciar o Prosody. A maneira mais fácil de fazer isso é reiniciar o Peertube.

source: Method for the Docker case
ca: Mètode quan s'utilitza Docker
fr: Méthode en cas d'utilisation de Docker
pt_br: Método para o caso Docker

source: This method works with the officially supported [Docker guide](https://docs.joinpeertube.org/install/docker) from PeerTube.
ca: Aquest mètode funciona amb la [guia de Docker](https://docs.joinpeertube.org/install/docker) oficial de PeerTube.
fr: Cette méthode marche avec le [guide Docker](https://docs.joinpeertube.org/install/docker) officiel de Peertube.
pt_br: Este método funciona com o [guia Docker](https://docs.joinpeertube.org/install/docker) oficialmente suportado do PeerTube.

source: First, ensure you create a DNS entry for `room.your_instance.tld`, which points to your server. You can use a CNAME entry (or an A entry and a AAAA entry). This is necessary for Let's Encrypt to validate the domain for certificate generation.
ca: Primer, assegureu-vos de crear una entrada DNS per a `room.exemple.cat`, que apunta al vostre servidor. Podeu utilitzar una entrada CNAME (o una entrada A i una entrada AAAA). Això és necessari perquè «Let's Encrypt» validi el domini per a la generació de certificats.
fr: Tout d'abord, assurez-vous de créer une entrée DNS pour `room.your_instance.tld`, qui pointe vers votre serveur. Vous pouvez utiliser une entrée CNAME (ou une entrée A et une entrée AAAA). Ceci est nécessaire pour que Let's Encrypt valide le domaine pour la génération du certificat.
pt_br: Primeiro, certifique-se de criar uma entrada DNS para `room.your_instance.tld`, que aponta para o seu servidor. Você pode usar uma entrada CNAME (ou uma entrada A e uma entrada AAAA). Isso é necessário para que o Let's Encrypt valide o domínio para geração do certificado.

source: Enter the directory where your `docker-compose.yml` file exists.
ca: Introduïu el directori on es troba el vostre fitxer `docker-compose.yml`.
fr: Entrez le répertoire où se trouve votre fichier `docker-compose.yml`.
pt_br: Entre no diretório onde seu arquivo `docker-compose.yml` está.

source: Open a shell in the certbot container:
ca: Obriu un shell al contenidor de certbot:
fr: Ouvrez un shell dans le conteneur certbot :
pt_br: Abra um shell no contêiner certbot:

source: Run certbot:
ca: Executeu certbot:
fr: Lancez certbot :
pt_br: Execute o certbot:

source: You will be presented with a series of prompts. Enter `2` for the authentication type:
ca: Se us presentarà una sèrie d'indicacions. Introduïu «2» per al tipus d'autenticació:
fr: Une série d'invites vous sera présentée. Entrez `2` pour le type d'authentification :
pt_br: Serão apresentadas uma série de prompts. Digite `2` para o tipo de autenticação:

source: Enter the domain name `room.your_instance.tld`:
ca: Introduïu el nom de domini `room.domini.cat`:
pt_br: Digite o nome de domínio `room.your_instance.tld`:

source: Enter the directory where the PeerTube webserver serves requests for Let's Encrypt, `/var/www/certbot`:
ca: Introduïu el directori on el servidor web PeerTube serveix les sol·licituds de «Let's Encrypt», `/var/www/certbot`:
pt_br: Entre no diretório onde o servidor web PeerTube atende solicitações para o Let's Encrypt, `/var/www/certbot`:

source: You should see output like the following:
ca: Hauríeu d'obtenir un resultat semblant al següent:
fr: Vous devriez obtenir un résultat semblable à celui qui suit :
pt_br: Você deverá ver uma saída como esta:

source: Run the below command inside the certbot container to give read access to the new certs and private keys to the peertube group. *Note*: This will also make the files readable to the group with id 999 on the host system. Check the groups on your system to assess this as a risk before running this command.
ca: Executeu l'ordre següent dins del contenidor de certbot per donar accés de lectura als nous certificats i claus privades al grup `peertube`. *Nota*: Aquesta ordre també farà que els fitxers siguin llegibles per al grup amb ID 999 al sistema amfitrió. Comproveu els grups del vostre sistema per avaluar el risc abans d'executar aquesta ordre.
fr: Exécutez la commande suivante à l'intérieur du conteneur certbot pour donner un accès en lecture aux nouveaux certificats et clés privées au groupe peertube. *Note* : Cette commande rendra également les fichiers accessibles en lecture au groupe dont l'identifiant est 999 sur le système hôte. Vérifiez les groupes sur votre système pour évaluer le risque avant d'exécuter cette commande.
pt_br: Execute o comando abaixo dentro do contêiner certbot para conceder acesso de leitura aos novos certificados e chaves privadas do grupo peertube. *Observação*: Isso também tornará os arquivos legíveis para o grupo com ID 999 no sistema host. Verifique os grupos em seu sistema para avaliar se isso representa um risco antes de executar este comando.
