Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Exit the certbot container:
ca: Sortiu del contenidor de certbot:
fr: Sortez du conteneur certbot :
pt_br: Saia do contêiner certbot:

source: Modify your `docker-compose.yml` file, changing the `entrypoint` line under the `certbot` service to the following. This is the same as the above, but to be automatically executed after every certificate renewal.
ca: Editeu el vostre fitxer `docker-compose.yml`, canviant la línia `entrypoint` sota el servei `certbot` a la següent. És el mateix que l'anterior, però s'ha d'executar automàticament després de cada renovació del certificat.
fr: Modifiez votre fichier `docker-compose.yml`, en changeant la ligne `entrypoint` sous le service `certbot` par ce qui suit. C'est la même chose que ci-dessus, mais elle doit être exécutée automatiquement après chaque renouvellement de certificat.
pt_br: Modifique seu arquivo `docker-compose.yml`, alterando a linha `entrypoint` no serviço `certbot` para o seguinte. É o mesmo que o anterior, mas será executado automaticamente após cada renovação de certificado.

source: Continuing to modify `docker-compose.yml`, add the certbot certificate volume into the peertube container. It should look something like this:
ca: Continuant editant `docker-compose.yml`, afegiu el volum certbot al contenidor peertube. Hauria de ser així:
fr: En continuant à modifier `docker-compose.yml`, ajoutez le volume certbot dans le conteneur peertube. Il devrait ressembler à ceci :
pt_br: Continuando a modificar `docker-compose.yml`, adicione o volume do certificado certbot ao contêiner peertube. Deve ficar algo assim:

source: Restart your services:
ca: Reinicieu els vostres serveis:
fr: Redémarrez vos services :
pt_br: Reinicie seus serviços:

source: In the livechat plugin settings from your PeerTube administration settings, set the certificate directory to the following:
ca: A la configuració de livechat dins l'administració de PeerTube establiu el directori de certificats de la següent manera:
fr: Dans les paramètres du plugin livechat à partir des paramètres d'administration de PeerTube, définissez le répertoire des certificats comme suit :
pt_br: Nas configurações do plugin de chat ao vivo nas configurações de administração do PeerTube, defina o diretório do certificado como o seguinte:

source: Save the plugin settings and verify Prosody can see the certificates:
ca: Deseu la configuració del connector i comproveu que Prosody pugui veure els certificats:
fr: Sauvegardez les paramètres du plugin et vérifiez que Prosody peut voir les certificats :
pt_br: Salve as configurações do plugin e verifique se o Prosody pode ver os certificados:

source: Troubleshooting
ca: Resolució de problemes
fr: En cas de problème
pt_br: Solução de problemas

source: If you can't make it work, you can use the diagnostic tool (there is a button on top of the plugin settings page), and take a close look on the «Prosody check» section.
ca: Si això no funciona, podeu utilitzar les eines de diagnòstic (un botó es troba a la part superior de la pàgina de configuració del connector) i, en particular, mireu què diu la secció «Comprovació de Prosody».
fr: Si cela ne fonctionne pas, vous pouvez utiliser l'outils de diagnostic (un bouton se trouve en haut de la page des paramètres du plugin), et notamment regarder ce que dit la section «Prosody check».
pt_br: Se não conseguir fazer funcionar, você pode usar a ferramenta de diagnóstico (há um botão no topo da página de configurações do plugin) e dar uma olhada na seção «Verificação de prosódia».

source: Plugin Peertube Livechat settings - External Authentication
ca: Configuració del connector de Peertube Livechat - Autenticació externa
fr: Paramètres du Plugin Peertube Livechat - Authentification Externe
pt_br: Configurações do plugin Peertube Livechat - Autenticação externa

source: External Authentication
ca: Autenticació externa
fr: Authentification externe
pt_br: Autenticação externa

source: Users that are not connected to your Peertube instance are joining the chat using "anonymous accounts" (they can freely choose a nickname, and will be assigned a random avatar).
ca: Els comptes que no estiguin connectats a la vostra instància de PeerTube s'uneixen al xat mitjançant «comptes anònims» (poden triar lliurement un sobrenom i se'ls assignarà un avatar aleatori).
fr: Les utilisateur⋅rices qui ne sont pas connecté⋅es à votre instance Peertube rejoignent le chat en utilisant des "comptes anonymes" (iels peuvent librement choisir un surnom, et se verront attribuer un avatar aléatoire).
pt_br: Usuários que não estão conectados à sua instância do Peertube estão entrando no bate-papo usando "contas anônimas" (eles podem escolher livremente um apelido e receberão um avatar aleatório).

source: You can enable some external authentication methods to allow user to create chat accounts. In such case their nickname and avatar will be automatically initialized with the remote account information.
ca: Podeu habilitar mètodes d'autenticació externs per permetre la creació comptes per xatejar. En aquest cas, l'àlies i l'avatar s'inicialitzaran automàticament amb la informació del compte remot.
fr: Vous pouvez activer des méthodes d'authentification externes pour permettre aux utilisateur⋅rices de créer des comptes pour tchater. Dans ce cas, leur pseudo et leur avatar seront automatiquement initialisés avec les informations du compte distant.
pt_br: Você pode habilitar alguns métodos de autenticação externa para permitir que os usuários criem contas de bate-papo. Nesse caso, o apelido e o avatar serão inicializados automaticamente com as informações da conta remota.

source: Such "external account users" will be easier to moderate than anonymous accounts.
ca: Aquests «comptes externs» seran més fàcils de moderar que els comptes anònims.
fr: Ces "utilisateur⋅rices de comptes externes" seront plus faciles à modérer que les comptes anonymes.
pt_br: Esses "usuários de contas externas" serão mais fáceis de moderar do que contas anônimas.

source: This also allows user to join the chat without creating Peertube account (in case your instance has closed registration for example, or without waiting for account approval).
ca: Això també permet al compte unir-se al xat sense crear un compte de PeerTube (per exemple, en cas que la vostra instància hagi tancat el registre, o sense esperar l'aprovació del compte).
fr: Cela permet également à l'utilisateur⋅ice de rejoindre le tchat sans créer de compte Peertube (dans le cas où votre instance a fermé l'enregistrement par exemple, ou sans attendre l'approbation du compte).
pt_br: Isso também permite que o usuário participe do chat sem criar uma conta no Peertube (caso sua instância tenha fechado o registro, por exemplo, ou sem esperar pela aprovação da conta).

source: This page will describe available authentication methods.
ca: Aquesta pàgina descriu els mètodes d'autenticació disponibles.
fr: Cette page décrit les méthodes d'authentification disponibles.
pt_br: Esta página descreverá os métodos de autenticação disponíveis.

source: For the user documentation, see [user documentation](/peertube-plugin-livechat/documentation/user/viewers/)
ca: Per obtenir la documentació d'usuari consulteu la pàgina [documentació d'usuari](/peertube-plugin-livechat/ca/documentation/user/viewers/)
fr: Pour la documentation utilisateur⋅rice, veuillez vous référer à la page [de documentation utilisateur⋅rice](/peertube-plugin-livechat/fr/documentation/user/viewers/)
pt_br: Para a documentação do usuário, consulte [documentação do usuário](/peertube-plugin-livechat/documentation/user/viewers/)

source: OpenID Connect
pt_br: Conexão OpenID

source: You can configure one external [OpenID Connect](https://openid.net/developers/how-connect-works/) compatible provider.
ca: Podeu configurar un proveïdor extern compatible amb [OpenID Connect](https://openid.net/developers/how-connect-works/).
fr: Vous pouvez configurer un fournisseur externe compatible avec [OpenID Connect](https://openid.net/developers/how-connect-works/).
pt_br: Você pode configurar um provedor externo compatível com [OpenID Connect](https://openid.net/developers/how-connect-works/).

source: Doing so, you can for example use your website for Single Sign-On.
ca: Per exemple, podeu utilitzar el vostre lloc web per a l'inici de sessió únic.
fr: Ainsi, vous pouvez par exemple utiliser votre site web pour l'authentification unique (Single Sign-On).
pt_br: Fazendo isso, você pode, por exemplo, usar seu site para Single Sign-On.

source: Popular CMS softwares (Wordpess, ...) offers plugins implementing OpenID Connect.
ca: El programari CMS més popular (Wordpess, etc.) ofereix mòduls que implementen OpenID Connect.
fr: Les logiciels CMS les plus répandus (Wordpess, ...) proposent des modules implémentant OpenID Connect.
pt_br: Softwares CMS populares (Wordpess, ...) oferecem plugins que implementam o OpenID Connect.

source: To enable this feature, first you have to create a client on your provider side (check the related documentation for enabling OpenID Connect). Then go to the [plugin settings](/peertube-plugin-livechat/documentation/admin/settings), and enable "{{% livechat_label external_auth_custom_oidc_label %}}".
ca: Per habilitar aquesta funció, primer heu de crear un client al costat del vostre proveïdor (consulteu la documentació per habilitar OpenID Connect). A continuació, aneu a [Configuració del connector](/peertube-plugin-livechat/ca/documentation/admin/settings) i activeu «{{% livechat_label external_auth_custom_oidc_label %}}».
fr: Pour activer cette fonctionnalité, vous devez d'abord créer un client du côté de votre fournisseur (consultez la documentation relative à l'activation d'OpenID Connect). Ensuite, allez dans les [paramètres du plugin](/peertube-plugin-livechat/fr/documentation/admin/settings), et activez "{{% livechat_label external_auth_custom_oidc_label %}}".
pt_br: Para habilitar este recurso, primeiro você precisa criar um cliente no seu provedor (consulte a documentação relacionada para habilitar o OpenID Connect). Em seguida, acesse as [configurações do plugin](/peertube-plugin-livechat/documentation/admin/settings) e habilite "{{% livechat_label external_auth_custom_oidc_label %}}".

source: Note: if you want to restrict allowed redirection urls on the provider side (best security practice), the plugin will show you the url to allow. Just copy it in your OpenID Connect application configuration.
ca: Nota: si voleu restringir els URL de redirecció autoritzats al costat del proveïdor (bones pràctiques de seguretat), el connector us indicarà l'URL per autoritzar. Simplement copieu-lo a la configuració de la vostra aplicació OpenID Connect.
fr: Note : si vous souhaitez restreindre les urls de redirection autorisées du côté du fournisseur (bonne pratique de sécurité), le plugin vous indiquera l'url à autoriser. Il suffit de la copier dans la configuration de votre application OpenID Connect.
pt_br: Observação: se você quiser restringir URLs de redirecionamento permitidas no lado do provedor (melhor prática de segurança), o plugin mostrará a URL permitida. Basta copiá-la na configuração do seu aplicativo OpenID Connect.

source: You will now have to fill some settings.
ca: Ara heu d'omplir alguns paràmetres.
fr: Vous devez maintenant remplir certains paramètres.
pt_br: Agora você terá que preencher algumas configurações.

source: This is the button label in the following screenshot:
ca: Aquesta és l'etiqueta del botó a la captura de pantalla següent:
fr: Il s'agit du libellé du bouton dans la capture d'écran suivante :
pt_br: Este é o rótulo do botão na captura de tela a seguir:

source: For now, it is not possible to localize this label.
ca: De moment no és possible localitzar aquesta etiqueta.
fr: Pour l'instant il n'est pas possible de localiser ce libellé.
pt_br: Por enquanto, não é possível localizar este rótulo.

source: Your OpenID Connect provider must implement the [discovery URL](https://openid.net/specs/openid-connect-discovery-1_0.html). Just set here the discovery url, that should be something like `https://example.com/.well-known/openid-configuration`.
ca: El vostre proveïdor d'OpenID Connect ha d'implementar l'[URL de descoberta](https://openid.net/specs/openid-connect-discovery-1_0.html). Establiu aquí l'URL de descobriment, que hauria de ser com `https://exemple.cat/.well-known/openid-configuration`.
fr: Votre fournisseur OpenID Connect doit implémenter l'[URL de découverte (discovery URL)](https://openid.net/specs/openid-connect-discovery-1_0.html). Définissez ici l'url de découverte, qui devrait être quelque chose comme `https://example.com/.well-known/openid-configuration`.
pt_br: Seu provedor OpenID Connect deve implementar a [URL de descoberta](https://openid.net/specs/openid-connect-discovery-1_0.html). Basta definir aqui a URL de descoberta, que deve ser algo como `https://example.com/.well-known/openid-configuration`.

source: Note: if your provider use the standard `/.well-known/openid-configuration` path, you can omit it. For example `https://accounts.google.com` will work.
ca: Nota: si el vostre proveïdor utilitza el camí estàndard `/.well-known/openid-configuration`, podeu ometre-lo. Per exemple, `https://accounts.google.com` funcionarà.
fr: Note : si votre fournisseur utilise le chemin standard `/.well-known/openid-configuration`, vous pouvez l'omettre. Par exemple, `https://accounts.google.com` fonctionnera.
pt_br: Observação: se o seu provedor usar o caminho padrão `/.well-known/openid-configuration`, você pode omiti-lo. Por exemplo, `https://accounts.google.com` funcionará.

source: Your application Client ID.
ca: L'identificador de client de la vostra aplicació (ID de client).
fr: L'identifiant du client de votre application (Client ID).
pt_br: ID do cliente do seu aplicativo.

source: You application Client secret.
ca: La clau secreta de la vostra aplicació (client secret).
fr: La clé secrète de votre application (Client secret).
pt_br: Seu aplicativo Cliente secreto.

source: In addition to that, you can also configure one or several "standard" Open ID Connect provider (Google, Facebook, ...).
ca: A més d'això, també podeu configurar un o més proveïdors «estàndard» d'Open ID Connect (Google, Facebook, etc.).
fr: En plus de cela, vous pouvez également configurer un ou plusieurs fournisseurs Open ID Connect "standards" (Google, Facebook, ...).
pt_br: Além disso, você também pode configurar um ou vários provedores "padrão" do Open ID Connect (Google, Facebook, ...).

source: For these providers, discovery url and button label are preset. You just have to create an OAuth2 application on the provider side, and configure Client ID and Client Secret.
ca: Per a aquests proveïdors, l'URL de descoberta i l'etiqueta del botó estan predefinits. Només cal que creeu una aplicació OAuth2 al costat del proveïdor i configureu l'identificador i el secret del client.
fr: Pour ces fournisseurs, l'url de découverte et l'étiquette du bouton sont prédéfinies. Il suffit de créer une application OAuth2 du côté du fournisseur et de configurer l'ID et le secret du client.
pt_br: Para esses provedores, a URL de descoberta e o rótulo do botão são predefinidos. Basta criar uma aplicação OAuth2 no lado do provedor e configurar o ID do Cliente e o Segredo do Cliente.

source: If you think of a standard provider that is not available, you can ask for implementation by [opening a new issue](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues).
ca: Si teniu en compte un proveïdor estàndard que no està disponible, podeu sol·licitar la implementació [obrint un nou tiquet](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues).
fr: Si vous pensez à un fournisseur standard qui n'est pas disponible, vous pouvez en demander la mise en œuvre en [ouvrant un nouveau ticket](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues).
pt_br: Se você pensar em um provedor padrão que não está disponível, você pode solicitar a implementação [abrindo um novo problema](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues).

source: If the button does not appear for end users, there might be a configuration issue. You can try the [diagnostic tool](/peertube-plugin-livechat/documentation/installation/troubleshooting/) to get more information.
ca: Si el botó no apareix és visible pot haver-hi un problema de configuració. Podeu provar l'[eina de diagnòstic](/peertube-plugin-livechat/ca/documentation/installation/troubleshooting/) per obtenir més informació.
fr: Si le bouton n'apparaît pas pour les utilisateur⋅rices finaux, il se peut qu'il y ait un problème de configuration. Vous pouvez essayer l'[outil de diagnostic](/peertube-plugin-livechat/fr/documentation/installation/troubleshooting/) pour obtenir plus d'informations.
pt_br: Se o botão não aparecer para os usuários finais, pode haver um problema de configuração. Você pode tentar a [ferramenta de diagnóstico](/peertube-plugin-livechat/documentation/installation/troubleshooting/) para obter mais informações.

source: Note: if you are connected to your Peertube account, the button will never show. So use a private browser window to test.
ca: Nota: si heu iniciat sessió al vostre compte de PeerTube, el botó no apareixerà mai. Utilitzeu una finestra d'incògnit per provar.
fr: Note : si vous êtes connecté⋅e à votre compte Peertube, le bouton ne s'affichera jamais. Utilisez une fenêtre de navigation privée pour tester.
pt_br: Observação: se você estiver conectado à sua conta do Peertube, o botão nunca será exibido. Portanto, use uma janela privada do navegador para testar.

source: If the button is displayed but is not working, check your Peertube logs. It could be because the remote service does not use standard scopes or attribute names.
ca: Si el botó apareix però no funciona, comproveu els registres de Peertube. Això podria ser perquè el servei remot no utilitza àmbits ni noms d'atributs estàndard.
fr: Si le bouton s'affiche mais ne fonctionne pas, vérifiez les journaux de Peertube. Cela peut être dû au fait que le service distant n'utilise pas des scopes ou des noms d'attributs standard.
pt_br: Se o botão for exibido, mas não funcionar, verifique seus logs do Peertube. Pode ser que o serviço remoto não use escopos ou nomes de atributos padrão.

source: More to come
ca: Més per vindre…
fr: Plus à venir...
pt_br: Mais por vir

source: Other authentication methods will be implemented in the future.
ca: Altres mètodes d'autenticació s'implementaran en el futur.
fr: D'autres méthodes d'authentification seront mises en œuvre à l'avenir.
pt_br: Outros métodos de autenticação serão implementados no futuro.

source: Plugin Peertube Livechat administration
ca: Administració del connector PeerTube Livechat
fr: Administration du Plugin Peertube Livechat
pt_br: Administração do plugin Peertube Livechat

source: Admin documentation
ca: Documentació d'administració
fr: Documentation administrateur⋅rice
pt_br: Documentação do administrador

source: Advanced firewall rules for the Prosody server
ca: Regles avançades del tallafoc per al servidor Prosody
pt_br: Regras avançadas de firewall para o servidor Prosody

source: Prosody mod_firewall
ca: mod_firewall Prosody
fr: mod_firewall Prosody
pt_br: Prosódia mod_firewall

source: You can enable [mod_firewall](https://modules.prosody.im/mod_firewall) on your Prosody server.
ca: Podeu habilitar [mod_firewall](https://modules.prosody.im/mod_firewall) al vostre servidor de Prosody.
fr: Vous pouvez activer [mod_firewall](https://modules.prosody.im/mod_firewall) sur votre serveur Prosody.
pt_br: Você pode habilitar [mod_firewall](https://modules.prosody.im/mod_firewall) no seu servidor Prosody.

source: Doing so, Peertube admins will be able to define advanced firewall rules.
ca: Això permetrà a l'administració de PeerTube definir regles avançades del tallafoc.
fr: Ainsi, les administrateurs de Peertube pourront définir des règles avancées de pare-feu.
pt_br: Ao fazer isso, os administradores do Peertube poderão definir regras avançadas de firewall.

source: These rules could be used to run arbitrary code on the server. If you are a hosting provider, and you don't want to allow Peertube admins to write such rules, you can disable the online editing by creating a `disable_mod_firewall_editing` file in the plugin directory (`plugins/data/peertube-plugin-livechat/disable_mod_firewall_editing`). This is opt-out, as Peertube admins can already run arbitrary code just by installing any plugin. You can still use mod_firewall by editing files directly on the server.
ca: Aquestes regles es podrien utilitzar per executar codi arbitrari al servidor. Si sou un proveïdor d'allotjament i no voleu permetre que els administradors de PeerTube escriguin aquestes regles, podeu desactivar l'edició en línia creant un fitxer `disable_mod_firewall_editing` al directori de connectors (`plugins/data/peertube-plugin-livechat/disable_mod_firewall_editing`). Això és deshabilitar, ja que els administradors de PeerTube ja poden executar codi arbitrari només instal·lant qualsevol connector. Encara podeu utilitzar mod_firewall editant fitxers directament al servidor.
pt_br: Essas regras podem ser usadas para executar código arbitrário no servidor. Se você for um provedor de hospedagem e não quiser permitir que os administradores do Peertube criem tais regras, você pode desativar a edição online criando um arquivo `disable_mod_firewall_editing` no diretório do plugin (`plugins/data/peertube-plugin-livechat/disable_mod_firewall_editing`). Isso é uma opção de desativação, pois os administradores do Peertube já podem executar código arbitrário simplesmente instalando qualquer plugin. Você ainda pode usar o mod_firewall editando arquivos diretamente no servidor.

source: Edit rules
ca: Editar les regles
pt_br: Editar regras

source: First, you must enable the feature in the [plugin settings](/peertube-plugin-livechat/documentation/admin/settings).
ca: Primer, heu d'habilitar la funció a [Configuració del connector](/peertube-plugin-livechat/ca/documentation/admin/settings).
fr: Tout d'abord, veuillez activer la fonctionnalité dans les [paramètres plugin](/peertube-plugin-livechat/fr/documentation/admin/settings).
pt_br: Primeiro, você deve habilitar o recurso nas [configurações do plugin](/peertube-plugin-livechat/documentation/admin/settings).

source: Just bellow the settings, you will find a "Configure mod_firewall" button. This button will open a configuration page.
ca: Just a sota de la configuració trobareu el botó «Configura mod_firewall». Aquest botó obrirà una pàgina de configuració.
fr: Juste en dessous des paramètres, vous trouverez un bouton « Configurer mod_firewall ». Ce bouton ouvrira une page de configuration.
pt_br: Logo abaixo das configurações, você encontrará o botão "Configurar mod_firewall". Este botão abrirá uma página de configuração.

source: Here you can add several configuration files.
ca: Aquí podeu afegir diversos fitxers de configuració.
pt_br: Aqui você pode adicionar vários arquivos de configuração.

source: You can enable/disable each files.
ca: Podeu activar/desactivar cada fitxer.
fr: Vous pouvez activer/désactiver chaque fichier.
pt_br: Você pode ativar/desativar cada arquivo.

source: Files will be loaded in the alphabetical order. You can use a number as prefix to easily choose the order.
ca: Els fitxers es carreguen per ordre alfabètic. Podeu utilitzar prefixos numèrics per configurar fàcilment l'ordre.
fr: Les fichiers sont chargés dans l'ordre alphabétique. Vous pouvez utiliser des préfixes numériques pour facilement en définir l'ordre.
pt_br: Os arquivos serão carregados em ordem alfabética. Você pode usar um número como prefixo para escolher a ordem facilmente.
