Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: You can also edit these firewall rules directly on the server, in the `plugins/data/peertube-plugin-livechat/prosody/mod_firewall_config/` directory. File names must only contains alphanumerical characters, underscores and hyphens. The extension must be `.pfw`, or `.pfw.disabled` if you want to disable a file. Please be sure that the peertube system user has write access to these files, else the web editing interface will fail. Once you have edited these files, you must reload prosody. This can be done by saving the plugin settings, or saving the mod_firewall configuration in the web interface, or by restarting Peertube.
ca: També podeu editar aquestes regles del tallafoc directament al servidor, al directori `plugins/data/peertube-plugin-livechat/prosody/mod_firewall_config/`. Els noms dels fitxers només han de contenir caràcters alfanumèrics, guions baixos i guions. L'extensió ha de ser `.pfw`, o `.pfw.disabled` si voleu desactivar un fitxer. Assegureu-vos que el compte del sistema peertube tingui accés d'escriptura a aquests fitxers, en cas contrari, la interfície d'edició web fallarà. Un cop hàgiu editat aquests fitxers, heu de tornar a carregar Prosody. Això es pot fer desant la configuració del connector, desant la configuració del mod_firewall a la interfície web o reiniciant Peertube.
pt_br: Você também pode editar essas regras de firewall diretamente no servidor, no diretório `plugins/data/peertube-plugin-livechat/prosody/mod_firewall_config/`. Os nomes dos arquivos devem conter apenas caracteres alfanuméricos, sublinhados e hífens. A extensão deve ser `.pfw` ou `.pfw.disabled` se desejar desabilitar um arquivo. Certifique-se de que o usuário do sistema peertube tenha acesso de gravação a esses arquivos, caso contrário, a interface de edição web falhará. Após editar esses arquivos, você deve recarregar o prosody. Isso pode ser feito salvando as configurações do plugin, salvando a configuração do mod_firewall na interface web ou reiniciando o Peertube.

source: When you save the configuration, the server will automatically reload it, and your rules will apply immediatly. You can check that there is no parsing error in the Prosody error log. To do so, you can read the `plugins/data/peertube-plugin-livechat/prosody/prosody.err` file, or use the [diagnostic tool](/peertube-plugin-livechat/documentation/installation/troubleshooting/) that will show last Prosody errors.
ca: Quan deseu la configuració, el servidor la tornarà a carregar automàticament i les vostres regles s'aplicaran immediatament. Podeu comprovar que no hi hagi cap error d'anàlisi al registre d'errors de Prosody. Per fer-ho, podeu llegir el fitxer `plugins/data/peertube-plugin-livechat/prosody/prosody.err` o utilitzar l'[eina de diagnòstic](/peertube-plugin-livechat/ca/documentation/installation/troubleshooting/) que mostra els últims errors de Prosody.
pt_br: Ao salvar a configuração, o servidor a recarregará automaticamente e suas regras serão aplicadas imediatamente. Você pode verificar se não há erros de análise no log de erros do Prosody. Para isso, leia o arquivo `plugins/data/peertube-plugin-livechat/prosody/prosody.err` ou use a [ferramenta de diagnóstico](/peertube-plugin-livechat/documentation/installation/troubleshooting/) que mostrará os últimos erros do Prosody.

source: Examples
ca: Exemples
pt_br: Exemplos

source: Don't hesitate to share your rules. To do so, you can for example edit this [page](/peertube-plugin-livechat/contributing/document/#write-documentation).
ca: No dubteu a compartir les vostres normes. Per fer-ho, podeu, per exemple, editar aquesta [pàgina](/peertube-plugin-livechat/contributing/document/#write-documentation).
pt_br: Não hesite em compartilhar suas regras. Para isso, você pode, por exemplo, editar esta [página](/peertube-plugin-livechat/contributing/document/#write-documentation).

source: Plugin Peertube Livechat settings
ca: Configuració del connector Livechat de PeerTube
fr: Paramètres du Plugin Peertube Livechat
pt_br: Configurações do plugin Peertube Livechat

source: Settings
ca: Configuració
fr: Paramètres
pt_br: Configurações

source: This section describes the plugin settings page.
ca: Aquesta secció descriu la pàgina de configuració del connector.
fr: Cette section décrit la page de configuration du plugin.
pt_br: Esta seção descreve a página de configurações do plugin.

source: Changing this setting will restart the chat server, and all users will be disconnected for a short time.
ca: Si canvieu aquesta configuració, es reiniciarà el servidor de xat i tots els usuaris es desconnectaran durant un breu període de temps.
fr: La modification de ce paramètre redémarre le serveur de tchat et tous les utilisateur⋅rices seront déconnecté⋅es pendant une courte période.
pt_br: Alterar esta configuração reiniciará o servidor de bate-papo e todos os usuários serão desconectados por um curto período.

source: When pressing the «List rooms» button, all existing chatrooms will be listed. You can then find them and moderated them.
ca: Quan premeu el botó «Llista de sales» s'enumeren totes les sales de xat existents, a continuació les podeu trobar i moderar.
fr: Lorsque vous appuyez sur le bouton "Lister les salles", toutes les salles de chat existantes sont listées. Vous pouvez alors les trouver et les modérer.
pt_br: Ao clicar no botão "Listar salas", todas as salas de bate-papo existentes serão listadas. Você poderá encontrá-las e moderá-las.

source: Federation
ca: Federació
fr: Fédération
pt_br: Federação

source: Following settings concern the federation with other Peertube instances, and other fediverse softwares.
ca: La configuració següent es refereix a la federació amb altres instàncies de PeerTube i altres programes del fedivers.
fr: Les paramètres suivants concernent la fédération avec d'autres instances Peertube et d'autres logiciels du fediverse.
pt_br: As configurações a seguir dizem respeito à federação com outras instâncias do Peertube e outros softwares diversos.

source: Authentication
ca: Autenticació
fr: Authentification
pt_br: Autenticação

source: In case you have any trouble with the long term authentication tokens, you can disable the feature here.
ca: Si teniu problemes amb les fitxes d'autenticació a llarg termini, podeu desactivar aquesta funció aquí.
fr: Si vous avez des problèmes avec les jetons d'authentification à long terme, vous pouvez désactiver cette fonctionnalité ici.
pt_br: Caso você tenha algum problema com os tokens de autenticação de longo prazo, você pode desabilitar o recurso aqui.

source: See the detailed documentation page:
ca: Vegeu la pàgina de documentació detallada:
fr: Voir la page de documentation détaillée :
pt_br: Veja a página de documentação detalhada:

source: [External Authentication](/peertube-plugin-livechat/documentation/admin/external_auth/)
ca: [Autenticació externa](/peertube-plugin-livechat/ca/documentation/admin/external_auth/)
fr: [Authentification Externe](/peertube-plugin-livechat/fr/documentation/admin/external_auth/)
pt_br: [Autenticação externa](/peertube-plugin-livechat/documentation/admin/external_auth/)

source: Channel advanced configuration
ca: Configuració avançada del canal
fr: Configuration avancée de la chaîne
pt_br: Configuração avançada do canal

source: Following settings concern the advanced channel options: users will be able to add some customization on their channels, activate the moderation bot, ...
ca: La configuració següent es refereix a les opcions avançades del canal: els usuaris podran personalitzar els seus canals, activar el bot de moderació, etc.
fr: Les paramètres suivants concernent les options de chaîne avancées : les utilisateur⋅rices pourront personnaliser leurs chaînes, activer le bot de modération, ...
pt_br: As configurações a seguir dizem respeito às opções avançadas do canal: os usuários poderão adicionar alguma personalização em seus canais, ativar o bot de moderação, ...

source: If you encounter any issue with this feature, you can disable it.
ca: Si teniu un problema amb aquesta funció, podeu desactivar-la.
fr: Si vous rencontrez un problème avec cette fonctionnalité, vous pouvez la désactiver.
pt_br: Caso encontre algum problema com esse recurso, você pode desativá-lo.

source: Chat behaviour
ca: Comportament del xat
fr: Comportement en chat
pt_br: Comportamento de bate-papo

source: This feature enables a «share chat link» modal. With this modal, you can generate URLs to join the chat. The chat can be customized (readonly mode, use the current theme, ...).
ca: Aquesta funció us permet habilitar una finestra modal «comparteix l'enllaç de xat». Amb aquest modal podeu generar URL per unir-vos al xat. El xat es pot personalitzar (mode de només lectura, ús del tema actual, etc.).
fr: Cette fonctionnalité permet d'activer une fenêtre modale "partager le lien du chat". Avec cette modale, vous pouvez générer des URL pour rejoindre le tchat. Le tchat peut être personnalisé (mode lecture seule, utilisation du thème actuel, ...).
pt_br: Este recurso permite o modal "compartilhar link de bate-papo". Com este modal, você pode gerar URLs para entrar no bate-papo. O bate-papo pode ser personalizado (modo somente leitura, usar o tema atual, ...).

source: You can for example generate a readonly URL and use it in OBS to integrate the chat in your live stream!
ca: Per exemple, podeu generar un URL de només lectura i utilitzar-lo a OBS per integrar el xat a la vostra emissió en directe!
fr: Vous pouvez par exemple générer une URL en lecture seule et l'utiliser dans OBS pour intégrer le chat dans votre flux en direct !
pt_br: Você pode, por exemplo, gerar uma URL somente leitura e usá-la no OBS para integrar o chat na sua transmissão ao vivo!

source: This setting allows you to choose who can access this modal.
ca: Aquesta configuració us permet triar qui pot accedir a aquesta finestra modal.
fr: Ce paramètre vous permet de choisir qui peut accéder à cette fenêtre modale.
pt_br: Esta configuração permite que você escolha quem pode acessar este modal.

source: The video owner will be able to activate web chats.
ca: El propietari del vídeo podrà activar el xat en línia.
fr: Le⋅a propriétaire de la vidéo pourra activer le tchat en ligne.
pt_br: O proprietário do vídeo poderá ativar chats na web.

source: Note: for now this feature simply hide the chat. In a future release, the chat will be replaced by a message saying «please log in to [...]». See [v5.7.0 Release Notes](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md#570) for more information.
ca: Nota: de moment, aquesta funcionalitat simplement amaga el xat. En una versió futura, el xat serà substituït per un missatge que especifiqui «si us plau connectar-vos […]». Consulteu les notes de la versió [5.7.0](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md#570) per obtenir més informació.
fr: Note : pour l'instant, c'est fonctionnalité masque simplement le tchat. Dans une future version, le tchat sera remplacé par un message précisant «merci de vous connecter [...]». Voir les notes de publication [de la version 5.7.0](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md#570) pour plus d'informations.
pt_br: Observação: por enquanto, este recurso simplesmente oculta o chat. Em uma versão futura, o chat será substituído por uma mensagem dizendo "faça login em [...]". Consulte [Notas da versão v5.7.0](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md#570) para obter mais informações.

source: **Important note**: If you enable this feature, and are using a custom reverse proxy on front of Peertube, please make sure that your setup is correctly configured to forward real user's IPs to Peertube. Otherwise it could block all anonymous users at once.
ca: **Nota important**: Si activeu aquesta funció i utilitzeu un servidor intermediari invers personalitzat davant de PeerTube, assegureu-vos que l'heu configurat correctament per reenviar IP d'usuari real a PeerTube. En cas contrari podria bloquejar tots els usuaris anònims alhora.
fr: **Note importante** : Si vous activez cette fonctionnalité, et que vous utilisez un reverse proxy personnalisé devant Peertube, merci de vous assurer que vous avez correctement configuré celui-ci pour faire suivre les IPs réelles des utilisateur⋅rices à Peertube. Sinon cela pourrait bloquer tous les utilisateur⋅rices anonymes d'un coup.
pt_br: **Observação importante**: Se você habilitar esse recurso e estiver usando um proxy reverso personalizado na frente do Peertube, certifique-se de que sua configuração esteja configurada corretamente para encaminhar IPs de usuários reais para o Peertube. Caso contrário, ele poderá bloquear todos os usuários anônimos de uma só vez.

source: Theming
ca: Tematització
fr: Personnalisation de l'apparence
pt_br: Tematização

source: You can choose from several different sets the default avatars that will be used for chat users.
ca: Podeu triar entre diversos jocs diferents els avatars predeterminats que s'utilitzaran per als usuaris de xat.
fr: Vous pouvez choisir parmi plusieurs jeux différents les avatars par défaut qui seront utilisés pour les utilisateurs du tchat.
pt_br: Você pode escolher entre vários conjuntos diferentes de avatares padrões que serão usados pelos usuários do bate-papo.

source: {{% livechat_label avatar_set_option_sepia %}}: [David Revoy's Peertube avatar generator](https://www.peppercarrot.com/extras/html/2023_peertube-generator/), [CC-By](https://creativecommons.org/licenses/by/4.0/) license
ca: {{% livechat_label avatar_set_option_sepia %}}: [Generador d'avatars PeerTube de David Revoy](https://www.peppercarrot.com/extras/html/2023_peertube-generator/), Llicència [CC-By](https://creativecommons .org/licenses/by/4.0/)
fr: {{% livechat_label avatar_set_option_sepia %}} : [Générateur d'avatars Peertube de David Revoy](https://www.peppercarrot.com/extras/html/2023_peertube-generator/), Licence [CC-By](https://creativecommons.org/licenses/by/4.0/)
pt_br: {{% livechat_label avatar_set_option_sepia %}}: [Gerador de avatar Peertube de David Revoy](https://www.peppercarrot.com/extras/html/2023_peertube-generator/), licença [CC-By](https://creativecommons.org/licenses/by/4.0/)

source: {{% livechat_label avatar_set_option_cat %}}: [David Revoy's cat avatar generator](https://www.peppercarrot.com/extras/html/2016_cat-generator/), [CC-By](https://creativecommons.org/licenses/by/4.0/) license
ca: {{% livechat_label avatar_set_option_cat %}}: [Generador d'avatars de xat per David Revoy](https://www.peppercarrot.com/extras/html/2016_cat-generator/), Llicència [CC-By](https: //creativecommons .org/licenses/by/4.0/)
fr: {{% livechat_label avatar_set_option_cat %}} : [Générateur d'avatar de chat de David Revoy](https://www.peppercarrot.com/extras/html/2016_cat-generator/), Licence [CC-By](https://creativecommons.org/licenses/by/4.0/)
pt_br: {{% livechat_label avatar_set_option_cat %}}: [Gerador de avatar de gato de David Revoy](https://www.peppercarrot.com/extras/html/2016_cat-generator/), [CC-By](https://creativecommons.org/licenses/by/4.0/) licença

source: {{% livechat_label avatar_set_option_bird %}}: [David Revoy's bird avatar generator](https://www.peppercarrot.com/extras/html/2019_bird-generator/), [CC-By](https://creativecommons.org/licenses/by/4.0/) license
ca: {{% livechat_label avatar_set_option_bird %}}: [Generador d'avatars d'ocells de David Revoy](https://www.peppercarrot.com/extras/html/2019_bird-generator/), Llicència [CC-By](https://creativecommons.org/licenses/by/4.0/)
fr: {{% livechat_label avatar_set_option_bird %}} : [Générateur d'avatar d'oiseaux de David Revoy](https://www.peppercarrot.com/extras/html/2016_cat-generator/), Licence [CC-By](https://creativecommons.org/licenses/by/4.0/)
pt_br: {{% livechat_label avatar_set_option_bird %}}: [Gerador de avatar de pássaros de David Revoy](https://www.peppercarrot.com/extras/html/2019_bird-generator/), licença [CC-By](https://creativecommons.org/licenses/by/4.0/)

source: {{% livechat_label avatar_set_option_fenec %}}: [David Revoy's fenec/mobilizon avatar generator](https://www.peppercarrot.com/extras/html/2020_mobilizon-generator/), [CC-By](https://creativecommons.org/licenses/by/4.0/) license
ca: {{% livechat_label avatar_set_option_fenec %}}: [Generador d'avatar fenec/mobilizon de David Revoy](https://www.peppercarrot.com/extras/html/2020_mobilizon-generator/), Llicència [CC-By](https://creativecommons.org/licenses/by/4.0/)
fr: {{% livechat_label avatar_set_option_fenec %}} : [Générateur d'avatar fénnec/mobilizon de David Revoy](https://www.peppercarrot.com/extras/html/2020_mobilizon-generator/), licence [CC-By](https://creativecommons.org/licenses/by/4.0/)
pt_br: {{% livechat_label avatar_set_option_fenec %}}: [Gerador de avatar fenec/mobilizon de David Revoy](https://www.peppercarrot.com/extras/html/2020_mobilizon-generator/), licença [CC-By](https://creativecommons.org/licenses/by/4.0/)

source: {{% livechat_label avatar_set_option_abstract %}}: [David Revoy's Abstract avatar generator](https://www.peppercarrot.com/extras/html/2017_abstract-generator/index.php), [CC-By](https://creativecommons.org/licenses/by/4.0/) license
ca: {{% livechat_label avatar_set_option_abstract %}}: [Generador d'avatars abstractes de David Revoy](https://www.peppercarrot.com/extras/html/2017_abstract-generator/index.php), llicència [CC-By]( https: //creativecommons.org/licenses/by/4.0/)
fr: {{% livechat_label avatar_set_option_abstract %}} : [Générateur d'avatar abstrait de David Revoy](https://www.peppercarrot.com/extras/html/2017_abstract-generator/index.php), licence [CC-By](https://creativecommons.org/licenses/by/4.0/)
pt_br: {{% livechat_label avatar_set_option_abstract %}}: [Gerador de avatar abstrato de David Revoy](https://www.peppercarrot.com/extras/html/2017_abstract-generator/index.php), licença [CC-By](https://creativecommons.org/licenses/by/4.0/)

source: {{% livechat_label avatar_set_option_legacy %}}: Based on [David Revoy' work](https://www.davidrevoy.com), [AGPL-v3](https://www.gnu.org/licenses/agpl-3.0.en.html) license
ca: {{% livechat_label avatar_set_option_legacy %}}: basat en el treball de [David Revoy](https://www.davidrevoy.com), llicència [AGPL-v3](https://www.gnu.org/licenses/agpl -3.0.fr.html)
fr: {{% livechat_label avatar_set_option_legacy %}} : Basé sur le travail de [David Revoy](https://www.davidrevoy.com), licence [AGPL-v3](https://www.gnu.org/licenses/agpl-3.0.fr.html)
pt_br: {{% livechat_label avatar_set_option_legacy %}}: Baseado no trabalho de [David Revoy](https://www.davidrevoy.com), licença [AGPL-v3](https://www.gnu.org/licenses/agpl-3.0.en.html)

source: If you can't see the change immediatly, it could be because of your browser cache. Just clear your browser session storage, or restart it.
ca: Si no veieu el canvi immediatament, es pot deure a la memòria cau del vostre navegador. Esborreu l'emmagatzematge de la sessió del navegador o reinicieu-lo.
fr: Si vous ne voyez pas le changement immédiatement, cela peut être dû au cache de votre navigateur. Effacez le stockage de session de votre navigateur ou redémarrez-le.
pt_br: Se você não conseguir ver a alteração imediatamente, pode ser por causa do cache do seu navegador. Basta limpar o armazenamento de sessão do navegador ou reiniciá-lo.

source: You can choose which theme to use for ConverseJS:
ca: Podeu triar el tema que voleu utilitzar per a ConverseJS:
fr: Vous pouvez choisir le thème à utiliser pour ConverseJS :
pt_br: Você pode escolher qual tema usar para o ConverseJS:

source: Peertube theme: this is a special theme, made especially for peertube's integration.
ca: Tema PeerTube: aquest és un tema especial, dissenyat específicament per a la integració a PeerTube.
fr: Thème Peertube : il s'agit d'un thème spécial, conçu spécialement pour l'intégration dans Peertube.
pt_br: Tema Peertube: este é um tema especial, feito especialmente para integração com o Peertube.

source: Default ConverseJS theme: this is the default ConverseJS theme.
ca: Tema de ConverseJS predeterminat: aquest és el tema per defecte de ConverseJS.
fr: Thème ConverseJS par défaut : c'est le thème ConverseJS par défaut.
pt_br: Tema padrão do ConverseJS: este é o tema padrão do ConverseJS.

source: ConverseJS cyberpunk theme: this is a theme provided by ConverseJS.
ca: Tema cyberpunk de ConverseJS: aquest és un tema proporcionat per ConverseJS.
fr: Thème ConverseJS cyberpunk : il s'agit d'un thème fourni par ConverseJS.
pt_br: Tema cyberpunk do ConverseJS: este é um tema fornecido pelo ConverseJS.

source: Chat server advanced settings
ca: Configuració avançada del xat
fr: Paramètres avancés du tchat
pt_br: Configurações avançadas do servidor de bate-papo

source: The plugin comes with an AppImage that is used to run the [Prosody XMPP server](https://prosody.im). If this AppImage is not working, you can fallback to the Prosody that is packaged for your server. Just install the `prosody` package.
ca: El connector ve amb una AppImage que s'utilitza per executar el [servidor XMPP Prosody](https://prosody.im). Si aquesta AppImage no funciona, podeu recórrer a la versió de Prosody empaquetada per al vostre servidor. Simplement instal·leu el paquet `prosody`.
fr: Le plugin est livré avec une AppImage qui est utilisée pour exécuter le [serveur XMPP Prosody](https://prosody.im). Si cet AppImage ne fonctionne pas, vous pouvez vous rabattre sur la version de Prosody qui est packagé pour votre serveur. Installez simplement le paquet `prosody`.
pt_br: O plugin vem com uma AppImage que é usada para executar o [servidor Prosody XMPP](https://prosody.im). Se esta AppImage não estiver funcionando, você pode recorrer ao Prosody que vem empacotado para o seu servidor. Basta instalar o pacote `prosody`.

source: This setting should only be used if the plugin is broken, and waiting for a patch.
ca: Aquesta configuració només s'ha d'utilitzar si el connector està trencat i s'espera una solució.
fr: Ce paramètre ne devrait être utilisé que si le plugin est cassé et en attente d'un correctif.
pt_br: Esta configuração só deve ser usada se o plugin estiver quebrado e aguardando um patch.
