Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: If you are watching a live on an instance on which you have no account, but you have an account on another instance: if the livechat plugin is installed on both instances, it is possible to join the chat using your account. To do so, just open the video on your instance (you can for example copy/paste the video url in the search field of your instance).
fr: Si vous regardez un direct sur une instance où vous n'avez pas de compte, mais que vous avez un compte Peertube sur une autre instance : sous réserve que le plugin livechat soit installé sur les deux instances, vous pouvez rejoindre le tchat avec votre compte. Pour cela, ouvrez la vidéo sur votre instance (vous pouvez par exemple copier/coller l'url de la vidéo dans le champs de recherche de votre instance).
pt_br: Se você estiver assistindo a uma transmissão ao vivo em uma instância na qual não possui conta, mas possui uma conta em outra instância: se o plugin de chat ao vivo estiver instalado em ambas as instâncias, é possível entrar no chat usando sua conta. Para isso, basta abrir o vídeo na sua instância (você pode, por exemplo, copiar/colar a URL do vídeo no campo de busca da sua instância).

source: If you have a Peertube account on another Peertube instance
fr: Si vous avez un compte Peertube sur une autre instance Peertube
pt_br: Se você tiver uma conta Peertube em outra instância Peertube

source: If you have a Peertube account, but not on the current instance, there is a "{{% livechat_label login_using_external_account %}}" button. This button will open a dialog where you can enter your Peertube instance URL. Once you entered it, it will check if the livechat plugin is available on the remote instance, and if the video is available. If it is the case, you will be redirected to the video on the remote instance.
fr: Si vous avez un compte Peertube, mais pas sur l'instance courante, il y a un bouton "{{% livechat_label login_using_external_account %}}". Ce bouton va ouvrir un fenêtre de dialogue où vous pourrez entrer l'URL de votre instance Peertube. Une fois celle-ci entrée, cela vérifiera sur le plugin livechat est disponible sur l'instance distante, et si la vidéo y est disponible. Dans ce cas, vous serez redirigé vers la vidéo sur l'instance distante.
pt_br: Se você possui uma conta no Peertube, mas não na instância atual, há um botão "{{% livechat_label login_using_external_account %}}". Este botão abrirá uma caixa de diálogo onde você pode inserir a URL da sua instância do Peertube. Após a inserção, o recurso verificará se o plugin de chat ao vivo está disponível na instância remota e se o vídeo está disponível. Se for o caso, você será redirecionado para o vídeo na instância remota.

source: Chatting
fr: Tchatter
pt_br: Bate-papo

source: To send messages, just type them in the "message" field on the bottom of the screen. You can send them by pressing the enter key on your keyboard, or by clicking on the "send" button.
fr: Pour envoyer des messages, saisissez les simplement dans le champ «message» en bas de l'écran. Vous pouvez les envoyer en tapant la touche entrée de votre clavier, ou en cliquant sur le bouton «envoyer».
pt_br: Para enviar mensagens, basta digitá-las no campo "mensagem" na parte inferior da tela. Você pode enviá-las pressionando a tecla Enter no seu teclado ou clicando no botão "enviar".

source: If you want to add line breaks in your messages, you can use the "shift+enter" key combination.
fr: Si vous voulez ajouter des retours à la ligne à vos messages, vous pouvez utiliser la combinaison de touche «shift + entrée».
pt_br: Se quiser adicionar quebras de linha em suas mensagens, você pode usar a combinação de teclas "shift+enter".

source: You can add emojis to your messages. You can for example use the emojis menu, or directly type emojis shortcuts like `:smiley:`.
fr: Vous pouvez ajouter des emojis à vos messages. Vous pouvez par exemple utiliser le menu emojis, ou directement taper les raccourcis du type `:smiley:`.
pt_br: Você pode adicionar emojis às suas mensagens. Você pode, por exemplo, usar o menu de emojis ou digitar diretamente atalhos de emojis como `:smiley:`.

source: You can mention other participants. To do so, you can type the first nickname letters, then press the tab key. You can also type `@`: this will directly open the menu. You can also click on a nickname in the participants list to insert it in the message field.
fr: Vous pouvez mentionner d'autres participant⋅es. Pour cela, vous pouvez taper les premières lettres du pseudo, puis appuyer sur la touche tabulation. Vous pouvez aussi taper le caractère `@` : cela ouvrira directement un menu. Vous pouvez également cliquer sur un pseudonyme dans la liste des participant⋅es pour insérer celui-ci dans le champs de saisie de message.
pt_br: Você pode mencionar outros participantes. Para isso, digite as primeiras letras do apelido e pressione a tecla Tab. Você também pode digitar `@`: isso abrirá o menu diretamente. Você também pode clicar em um apelido na lista de participantes para inseri-lo no campo de mensagem.

source: Participants list
fr: Liste des participant⋅es
pt_br: Lista de participantes

source: To see the list of participants, just open the right menu:
fr: Pour voir la liste des participant⋅es, ouvrez juste le menu droit :
pt_br: Para ver a lista de participantes, basta abrir o menu à direita:

source: You can see that some participants have special rights (moderator, owner, ...).
fr: Vous pouvez constater que certain⋅es participant⋅es ont des droits spéciaux (modérateur⋅rice, propriétaire, ...).
pt_br: Você pode ver que alguns participantes têm direitos especiais (moderador, proprietário, ...).

source: Chat dropdown menu
fr: Menu déroulant du tchat
pt_br: Menu suspenso de bate-papo

source: There is a dropdown menu on the top of the chat, with some advanced features. This is especially useful for [moderation features](/peertube-plugin-livechat/documentation/user/streamers/moderation). Available features depends on your access level.
fr: Il y a un menu déroulant au dessus du tchat, comprenant quelques fonctionnalités avancées. Cela est particulièrement utile pour les [fonctions de modération](/peertube-plugin-livechat/fr/documentation/user/streamers/moderation). Les fonctionnalités disponibles dépendent de votre niveau d'accès.
pt_br: Há um menu suspenso na parte superior do chat, com alguns recursos avançados. Isso é especialmente útil para [recursos de moderação](/peertube-plugin-livechat/documentation/user/streamers/moderation). Os recursos disponíveis dependem do seu nível de acesso.

source: Opening full screen
fr: Ouvrir en plein écran
pt_br: Abrindo em tela cheia

source: On top of the chat, there is a button to open the chat in fullscreen. This will open a new browser tab with the following content:
fr: Au dessus du tchat, il y a un bouton qui permet de l'ouvrir en plein écran. Cela l'ouvrira dans un nouvel onglet du navigateur avec le contenu suivant :
pt_br: Na parte superior do chat, há um botão para abrir o chat em tela cheia. Isso abrirá uma nova aba do navegador com o seguinte conteúdo:

source: It can be easier to chat using a full browser tab.
fr: Cela peut être plus facile de tchatter en utilisant un onglet de navigateur complet.
pt_br: Pode ser mais fácil bater papo usando uma aba inteira do navegador.

source: Changing nickname
fr: Changer de pseudonyme
pt_br: Mudando o apelido

source: You can change your nickname by typing `/nick your_new_nickname` in the message field.
fr: Vous pouvez changer de pseudonyme en tapant `/nick votre_nouveau_pseudo` dans le champs de message.
pt_br: Você pode alterar seu apelido digitando `/nick seu_novo_apelido` no campo de mensagem.

source: You can also change your nickname using the chat menu.
fr: Vous pouvez également changer votre pseudonyme en utilisant le menu déroulant du tchat.
pt_br: Você também pode alterar seu apelido usando o menu de bate-papo.

source: Connect to chat using a XMPP client
fr: Se connecter au tchat avec un client XMPP
pt_br: Conecte-se ao chat usando um cliente XMPP

source: XMPP Clients
fr: Clients XMPP
pt_br: Clientes XMPP

source: This chat plugin relies on the XMPP protocol (also known as Jabber). It is therefore possible to connect to the chats using [XMPP client software](https://en.wikipedia.org/wiki/XMPP#Clients). This can be useful for example to facilitate moderation operations.
fr: Ce module de tchat repose sur le protocole XMPP, aussi connu sous le nom de Jabber. Il est donc possible de se connecter aux tchats en utilisant des [logiciels clients XMPP](https://fr.wikipedia.org/wiki/Clients_XMPP). Cela peut par exemple être utile pour faciliter les opérations de modération.
pt_br: Este plugin de bate-papo utiliza o protocolo XMPP (também conhecido como Jabber). Portanto, é possível conectar-se aos bate-papos usando [software cliente XMPP](https://en.wikipedia.org/wiki/XMPP#Clients). Isso pode ser útil, por exemplo, para facilitar as operações de moderação.

source: The features described on this page must be enabled and configured by your Peertube instance's administrators. You may therefore not have access to them.
fr: Les fonctions décrites dans cette page doivent être activées et configurées par les administrateur⋅rices de votre instance Peertube. Il se peut donc que vous n'y ayez pas accès.
pt_br: Os recursos descritos nesta página devem ser habilitados e configurados pelos administradores da sua instância do Peertube. Portanto, você pode não ter acesso a eles.

source: If this feature is enabled on your instance, you can connect to Peertube chats using any XMPP account.
fr: Si cette fonctionnalité est activée sur votre instance, vous pouvez vous connecter aux tchats Peertube en utilisant un compte XMPP quelconque.
pt_br: Se esse recurso estiver habilitado na sua instância, você poderá se conectar aos chats do Peertube usando qualquer conta XMPP.

source: To get the address of the room you want to join, you can use the "share chat" button that is located above the chat:
fr: Pour obtenir l'adresse du salon à rejoindre, vous pouvez utiliser la fenêtre de «partage» du tchat, dont le bouton est situé au dessus du tchat :
pt_br: Para obter o endereço da sala na qual deseja entrar, você pode usar o botão "compartilhar chat" localizado acima do chat:

source: By default, the share button is only visible to the owner of the video, and the admins/moderators of the instance. However, admins can decide to display this button for everyone.
fr: Par défaut, le bouton de partage n'est visible que pour le ou la propriétaire de la vidéo, et les admins/modérateur⋅rices de l'instance. Toutefois, les admins peuvent décider d'afficher ce bouton pour tout le monde.
pt_br: Por padrão, o botão de compartilhamento fica visível apenas para o proprietário do vídeo e os administradores/moderadores da instância. No entanto, os administradores podem optar por exibir este botão para todos.

source: Then, choose "{{% livechat_label connect_using_xmpp %}}":
pt_br: Em seguida, escolha "{{% livechat_label connect_using_xmpp %}}":

source: Then you just have to click on "open" or copy/paste the address of the chat room into your XMPP client (using the "join a room" feature).
fr: Il vous suffit ensuite, soit de cliquer sur «ouvrir», soit de copier/coller l'adresse du salon dans votre client XMPP (en utilisant la fonctionnalité «rejoindre un salon»).
pt_br: Depois, basta clicar em "abrir" ou copiar/colar o endereço da sala de bate-papo no seu cliente XMPP (usando o recurso "entrar em uma sala").

source: Peertube plugin livechat documentation
fr: Documentation du plugin peertube-plugin-livechat
pt_br: Documentação do plugin Peertube livechat

source: Peertube livechat
fr: Peertube plugin livechat
pt_br: Bate-papo ao vivo do Peertube

source: You can use the language selector in the left menu to view this documentation in different languages. Some translations are missing or incomplete. In this case, you'll see the English version of the text.
fr: Vous pouvez utiliser le sélecteur de langue dans le menu de gauche pour afficher cette documentation dans différentes langues. Certaines traductions sont manquantes ou incomplètes. Dans ce cas, vous verrez la version anglaise du texte.
pt_br: Você pode usar o seletor de idiomas no menu à esquerda para visualizar esta documentação em diferentes idiomas. Algumas traduções estão ausentes ou incompletas. Neste caso, você verá a versão em inglês do texto.

source: Welcome the **Peertube Livechat Plugin** documentation.
fr: Bienvenue sur la documentation du **Plugin Peertube Livechat**.
pt_br: Bem-vindo à documentação do **Peertube Livechat Plugin**.

source: [Peertube](https://joinpeertube.org/) is a decentralized streaming platform, that can provide both live streaming and VOD (Video On Demand) features. The present plugin adds chatting capatibilities to your Peertube installation, allowing viewers to interract with streamers.
fr: [Peertube](https://joinpeertube.org/) est une plateforme de streaming décentralisée, qui peut permettre de diffuser aussi bien des directs que de la vidéo à la demande (VOD : Video On Demand). Ce plugin permet d'ajouter la possibilité de tchatter à votre installation Peertube, permettant ainsi des interactions avec les streameur⋅euses.
pt_br: [Peertube](https://joinpeertube.org/) é uma plataforma de streaming descentralizada que oferece recursos de transmissão ao vivo e VOD (Vídeo sob Demanda). Este plugin adiciona recursos de bate-papo à sua instalação do Peertube, permitindo que os espectadores interajam com os streamers.

source: To have a glimpse on this plugin capabilities, checkout the [introduction](/peertube-plugin-livechat/intro/). For more precise informations, please find bellow the summary of this documentation.
fr: Pour avoir un aperçu des possibilités de ce plugin, aller jeter un œil à [l'introduction](/peertube-plugin-livechat/fr/intro/). Pour des informations plus précises, vous trouverez plus bas le sommaire de cette documentation.
pt_br: Para ter uma ideia dos recursos deste plugin, confira a [introdução](/peertube-plugin-livechat/intro/). Para informações mais precisas, veja abaixo o resumo desta documentação.

source: You can use the searchbox in the left menu to quickly find specific documentation parts.
fr: Vous pouvez utiliser la barre de recherche dans le menu gauche pour rapidement trouver des documentations spécifiques.
pt_br: Você pode usar a caixa de pesquisa no menu à esquerda para encontrar rapidamente partes específicas da documentação.

source: What is the livechat plugin?
fr: Qu'est ce que le plugin livechat ?
pt_br: O que é o plugin LiveChat?

source: This [Peertube](https://joinpeertube.org/) plugin is meant to provide a chat system for Peertube videos.
fr: Ce plugin pour [Peertube](https://joinpeertube.org/) permet d'intégrer un système de «chat» (clavardage) à coté des vidéos.
pt_br: Este plugin [Peertube](https://joinpeertube.org/) foi criado para fornecer um sistema de bate-papo para vídeos do Peertube.

source: By default, once you have installed the plugin on your Peertube instance, a chat room will automatically be created for each live stream.
fr: Par défaut, une fois le plugin installé sur votre instance Peertube, un salon de discussion sera automatiquement créé pour chaque diffusion en direct.
pt_br: Por padrão, depois de instalar o plugin na sua instância do Peertube, uma sala de bate-papo será criada automaticamente para cada transmissão ao vivo.

source: On the following screenshot, you can see a classic Peertube video page, with a chat room on the right (click on the picture to view it full screen):
fr: Sur la capture d'écran ci-dessous, vous pouvez voir une page classique de vidéo Peertube, avec un salon de discussion sur la droite (cliquez sur l'image pour la voir en plein écran) :
pt_br: Na captura de tela a seguir, você pode ver uma página de vídeo clássica do Peertube, com uma sala de bate-papo à direita (clique na imagem para vê-la em tela cheia):

source: The chat room will be accessible for all viewers, even those who don't have an account on your instance. Those "anonymous" users just have to choose a nickname before they can begin talking in the chat.
fr: Le salon sera accessible pour les spectateur⋅rices, même si celleux-ci n'ont pas de compte sur votre instance. Ces utilisateur⋅rices «anonymes» auront juste à choisir un pseudonyme avant de pouvoir parler dans le tchat.
pt_br: A sala de bate-papo estará acessível a todos os espectadores, mesmo aqueles que não possuem uma conta na sua instância. Os usuários "anônimos" só precisam escolher um apelido antes de poderem começar a conversar no bate-papo.

source: By default, the chat is displayed next to the video. But you can open it in another browser tab, using the button on top of it :
fr: Par défaut, le chat est affiché à côté de la vidéo. Mais vous pouvez l'ouvrir dans un autre onglet du navigateur, en utilisant le bouton situé au-dessus :
pt_br: Por padrão, o chat é exibido ao lado do vídeo. Mas você pode abri-lo em outra aba do navegador, usando o botão na parte superior:

source: You can test the livechat plugin with this [demo page](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae).
fr: Vous pouvez tester le plugin livechat via cette [page de démo](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae).
pt_br: Você pode testar o plugin livechat com esta [página de demonstração](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae).

source: Installation
pt_br: Instalação

source: As a Peertube administrator, you can setup this plugin on your instance simply by using the Peertube plugin marketplace included in the administration interface. Search for "livechat", then click "install": that's it!
fr: En tant qu'administrateur⋅rice Peertube, vous pouvez installer ce plugin sur votre instance simplement en utilisant la boutique de plugin incluse dans l'interface d'administration de Peertube. Cherchez «livechat», puis cliquez sur «installer» : et voilà !
pt_br: Como administrador do Peertube, você pode configurar este plugin na sua instância simplesmente usando o marketplace de plugins do Peertube incluído na interface de administração. Pesquise por "livechat" e clique em "instalar": pronto!

source: Livechat capabilities
fr: Possibilités du livechat
pt_br: Capacidades de chat ao vivo

source: The plugin has many advanced features. As it is using the [XMPP](https://xmpp.org/) standard "under the hood", it is possible for Peertube administrators to allow advanced usages (connection using XMPP clients, chatbots, bridge to other chat protocols, ...). More information in the relevant sections of this documentation.
fr: Le plugin a de nombreuses fonctionnalités avancées. Il utilise le standard [XMPP](https://xmpp.org/) «sous le capot», ce qui permet aux adminstrateur⋅rices d'activer des fonctionnalités avancées (se connecter en utilisant des clients XMPP, bots de tchat, pont vers d'autres protocoles, ...). Plus d'informations dans les sections correspondantes de cette documentation.
pt_br: O plugin possui muitos recursos avançados. Como utiliza o padrão [XMPP](https://xmpp.org/) "por baixo dos panos", os administradores do Peertube podem permitir usos avançados (conexão usando clientes XMPP, chatbots, ponte para outros protocolos de bate-papo, etc.). Mais informações nas seções relevantes desta documentação.

source: Peertube is part of the fediverse: you can create a network of Peertube instances, sharing content between them.
fr: Peertube fait parti du fédiverse : vous pouvez créer un réseau d'instances Peertube, en partageant le contenu entre elles.
pt_br: O Peertube faz parte do fediverse: você pode criar uma rede de instâncias do Peertube, compartilhando conteúdo entre elas.

source: This plugin can handle federation: when viewing a livestream from a remote instance, you will join the chat room with your local account. You will be automatically connected with your current nickname and avatar.
fr: Ce plugin est capable de gérer la fédération : quand vous regardez un direct d'une instance distante, vous rejoindrez le tchat avec votre compte local. Vous serez automatiquement connecté avec votre pseudonyme et votre avatar.
pt_br: Este plugin pode lidar com federação: ao assistir a uma transmissão ao vivo de uma instância remota, você entrará na sala de bate-papo com sua conta local. Você será conectado automaticamente com seu apelido e avatar atuais.

source: Of course, for the federation to work, the plugin must be installed on both instances.
fr: Bien sûr, pour que la fédération fonctionne, le plugin doit être installé sur les deux instances.
pt_br: Claro que, para que a federação funcione, o plugin deve ser instalado em ambas as instâncias.

source: Some times, you have to protect your community from bad people. As an instance administrator, you can choose to disallow federation for the livechat plugin. If remote actors behave badly, streamers, moderators and administrators can ban or mute users.
fr: Parfois, vous devez protéger votre communauté contre les personnes mal intentionnées. En tant qu'administrateur⋅rice d'instance, vous pouvez choisir de désactiver la fédération pour le plugin livechat. Si des acteur⋅rices distant⋅es se comportent mal, les streameur⋅euses, les modérateur⋅rices et les administrateur⋅rices peuvent bannir ou mettre en sourdine des utilisateur⋅ices.
pt_br: Às vezes, você precisa proteger sua comunidade de pessoas mal-intencionadas. Como administrador da instância, você pode optar por proibir a federação para o plugin de chat ao vivo. Se atores remotos se comportarem mal, streamers, moderadores e administradores podem banir ou silenciar usuários.

source: This plugin comes with a built-in [chat bot](/peertube-plugin-livechat/documentation/user/streamers/bot/). Check its documentation for more information.
fr: Ce plugin via avec un [bot de tchat](/peertube-plugin-livechat/fr/documentation/user/streamers/bot/) intégré. Veuillez vous référer à sa documentation pour plus d'informations.
pt_br: Este plugin vem com um [bot de bate-papo] integrado (/peertube-plugin-livechat/documentation/user/streamers/bot/). Consulte a documentação para mais informações.

source: You can also plug in any other XMPP chat bot, using [XMPP External Components](https://prosody.im/doc/components). To do so, you just have to configure External Components access in the [plugin settings](/peertube-plugin-livechat/documentation/admin/settings).
fr: Vous pouvez également brancher tout autre bot de tchat XMPP, en utilisant les [Composants XMPP externes](https://prosody.im/doc/components). Pour cela, vous avez juste à configurer les accès des composants externes via la page des [paramètres du plugin](/peertube-plugin-livechat/fr/documentation/admin/settings).
pt_br: Você também pode conectar qualquer outro bot de bate-papo XMPP usando [Componentes Externos XMPP](https://prosody.im/doc/components). Para isso, basta configurar o acesso aos Componentes Externos nas [configurações do plugin](/peertube-plugin-livechat/documentation/admin/settings).

source: When joining a room, you will see previous messages. Even those sent before you joined the room.
fr: En rejoignant un salon, vous verrez les anciens messages. Même ceux envoyés avant que vous ne rejoignez le salon.
pt_br: Ao entrar em uma sala, você verá mensagens anteriores, inclusive aquelas enviadas antes de você entrar na sala.

source: This behaviour can be changed room by room, and default retention duration can be chosen by instance's administrators.
fr: Ce comportement peut changer salon par salon, et la durée de rétention peut être choisie par les administrateur⋅rices de l'instance.
pt_br: Esse comportamento pode ser alterado em cada sala, e a duração de retenção padrão pode ser escolhida pelos administradores da instância.
