Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: The `build-client.js` script will read the `client/@types/global.d.ts`, search for such constants, and load their values from the languages files.
ca: L'script `build-client.js` llegirà el fitxer `client/@types/global.d.ts`, cercarà aquestes constants i carregarà els seus valors des del fitxer d'idioma.
fr: Le script `build-client.js` va lire ce fichier `client/@types/global.d.ts`, chercher pour de telles constantes, et charger leurs valeurs depuis le fichier de langue.
pt_br: O script `build-client.js` lerá `client/@types/global.d.ts`, procurará por tais constantes e carregará seus valores dos arquivos de idiomas.

source: Now, you can simply call `peertubeHelpers.translate(LOC_USE_CHAT)` in your code.
ca: Ara podeu utilitzar `peertubeHelpers.translate(LOC_USE_CHAT)` al vostre codi.
fr: Vous pouvez maintenant utiliser `peertubeHelpers.translate(LOC_USE_CHAT)` dans votre code.
pt_br: Agora, você pode simplesmente chamar `peertubeHelpers.translate(LOC_USE_CHAT)` no seu código.

source: Use translations in back-end code
ca: Utilitzar traduccions al «back-end»
fr: Utiliser un segment dans le code back-end
pt_br: Use traduções no código de back-end

source: In theory, the only parts of the backend code where you need localization is the settings declaration and standardized data (ActivityPub, RSS, ...). Here we need to get english strings from the translation key.
ca: En teoria les úniques parts del codi que necessiten traduccions són les declaracions de paràmetres i la generació de dades estandarditzades (ActivityPub, RSS, ...). Aquí hem de recuperar les cadenes en anglès de les claus de traducció.
fr: En théorie, les seules parties du code qui ont besoin de traductions sont les déclarations de paramètres et la génération de données standardisées (ActivityPub, RSS, ...). Ici on a besoin de récupérer les chaînes anglaises à partir des clés de traduction.
pt_br: Em teoria, as únicas partes do código de backend onde você precisa de localização são a declaração de configurações e os dados padronizados (ActivityPub, RSS, ...). Aqui, precisamos obter strings em inglês da chave de tradução.

source: Note: you should never need another language translation from backend code. Localization must be done on front-end.
ca: Nota: mai no hauríeu de necessitar idiomes diferents de l'anglès per al codi del «back-end». Les traduccions s'han de fer a la part del «front-end».
fr: Note : vous ne devriez jamais avoir besoin d'autres langues que l'anglais pour le code backend. Les traductions doivent se faire coté front-end.
pt_br: Observação: você nunca deve precisar de outra tradução de idioma do código do backend. A localização deve ser feita no frontend.

source: There is a `lib/loc.ts` module providing a `loc()` function. Just pass it the key to have the english string: `loc('diagnostic')`'.
ca: Hi ha un mòdul `lib/loc.ts` que proporciona una funció `loc()`. Només cal passar la clau per recuperar la cadena en anglès: `loc('diagnostic')`.
fr: Il y a un module `lib/loc.ts` qui fourni une function `loc()`. Passez juste la clé pour récupérer la phrase anglaise : `loc('diagnostic')`.
pt_br: Existe um módulo `lib/loc.ts` que fornece uma função `loc()`. Basta passar a chave para obter a string em inglês: `loc('diagnostic')`'.

source: Documentation translation
ca: Traducció de documentació
fr: Traduction de la documentation
pt_br: Tradução de documentação

source: The documentation translation is done using the corresponding Weblate component.
ca: La traducció de la documentació es fa mitjançant el component Weblate corresponent.
fr: La traduction de la documentation est faite en utilisant le composant Weblate correspondant.
pt_br: A tradução da documentação é feita usando o componente Weblate correspondente.

source: There is a specific "Hugo shortcodes" you can use to display an application string. Saying you want to display the name of the button "open_chat_new_window", you can use this in the documentation markdown file:
ca: Hi ha un «codi curt Hugo» específic que us permet mostrar una cadena de l'aplicació. Per exemple, si voleu mostrar l'etiqueta del botó «open_chat_new_window» podeu utilitzar el codi següent al fitxer de documentació:
fr: Il y a un «shortcode Hugo» spécifique qui vous permet d'afficher une chaîne issue de l'application. Si vous voulez par exemple afficher le libellé du bouton «open_chat_new_window», vous pouvez utiliser le code suivant dans le fichier markdown de la documentation :
pt_br: Existe um "Hugo shortcodes" específico que você pode usar para exibir uma string de aplicativo. Se você quiser exibir o nome do botão "open_chat_new_window", pode usar isso no arquivo markdown da documentação:

source: {{%/* livechat_label open_chat_new_window */%}}
pt_br: {{%/* rótulo_do_chat_ao_vivo abrir_nova_janela_do_chat */%}}

source: You can also prevent a whole page from being translating by adding `livechatnotranslation: true` in the Yaml Font Matter section:
ca: També podeu evitar que es tradueixi una pàgina sencera afegint `livechatnotranslation:true` a la secció Yaml Font Matter del fitxer:
fr: Vous pouvez également empêcher qu'une page entière ne soit traduite en ajoutant `livechatnotranslation:true` dans la section Yaml Font Matter du fichier :
pt_br: Você também pode impedir que uma página inteira seja traduzida adicionando `livechatnotranslation: true` na seção Yaml Font Matter:

source: --- title: "Third party" description: "Displaying the livechat with 3rd party software." weight: 20 chapter: false livechatnotranslation: true ---
pt_br: --- título: "Terceiros" descrição: "Exibindo o chat ao vivo com software de terceiros." peso: 20 capítulo: falso livechatnotranslation: verdadeiro ---

source: Never translate a string in the `livechat.en.pot` file, it would be ignored. Instead, edit directly the markdown files.
ca: No traduïu mai una cadena al fitxer `livechat.en.pot`, això s'ignorarà. En lloc d'això editeu el fitxer «markdown» directament.
fr: Ne traduisez jamais une chaîne dans le fichier `livechat.en.pot`, ce serait ignoré. À la place, éditez directement le fichier markdown.
pt_br: Nunca traduza uma string no arquivo `livechat.en.pot`, pois ela será ignorada. Em vez disso, edite diretamente os arquivos markdown.

source: If a string contains a link, you can change it for the correct link in the translated language. For example, for a link to this documentation, you can add the language code in the url.
ca: Si una cadena conté un enllaç podeu canviar-lo a l'enllaç correcte en l'idioma de destinació. Per exemple, si és un enllaç a la documentació podeu afegir el codi d'idioma a l'URL.
fr: Si une chaîne contient un lien, vous pouvez le changer pour le lien correct dans la langue cible. Par exemple, si c'est un lien vers la documentation, vous pouvez ajouter le code langue dans l'url.
pt_br: Se uma string contiver um link, você poderá alterá-lo para o link correto no idioma traduzido. Por exemplo, para um link para esta documentação, você pode adicionar o código do idioma na URL.

source: Some strings are block of code. Don't translate code. But you can translate comments, or parameters if relevant.
ca: Algunes cadenes són blocs de codi. No els traduïu. Tanmateix, podeu traduir els comentaris, o els paràmetres si és rellevant.
fr: Certaines chaînes sont des blocs de code. Ne les traduisez pas. Toutefois vous pouver traduire les commentaires, ou les paramètres si c'est pertinent.
pt_br: Algumas strings são blocos de código. Não traduza o código. Mas você pode traduzir comentários ou parâmetros, se relevante.

source: If you are not sure, just don't translate, and ask what to do.
ca: En cas de dubte no traduïu i pregunteu què fer.
fr: Si vous avez un doute, ne traduisez pas, et demandez plutôt quoi faire.
pt_br: Se não tiver certeza, simplesmente não traduza e pergunte o que fazer.

source: The tool I use to handle translations for the documentation can have strange behaviours. When I add sentences that looks like other existing sentences, it sometimes copies existing translations. So, when you have translations marked as "to check", please make sure it doesn't copy a string that has nothing to do with the english one before validating.
ca: Les eines utilitzades per gestionar les traduccions de documentació poden tenir un comportament estrany. Quan s'afegeix una frase semblant una altra existent, de vegades copiarà les traduccions. Per tant, quan tingueu traduccions marcades com a «per comprovar», si us plau assegureu-vos que no hagi copiat cap traducció que no tingui res a veure amb la versió en anglès abans de validar.
fr: L'outils utilisé pour gérer les traductions de la documentation peut avoir des comportements étranges. Quand j'ajoute une phrase qui ressemble à une phrase existante, il va parfois copier les traductions. Donc quand vous avez des traductions marquées comme «à vérifier», veuillez vous assurer qu'il n'a pas copié une traduction qui n'a rien à voir avec la version anglaise avant de valider.
pt_br: A ferramenta que utilizo para gerenciar traduções da documentação pode apresentar comportamentos estranhos. Quando adiciono frases que se parecem com outras frases existentes, às vezes ela copia traduções existentes. Portanto, quando houver traduções marcadas como "para verificar", certifique-se de que ela não copie uma string que não tenha nada a ver com a em inglês antes de validar.

source: If you are now sure about the context of a string, you can check the string location in the weblate's right pane, and open the corresponding documentation page. For example, for a string located in the file `support/documentation/content/en/documentation/user/streamers.md`, the corresponding url is `https://livingston.frama.io/peertube-plugin-livechat/documentation/user/streamers/`.
ca: Si no esteu segurs del context d'una cadena de text podeu comprovar la ubicació de la cadena d'origen al tauler dret de Weblate i obrir la pàgina de documentació corresponent. Per exemple, per a un canal situat al fitxer `support/documentation/content/en/documentation/user/streamers.md`, l'URL corresponent és `https://livingston.frama.io/peertube-plugin-livechat/documentation/user/streamers/`.
fr: Si vous n'êtes pas sûr du contexte d'une chaîne de texte, vous pouvez vérifier l'emplacement de la chaîne source dans le panneau droit de Weblate, et ouvrir la page de documentation correspondante. Par exemple, pour une chaîne localisée dans le fichier `support/documentation/content/en/documentation/user/streamers.md`, l'url correspondante est `https://livingston.frama.io/peertube-plugin-livechat/documentation/user/streamers/`.
pt_br: Se você tiver certeza sobre o contexto de uma string, pode verificar a localização da string no painel direito do Weblate e abrir a página de documentação correspondente. Por exemplo, para uma string localizada no arquivo `support/documentation/content/en/documentation/user/streamers.md`, a URL correspondente é `https://livingston.frama.io/peertube-plugin-livechat/documentation/user/streamers/`.

source: Generic recommandations
ca: Recomanacions genèriques
fr: Recommandations génériques
pt_br: Recomendações genéricas

source: Please be inclusive in your wordings, and please respect the [code of coduct](/peertube-plugin-livechat/contributing/codeofconduct/).
ca: Si us plau sigueu inclusius/ves en les vostres paraules i respecteu el [codi de conducta](/peertube-plugin-livechat/contributing/codeofconduct/).
fr: Merci d'être inclusif⋅ve dans vos phrasés, et merci de respecter le [code de conduite](/peertube-plugin-livechat/contributing/codeofconduct/).
pt_br: Por favor, seja inclusivo em suas formulações e respeite o [código de conduta](/peertube-plugin-livechat/contributing/codeofconduct/).

source: Plugin Credits
ca: Crèdits del connector
fr: Crédits pour le plugin
pt_br: Créditos do plugin

source: Credits
ca: Crèdits
fr: Crédits
pt_br: Créditos

source: [package.json](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/package.json), [COPYRIGHT](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/COPYRIGHT.md) and [LICENSE](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/LICENSE) files contain the license information for this software and its dependencies.
ca: Els fitxers [package.json](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/package.json), [COPYRIGHT](https://github.com/JohnXLivingston/peertube-plugin -livechat/blob/main/COPYRIGHT.md) i [LICENSE](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/LICENSE) contenen la informació de la llicència d'aquest programari i les seves dependències (en anglès).
fr: Les fichiers [package.json](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/package.json), [COPYRIGHT](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/COPYRIGHT.md) et [LICENSE](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/LICENSE) contiennent les informations sur la licence du présent logiciel (en anglais).
pt_br: Os arquivos [package.json](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/package.json), [COPYRIGHT](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/COPYRIGHT.md) e [LICENSE](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/LICENSE) contêm as informações de licença deste software e suas dependências.

source: The plugin is maintained by [John Livingston](https://www.john-livingston.fr/).
ca: El connector el manté [John Livingston](https://www.john-livingston.fr/).
fr: Le plugin est maintenu par [John Livingston](https://www.john-livingston.fr/).
pt_br: O plugin é mantido por [John Livingston](https://www.john-livingston.fr/).

source: Thanks to [Framasoft](https://framasoft.org) for making [Peertube](https://joinpeertube.org/) possible, for the financial support, and for hosting the project translations on their [Weblate instance](https://weblate.framasoft.org).
ca: Gràcies a [Framasoft](https://framasoft.org) per fer possible [Peertube](https://joinpeertube.org/), pel suport financer i per allotjar les traduccions del projecte a [la seva instància Weblate] (https: //weblate.framasoft.org).
fr: Merci à [Framasoft](https://framasoft.org) pour avoir rendu [Peertube](https://joinpeertube.org/) possible, pour le support financier, et pour héberger les traductions du projet sur [leur instance Weblate](https://weblate.framasoft.org).
pt_br: Obrigado a [Framasoft](https://framasoft.org) por tornar [Peertube](https://joinpeertube.org/) possível, pelo suporte financeiro e por hospedar as traduções do projeto em sua [instância Weblate](https://weblate.framasoft.org).

source: Thanks to [ritimo](https://www.ritimo.org/) for the financial support.
ca: Gràcies a [ritimo](https://www.ritimo.org/) pel suport financer.
fr: Merci à [ritimo](https://www.ritimo.org/) pour le support financier.
pt_br: Obrigado a [ritimo](https://www.ritimo.org/) pelo apoio financeiro.

source: Thanks to [Code Lutin](https://www.codelutin.com/) and [Rétribution Copie Publique](https://copiepublique.fr/) for the financial support.
ca: Gràcies a [Code Lutin](https://www.codelutin.com/) i [Rétribution Copie Publique](https://copiepublique.fr) pel suport financer.
fr: Merci à [Code Lutin](https://www.codelutin.com/) et à la [Rétribution Copie Publique](https://copiepublique.fr) pour le support financier.
pt_br: Obrigado a [Code Lutin](https://www.codelutin.com/) e [Rétribution Copie Publique](https://copiepublique.fr/) pelo apoio financeiro.

source: Thanks to [NlNet](https://nlnet.nl/) and the [NGI0 Entrust fund](https://nlnet.nl/entrust/) for the financial support.
ca: Gràcies a [NlNet](https://nlnet.nl/) i [NGI0 Entrust fund](https://nlnet.nl/entrust/) pel suport financer.
fr: Merci à [NlNet](https://nlnet.nl/) et au [fond NGI0 Entrust](https://nlnet.nl/entrust/) pour le support financier.
pt_br: Obrigado a [NlNet](https://nlnet.nl/) e ao [fundo NGI0 Entrust](https://nlnet.nl/entrust/) pelo apoio financeiro.

source: Thanks to [Octopuce](https://www.octopuce.fr/) for the financial support.
ca: Gràcies a [Octopuce](https://www.octopuce.fr/) pel suport financer.
fr: Merci à [Octopuce](https://www.octopuce.fr/) pour le support financier.
pt_br: Obrigado a [Octopuce](https://www.octopuce.fr/) pelo apoio financeiro.

source: And thanks to all individual contributors who have made a donation via my [liberapay page](https://liberapay.com/JohnLivingston/).
ca: I gràcies per totes les col·laboracions individuals fetes a través de la meva [pàgina de liberapay] (https://liberapay.com/JohnLivingston/).
fr: Et merci à toustes les contributeur⋅rices individuel⋅les qui ont fait un don via ma [page liberapay](https://liberapay.com/JohnLivingston/).
pt_br: E obrigado a todos os colaboradores individuais que fizeram uma doação através da minha [página liberapay](https://liberapay.com/JohnLivingston/).

source: Some advanced features
ca: Algunes funcions avançades
fr: Quelques fonctionnalités avancées
pt_br: Alguns recursos avançados

source: Advanced usage
ca: Ús avançat
fr: Usage avancé
pt_br: Uso avançado

source: Using Matterbridge to bridge with other chats
ca: Emprar Matterbridge per fer de passarel·la amb altres xats
fr: Utiliser Matterbridge pour faire un pont vers d'autres tchats
pt_br: Usando o Matterbridge para fazer a ponte com outros chats

source: Using Matterbridge
ca: Utilitzar Matterbridge
fr: Utiliser Matterbridge
pt_br: Usando Matterbridge

source: The following is based on a tutorial to use Matterbridge with the plugin: [Matterbridge + Peertube](https://gitlab.com/refrac/obs-matterbridge-overlay/-/blob/master/documentation/peertube.md)
ca: El següent es basa en un tutorial per utilitzar Matterbridge amb el connector: [Matterbridge + Peertube](https://gitlab.com/refrac/obs-matterbridge-overlay/-/blob/master/documentation/peertube.md)
fr: Ce qui suit est basé sur un tutoriel pour utiliser Matterbridge avec le plugin : [Matterbridge + Peertube](https://gitlab.com/refrac/obs-matterbridge-overlay/-/blob/master/documentation/peertube.md)
pt_br: O seguinte é baseado em um tutorial para usar o Matterbridge com o plugin: [Matterbridge + Peertube](https://gitlab.com/refrac/obs-matterbridge-overlay/-/blob/master/documentation/peertube.md)

source: Requirements
ca: Requisits
fr: Pré-requis
pt_br: Requisitos

source: [PeerTube plugin livechat](https://github.com/JohnXLivingston/peertube-plugin-livechat) version 3.2.0 or later.
ca: [Livechat connector de PeerTube](https://github.com/JohnXLivingston/peertube-plugin-livechat) versió 3.2.0 o posterior.
fr: [Plugin PeerTube livechat](https://github.com/JohnXLivingston/peertube-plugin-livechat) version 3.2.0 ou supérieure.
pt_br: [Plugin PeerTube livechat](https://github.com/JohnXLivingston/peertube-plugin-livechat) versão 3.2.0 ou posterior.

source: [Matterbridge](https://github.com/42wim/matterbridge) version 1.22.4 or later.
ca: [Matterbridge](https://github.com/42wim/matterbridge) versió 1.22.4 o posterior.
fr: [Matterbridge](https://github.com/42wim/matterbridge) version 1.22.4 ou supérieure.
pt_br: [Matterbridge](https://github.com/42wim/matterbridge) versão 1.22.4 ou posterior.

source: The easiest is if the PeerTube instance and Matterbridge run on the same server.
ca: El més fàcil és si la instància PeerTube i Matterbridge s'executen al mateix servidor.
fr: La solution la plus simple consiste à faire tourner l'instance PeerTube et Matterbridge sur le même serveur.
pt_br: O mais fácil é se a instância do PeerTube e o Matterbridge forem executados no mesmo servidor.

source: Internal connections only (basic)
ca: Només connexions internes (versió simple)
fr: Connexions internes uniquement (version simple)
pt_br: Somente conexões internas (básicas)

source: You will need to enable `{{% livechat_label prosody_c2s_label %}}` in the livechat plugin settings.
ca: Haureu d'habilitar `{{% livechat_label prosody_c2s_label %}}` a la configuració del connector livechat.
fr: Vous devez activer `{{% livechat_label prosody_c2s_label %}}` dans les paramètres du plugin livechat.
pt_br: Você precisará habilitar `{{% livechat_label prosody_c2s_label %}}` nas configurações do plugin de chat ao vivo.

source: This will allow localhost XMPP clients to connect to the Prosody XMPP server.
ca: Això permetrà els clients XMPP locals connectar al servidor XMPP Prosody.
fr: Cela permettra aux clients XMPP de l'hôte local de se connecter au serveur XMPP Prosody.
pt_br: Isso permitirá que clientes XMPP do host local se conectem ao servidor Prosody XMPP.

source: You may need to add some line to your `/etc/hosts`:
ca: És possible que hàgiu d'afegir alguna línia al vostre `/etc/hosts`:
fr: Vous devrez peut-être ajouter une ligne à votre `/etc/hosts` :
pt_br: Talvez você precise adicionar alguma linha ao seu `/etc/hosts`:

source: Replace `example.org` by your actual instance domain name. Afterwards you can continue with the Matterbridge configuration below.
ca: Substituïu `exemple.cat` pel nom de domini de la vostra instància. A continuació, podeu continuar amb la configuració de Matterbridge següent.
fr: Remplacez `example.org` par le nom de domaine de votre instance. Vous pouvez ensuite poursuivre avec la configuration de Matterbridge ci-dessous.
pt_br: Substitua `example.org` pelo nome de domínio da sua instância. Depois disso, você pode continuar com a configuração do Matterbridge abaixo.

source: Allow external connections (advanced)
ca: Permetre connexions externes (avançat)
fr: Autoriser les connexions externes (avancé)
pt_br: Permitir conexões externas (avançado)

source: By default, the internal Prosody XMPP server only listens on localhost (127.0.0.1).
ca: De manera predeterminada el servidor XMPP Prosody intern només escolta a l'host local (127.0.0.1).
fr: Par défaut, le serveur interne XMPP Prosody n'écoute que sur localhost (127.0.0.1).
pt_br: Por padrão, o servidor interno Prosody XMPP escuta apenas no host local (127.0.0.1).

source: It allows to add a list of IPs to listen on, coma separated (spaces will be stripped).
ca: Això afegeix una llista d'adreces IP per escoltar separades per comes (s'eliminaran espais).
fr: Cela permet d'ajouter une liste d'adresses IP sur lesquelles écouter, séparées par des virgules (les espaces seront supprimés).
pt_br: Permite adicionar uma lista de IPs para escutar, separados por vírgulas (os espaços serão removidos).

source: You can also use `*` to listen on all IPv4 interfaces, and `::` for all IPv6. Doing so allows external access to the client to server interface.
ca: També podeu utilitzar `*` per escoltar a totes les interfícies IPv4 i `::` per a totes les interfícies IPv6. Això permet l'accés extern a la interfície client-servidor.
fr: Vous pouvez également utiliser `*` pour écouter sur toutes les interfaces IPv4, et `::` pour toutes les interfaces IPv6. Cela permet un accès externe à l'interface client-serveur.
pt_br: Você também pode usar `*` para escutar em todas as interfaces IPv4 e `::` para todas as IPv6. Isso permite acesso externo à interface cliente-servidor.
