Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Once there, you can enable the bot, and setup several options:
ca: Un cop aquí, podeu activar el bot i configurar algunes opcions:
fr: Une fois ici, vous pouvez activer le bot, et configurer quelques options :
pt_br: Uma vez lá, você pode habilitar o bot e configurar diversas opções:

source: The bot will reload instantly when you save the page.
ca: El bot tornarà a carregar automàticament les seves opcions quan deseu la pàgina.
fr: Le bot recharge automatiquement ses options quand vous sauvegardez la page.
pt_br: O bot será recarregado instantaneamente quando você salvar a página.

source: The bot can automatically moderate duplicate messages.
ca: El bot pot moderar automàticament els missatges duplicats.
pt_br: O bot pode moderar automaticamente mensagens duplicadas.

source: No duplicate message
ca: Cap missatge duplicat
pt_br: Nenhuma mensagem duplicada

source: Configuration
ca: Configuració
pt_br: Configuração

source: The bot can send periodically some messages.
ca: El bot pot enviar alguns missatges periòdicament.
fr: Le bot peut envoyer des messages périodiquement.
pt_br: O bot pode enviar periodicamente algumas mensagens.

source: Timers
ca: Temporitzadors
fr: Messages pré-enregistrés
pt_br: Temporizadores

source: If there is no user in the chatroom, the bot won't send any message.
ca: Si no hi ha ningú a la sala el bot no enviarà cap missatge.
fr: S'il n'y a pas d'utilisateur⋅rice dans le salon, le bot n'enverra pas de message.
pt_br: Se não houver nenhum usuário na sala de bate-papo, o bot não enviará nenhuma mensagem.

source: The bot can automatically moderate messages containing too many special characters.
ca: El bot pot moderar automàticament els missatges que contenen massa caràcters especials.
pt_br: O bot pode moderar automaticamente mensagens que contenham muitos caracteres especiais.

source: Special characters
ca: Caràcters especials
pt_br: Caracteres especiais

source: Peertube channel chatrooms configuration
ca: Configuració de sales de xat del canal PeerTube
fr: Configuration des salons de discussion des chaînes Peertube
pt_br: Configuração de salas de chat do canal Peertube

source: Channel configuration
ca: Configuració del canal
fr: Configuration de la chaîne
pt_br: Configuração de canal

source: In the Peertube left menu, there is a "{{% livechat_label menu_configuration_label %}}" entry:
ca: Al menú esquerre de PeerTube hi ha una entrada «{{% livechat_label menu_configuration_label %}}»:
fr: Dans le menu gauche de Peertube, il y a une entrée «{{% livechat_label menu_configuration_label %}}» :
pt_br: No menu esquerdo do Peertube, há uma entrada "{{% livechat_label menu_configuration_label %}}":

source: This "{{% livechat_label menu_configuration_label %}}" link takes you to a list of your channels. By clicking on a channel, you will then be able to setup some options for your channels:
ca: Aquest enllaç «{{% livechat_label menu_configuration_label %}}» us porta a una llista dels vostres canals. Si feu clic a un canal podreu fer-li algunes configuracions:
fr: Ce lien «{{% livechat_label menu_configuration_label %}}» vous emmène sur une liste de vos chaînes. En cliquant sur une chaîne, vous pourrez effectuer certains réglages pour vos chaînes :
pt_br: Este link "{{% livechat_label menu_configuration_label %}}" leva você a uma lista dos seus canais. Ao clicar em um canal, você poderá configurar algumas opções para ele:

source: Here you can configure:
ca: Aquí podeu configurar:
fr: Ici vous pouvez configurer :
pt_br: Aqui você pode configurar:

source: [{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}](/peertube-plugin-livechat/documentation/user/streamers/moderation) default value
ca: Valor predeterminat per a [{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}](/peertube-plugin-livechat/ca/documentation/user/streamers/moderation)
fr: Valeur par défaut pour [{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}](/peertube-plugin-livechat/fr/documentation/user/streamers/moderation)
pt_br: [{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}](/peertube-plugin-livechat/documentation/user/streamers/moderation) valor padrão

source: [The slow mode](/peertube-plugin-livechat/documentation/user/streamers/slow_mode)
ca: [Mode lent](/peertube-plugin-livechat/ca/documentation/user/streamers/slow_mode)
fr: [Le mode lent](/peertube-plugin-livechat/documentation/user/streamers/slow_mode)
pt_br: [O modo lento](/peertube-plugin-livechat/documentation/user/streamers/slow_mode)

source: [The chat bot](/peertube-plugin-livechat/documentation/user/streamers/bot)
ca: [El bot de xat](/peertube-plugin-livechat/ca/documentation/user/streamers/bot)
fr: [Le bot de tchat](/peertube-plugin-livechat/documentation/fr/user/streamers/bot)
pt_br: [O bot de bate-papo](/peertube-plugin-livechat/documentation/user/streamers/bot)

source: [Custom emojis](/peertube-plugin-livechat/documentation/user/streamers/emojis)
ca: [Emojis personalitzats](/peertube-plugin-livechat/ca/documentation/user/streamers/emojis)
fr: [Emojis personnalisés](/peertube-plugin-livechat/documentation/user/streamers/emojis)
pt_br: [Emojis personalizados](/peertube-plugin-livechat/documentation/user/streamers/emojis)

source: More features to come...
ca: Noves funcions properament…
fr: Nouvelles fonctionnalités à venir...
pt_br: Mais recursos em breve...

source: Plugin peertube-plugin-livechat custom emojis
ca: Emojis personalitzats del connector peertube-plugin-livechat
fr: Emojis personnalisés du plugin peertube-plugin-livechat
pt_br: Plugin peertube-plugin-livechat emojis personalizados

source: Custom emojis
ca: Emojis personalitzats
fr: Emojis personnalisés
pt_br: Emojis personalizados

source: Channel emojis
ca: Emojis del canal
fr: Emojis de la chaîne
pt_br: Emojis do canal

source: Streamers can add custom emojis to their channels.
ca: Els/Les streamers poden afegir emojis personalitzats a llurs canals.
fr: Les streameur⋅euses peuvent ajouter des émojis personnalisés à leurs chaînes.
pt_br: Os streamers podem adicionar emojis personalizados aos seus canais.

source: On the [channel configuration page](/peertube-plugin-livechat/documentation/user/streamers/channel), open the "{{% livechat_label livechat_configuration_channel_emojis_title %}}" tab:
ca: A la [pàgina de configuració del canal](/peertube-plugin-livechat/ca/documentation/user/streamers/channel), obriu la pestanya «{{% livechat_label livechat_configuration_channel_emojis_title %}}»:
fr: Sur la [page de configuration de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/channel), ouvrez l'onglet "{{% livechat_label livechat_configuration_channel_emojis_title %}}" :
pt_br: Na [página de configuração do canal](/peertube-plugin-livechat/documentation/user/streamers/channel), abra a aba "{{% livechat_label livechat_configuration_channel_emojis_title %}}":

source: Import / Export
ca: Importació / Exportació
fr: Importation / Exportation
pt_br: Importação / Exportação

source: On the channel configuration page, there are an "{{% livechat_label action_import %}}" and an "{{% livechat_label action_export %}}" button. The "{{% livechat_label action_export %}}" button generates a file than you can then import on another channel.
ca: A la pàgina de configuració del canal hi ha un botó «{{% livechat_label action_import %}}» i un botó «{{% livechat_label action_export %}}». El botó «{{% livechat_label action_export %}}» genera un fitxer que podeu importar després a un altre canal.
fr: Sur la page de configuration de la chaîne, il y a un bouton "{{% livechat_label action_import %}}" et un bouton "{{% livechat_label action_export %}}". Le bouton "{{% livechat_label action_export %}}" génère un fichier que vous pouvez ensuite importer dans la configuration d'une autre chaîne.
pt_br: Na página de configuração do canal, há um botão "{{% livechat_label action_import %}}" e um botão "{{% livechat_label action_export %}}". O botão "{{% livechat_label action_export %}}" gera um arquivo que você pode importar para outro canal.

source: You can also generate a file to import from any other source (for example you can import your Twitch custom emojis). The file must be a valid JSON file, using the following format:
ca: També podeu generar un fitxer per importar des de qualsevol altra font (per exemple, podeu importar els vostres emojis personalitzats de Twitch). L'arxiu ha de ser un fitxer JSON vàlid, amb el format següent:
fr: Vous pouvez également générer un fichier à importer à partir de n'importe quelle autre source (par exemple, vous pouvez importer vos émojis personnalisés Twitch). Le fichier doit être un fichier JSON valide, au format suivant :
pt_br: Você também pode gerar um arquivo para importar de qualquer outra fonte (por exemplo, você pode importar seus emojis personalizados do Twitch). O arquivo deve ser um arquivo JSON válido, usando o seguinte formato:

source: The `sn` attribute is the short name code. The `url` attribute can be any image url than your browser can access, or a [Data URL](https://developer.mozilla.org/en-US/docs/Web/HTTP/Basics_of_HTTP/Data_URLs) representing the file you want to import.
ca: L'atribut `sn` és el codi del nom curt. L'atribut `url` pot ser qualsevol URL d'imatge a què pugui accedir el vostre navegador o un [URIs de dades, en Espanyol](https://developer.mozilla.org/es/docs/Web/URI/Schemes/data) que representa el fitxer voleu importar.
fr: L'attribut `sn` est le code du nom court. L'attribut `url` peut être n'importe quelle url d'image à laquelle votre navigateur peut accéder, ou une [URL de données](https://developer.mozilla.org/fr-FR/docs/Web/HTTP/Basics_of_HTTP/Data_URLs) représentant le fichier que vous souhaitez importer.
pt_br: O atributo `sn` é o código do nome abreviado. O atributo `url` pode ser qualquer URL de imagem que seu navegador possa acessar ou uma [URL de dados](https://developer.mozilla.org/en-US/docs/Web/HTTP/Basics_of_HTTP/Data_URLs) representando o arquivo que você deseja importar.

source: Plugin peertube-plugin-livechat emojis only mode
ca: Connector peertube-plugin-livechat en mode només emojis
pt_br: Plugin peertube-plugin-livechat modo apenas emojis

source: Emojis only mode
ca: Mode només emojis
pt_br: Modo somente emojis

source: This mode can be usefull for example:
pt_br: Este modo pode ser útil por exemplo:

source: To avoid spam or offensive message when you are not here to moderate.
pt_br: Para evitar spam ou mensagens ofensivas quando você não estiver aqui para moderar.

source: When there are too many speaking participants, and you can't no more moderate correctly.
pt_br: Quando há muitos participantes falando e você não consegue mais moderar corretamente.

source: To enable or disable this feature, use the [chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers), open the "configure" menu. In the form, you will find a "{{% livechat_label emoji_only_mode_title %}}" checkbox.
pt_br: Para ativar ou desativar este recurso, use o [menu suspenso do bate-papo](/peertube-plugin-livechat/documentation/user/viewers), abra o menu "configurar". No formulário, você encontrará uma caixa de seleção "{{% livechat_label emoji_only_mode_title %}}".

source: If you want to enable it for all your chatrooms at once, open the [channel emojis configuration page](/peertube-plugin-livechat/documentation/user/streamers/emojis/), and use the "{{% livechat_label emoji_only_enable_all_rooms %}}" button.
pt_br: Se você quiser habilitá-lo para todas as suas salas de bate-papo de uma só vez, abra a [página de configuração de emojis do canal](/peertube-plugin-livechat/documentation/user/streamers/emojis/) e use o botão "{{% livechat_label emoji_only_enable_all_rooms %}}".

source: How to setup the chat for your live stream
fr: Comment mettre en place le tchat pour vos diffusions en direct
pt_br: Como configurar o chat para sua transmissão ao vivo

source: For streamers
fr: Pour les streameur⋅euses
pt_br: Para streamers

source: Plugin peertube-plugin-livechat moderation delay
fr: Plugin peertube-plugin-livechat délai de modération
pt_br: Atraso de moderação do plugin peertube-plugin-livechat

source: Moderation delay
fr: Délai de modération
pt_br: Atraso de moderação

source: Introduction
pt_br: Introdução

source: As a streamer, you can choose to delay messages in the chat, to let some time to moderators to delete messages before they can even be read by other participants.
fr: En tant que streameur⋅euse, vous pouvez choisir d'appliquer un délai aux messages dans le tchat, afin de laisser un peu de temps aux modérateur⋅rices pour supprimer des messages avant même qu'ils ne soient lus par les autres participant⋅es.
pt_br: Como streamer, você pode optar por atrasar as mensagens no chat, para dar tempo aos moderadores de excluírem as mensagens antes que elas possam ser lidas pelos outros participantes.

source: When this feature is enabled, moderators will see all messages without any delay. Chat participants won't see that their own messages are delayed.
fr: Lorsque cette fonction est activée, les modérateur⋅rices voient tous les messages sans délai. Les participant⋅es au tchat ne verront pas que leurs propres messages sont retardés.
pt_br: Quando este recurso estiver ativado, os moderadores verão todas as mensagens sem atraso. Os participantes do chat não verão que suas próprias mensagens estão atrasadas.

source: Please note that messages sent by moderators will also be delayed, to avoid them to respond to messages that are not even visible by other participants.
fr: Veuillez noter que les messages envoyés par les modérateur⋅rices seront également retardés, afin d'éviter qu'ils ne répondent à des messages qui ne sont même pas encore visibles par les autres participant⋅es.
pt_br: Observe que as mensagens enviadas pelos moderadores também serão atrasadas, para evitar que eles respondam a mensagens que nem são visíveis para os outros participantes.

source: Moderation delay option
fr: Option de délai de modération
pt_br: Opção de atraso de moderação

source: On the [channel configuration page](/peertube-plugin-livechat/documentation/user/streamers/channel), you can set the "{{% livechat_label moderation_delay %}}" option:
fr: Sur la [page de configuration de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/channel), vous pouvez définir une valeur pour l'option "{{% livechat_label moderation_delay %}}" :
pt_br: Na [página de configuração do canal](/peertube-plugin-livechat/documentation/user/streamers/channel), você pode definir a opção "{{% livechat_label moderation_delay %}}":

source: This value will apply as a default value for all your channel's chatrooms.
fr: Cette valeur va s'appliquer comme valeur par défaut pour tous les salons de discussion de votre chaîne.
pt_br: Este valor será aplicado como valor padrão para todas as salas de bate-papo do seu canal.

source: Setting the value to `0` will disable the feature.
fr: La valeur `0` désactive la fonctionnalité.
pt_br: Definir o valor como `0` desabilitará o recurso.

source: Setting the value to a positive integer will set the delay, in seconds, to apply to messages. Please avoid setting the value too high. Ideally it should not exceed a few seconds (4 or 5 seconds for example).
fr: Fixer cette valeur à un nombre entier positif permet de régler le délai, en secondes, à appliquer aux messages. Évitez de fixer une valeur trop élevée. Idéalement, elle ne devrait pas dépasser quelques secondes (4 ou 5 secondes par exemple).
pt_br: Definir o valor como um número inteiro positivo definirá o atraso, em segundos, a ser aplicado às mensagens. Evite definir um valor muito alto. O ideal é que não exceda alguns segundos (4 ou 5 segundos, por exemplo).

source: To modify the value for an already existing room, just open the room "configuration" menu (on top of the chat window), and change the moderation delay value in the configuration form.
fr: Pour modifier la valeur d'un salon déjà existant, il suffit d'ouvrir le menu "configuration" du salon (en haut de la fenêtre de tchat), et de modifier la valeur du délai de modération dans le formulaire de configuration.
pt_br: Para modificar o valor de uma sala já existente, basta abrir o menu "configuração" da sala (na parte superior da janela de bate-papo) e alterar o valor do atraso de moderação no formulário de configuração.

source: Currently, this feature has one known bug: users that join the chat will get all messages, even messages that are still pending for other participants. However, messages sent after they joined will be delayed correctly.
fr: Actuellement, cette fonctionnalité présente un bogue connu : les utilisateur⋅rices qui rejoignent le tchat recevront tous les messages, même ceux qui sont encore en attente pour les autres participant⋅es. Cependant, les messages envoyés après qu'iels aient rejoint le chat seront retardés correctement.
pt_br: Atualmente, este recurso apresenta um bug conhecido: usuários que entram no chat receberão todas as mensagens, mesmo as que ainda estão pendentes para outros participantes. No entanto, as mensagens enviadas após a entrada serão atrasadas corretamente.

source: In the chat
fr: Dans le tchat
pt_br: No chat

source: As a moderator, you will see the remaining time (in seconds) before the message is broadcasted, just besides the message datetime.
fr: En tant que modérateur⋅rice, vous verrez le temps restant (en secondes) avant que le message ne soit diffusé, juste à côté de l'horodatage du message.
pt_br: Como moderador, você verá o tempo restante (em segundos) antes da mensagem ser transmitida, ao lado da data e hora da mensagem.

source: ![Screenshot of a chat message. A timer is displayed next to the message datetime. The timer is in seconds.](/peertube-plugin-livechat/images/moderation_delay_timer.png?classes=shadow,border "Moderation delay timer")
pt_br: ![Captura de tela de uma mensagem de bate-papo. Um cronômetro é exibido ao lado da data e hora da mensagem. O cronômetro está em segundos.](/peertube-plugin-livechat/images/moderation_delay_timer.png?classes=shadow,border "Cronômetro de atraso de moderação")

source: Plugin peertube-plugin-livechat advanced moderation features
fr: Fonctions de modération avancées du plugin peertube-plugin-livechat
pt_br: Recursos avançados de moderação do plugin peertube-plugin-livechat

source: This section is still incomplete.
fr: Cette section est encore incomplète.
pt_br: Esta seção ainda está incompleta.

source: The chat bot
fr: Le bot de tchat
pt_br: O bot de bate-papo

source: You can use a chat bot, that will help you for moderation. Check [the chat bot documentation](/peertube-plugin-livechat/documentation/user/streamers/bot) for more information.
fr: Vous pouvez utiliser un bot de tchat, qui vous aidera pour la modération. Veuillez vous référer à la [documentation du bot de tchat](/peertube-plugin-livechat/documentation/fr/user/streamers/bot) pour plus d'informations.
pt_br: Você pode usar um bot de bate-papo para ajudar na moderação. Consulte [a documentação do bot de bate-papo](/peertube-plugin-livechat/documentation/user/streamers/bot) para mais informações.

source: Accessing moderation tools
fr: Accéder aux outils de modération
pt_br: Acessando ferramentas de moderação

source: You can access room settings and moderation tools using the [chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers) at the top of the chat.
fr: Vous pouvez accéder aux paramètres de la salle et aux outils de modération en utilisant le [menu déroulant du tchat](/peertube-plugin-livechat/fr/documentation/user/viewers) en haut à droite de celui-ci.
pt_br: Você pode acessar as configurações da sala e as ferramentas de moderação usando o [menu suspenso do bate-papo](/peertube-plugin-livechat/documentation/user/viewers) na parte superior do bate-papo.

source: The video owner will be owner of the chat room. This means they can configure the room, delete it, promote other users as admins, ...
fr: Le⋅a propriétaire de la vidéo sera le⋅a propriétaire du salon de discussion. Cela signifie qu'iel peut configurer le salon, le supprimer, promouvoir d'autres utilisateur⋅rices en tant qu'administrateur⋅rices, ...
pt_br: O proprietário do vídeo será o proprietário da sala de bate-papo. Isso significa que ele pode configurar a sala, excluí-la, promover outros usuários como administradores, etc.

source: Starting with livechat v10.0.0, Peertube instance's admins and moderators have no special rights on rooms by default. However, they have a special button available on top of the chat: "{{% livechat_label promote %}}". Clicking this button will give them owner access on the room.
fr: Depuis la version 10.0.0 de livechat, les administrateur⋅rices et modérateur⋅rices de l'instance Peertube n'ont pas de droits particuliers par défaut sur les salons. Cependant, iels ont un bouton spécial disponible en haut du chat : "{{% livechat_label promote %}}". En cliquant sur ce bouton, iels auront un accès propriétaire à la salle.
pt_br: A partir do Livechat v10.0.0, os administradores e moderadores da instância do Peertube não têm direitos especiais nas salas por padrão. No entanto, eles têm um botão especial disponível na parte superior do chat: "{{% livechat_label promote %}}". Clicar neste botão dará a eles acesso de proprietário à sala.

source: You can use [ConverseJS moderation commands](https://conversejs.org/docs/html/features.html#moderating-chatrooms) to moderate the room. When you open the chat room in full screen, there will also be a menu with dedicated commands on the top right.
fr: Vous pouvez utiliser les [commandes de modération ConverseJS](https://conversejs.org/docs/html/features.html#moderating-chatrooms) pour modérer le salon. Lorsque vous ouvrez la salle de discussion en plein écran, un menu avec des commandes dédiées s'affiche en haut à droite.
pt_br: Você pode usar [comandos de moderação do ConverseJS](https://conversejs.org/docs/html/features.html#moderating-chatrooms) para moderar a sala. Ao abrir a sala de bate-papo em tela cheia, também haverá um menu com comandos dedicados no canto superior direito.

source: You can prevent anonymous users to send messages. In such case, only registered users will be able to talk in the chat.
fr: Vous pouvez empêcher les utilisateur⋅rices anonymes d'envoyer des messages. Dans ce cas, seuls les utilisateur⋅rices enregistré⋅es pourront parler dans le tchat.
pt_br: Você pode impedir que usuários anônimos enviem mensagens. Nesse caso, apenas usuários registrados poderão conversar no chat.

source: To enable or disable this feature, use the [chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers), open the "configure" menu. In the form, you will find a "{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}" checkbox.
fr: Pour activer ou désactiver cette fonctionnalité, utilisez le [menu déroulant du chat](/peertube-plugin-livechat/fr/documentation/user/viewers), puis ouvrez le menu "configurer". Dans le formulaire, vous trouverez une case à cocher "{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}".
pt_br: Para ativar ou desativar este recurso, use o [menu suspenso do bate-papo](/peertube-plugin-livechat/documentation/user/viewers), abra o menu "configurar". No formulário, você encontrará uma caixa de seleção "{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}".
