Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Anonymous users won't have the message field, and will see following prompt: "{{% livechat_label muted_anonymous_message %}}"
fr: Les utilisateur⋅rices anonymes n'auront pas le champ message, et verront l'invite suivante : "{{% livechat_label muted_anonymous_message %}}"
pt_br: Usuários anônimos não terão o campo de mensagem e verão o seguinte prompt: "{{% livechat_label muted_anonymous_message %}}"

source: When this feature is enabled, anonymous users will be assigned the "visitor" role. You can change their role to "participant" if you want to allow some of them to talk.
fr: Lorsque cette fonction est activée, les utilisateur⋅rices anonymes se voient attribuer le rôle de "visiteur". Vous pouvez changer leur rôle en "participant⋅e" si vous voulez permettre à certain⋅es d'entre elleux de parler.
pt_br: Quando este recurso estiver ativado, usuários anônimos receberão a função de "visitante". Você pode alterar a função deles para "participante" se quiser permitir que alguns deles falem.

source: If you change the room configuration, all anonymous users will be muted or unmuted.
fr: Si vous modifiez la configuration de la salle, tous les utilisateur⋅rices anonymes seront mis en sourdine ou à nouveau autorisé⋅e à parler.
pt_br: Se você alterar a configuração da sala, todos os usuários anônimos serão silenciados ou ativados.

source: You can choose to enable or disable this feature for new chatrooms on the [channel configuration page](/peertube-plugin-livechat/documentation/user/streamers/channel).
fr: Vous pouvez choisir d'activer ou de désactiver cette fonctionnalité pour les nouveaux salons de discussion sur la [page de configuration de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/channel).
pt_br: Você pode escolher habilitar ou desabilitar esse recurso para novas salas de bate-papo na [página de configuração do canal](/peertube-plugin-livechat/documentation/user/streamers/channel).

source: Roles and affiliations
fr: Rôles et affiliations
pt_br: Funções e afiliações

source: There are several roles that can be assignated to users in chat rooms: owner, moderators, member, ...
fr: Il y a différents rôles qui peuvent être assignés aux utilisateur⋅rices dans les salons de discussion : propriétaire, modérateur⋅rice, membre, ...
pt_br: Existem várias funções que podem ser atribuídas aos usuários em salas de bate-papo: proprietário, moderadores, membro, ...

source: You can promote users as moderators, if you need some help.
fr: Vous pouvez promouvoir des utilisateur⋅rices en tant que modérateur⋅rices, si vous avez besoin d'aide.
pt_br: Você pode promover usuários como moderadores, se precisar de ajuda.

source: It is possible to anonymize moderation actions, to avoid disclosing who is banning/kicking/… occupants.
fr: Il est possible d'anonymiser les actions de modération, afin d'éviter de divulguer qui bannit/expulse/... les participant⋅es.
pt_br: É possível tornar anônimas as ações de moderação, para evitar revelar quem está banindo/expulsando/… ocupantes.

source: To enable or disable this feature, use the [chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers), open the "configure" menu. In the form, you will find a "{{% livechat_label livechat_configuration_channel_anonymize_moderation_label %}}" checkbox.
fr: Pour activer ou désactiver cette fonctionnalité, utilisez le [menu déroulant du chat](/peertube-plugin-livechat/fr/documentation/user/viewers), puis ouvrez le menu "configurer". Dans le formulaire, vous trouverez une case à cocher "{{% livechat_label livechat_configuration_channel_anonymize_moderation_label %}}".
pt_br: Para ativar ou desativar este recurso, use o [menu suspenso do bate-papo](/peertube-plugin-livechat/documentation/user/viewers), abra o menu "configurar". No formulário, você encontrará uma caixa de seleção "{{% livechat_label livechat_configuration_channel_anonymize_moderation_label %}}".

source: Participant message history search
fr: Recherche dans l'historique des messages des participant⋅es
pt_br: Pesquisa de histórico de mensagens do participante

source: As a room admin or owner, you can search all messages sent by a given participant.
fr: En tant qu'administrateur⋅rice ou propriétaire d'un sallon, vous pouvez rechercher tous les messages envoyés par un⋅e participant⋅e donné⋅e.
pt_br: Como administrador ou proprietário de uma sala, você pode pesquisar todas as mensagens enviadas por um determinado participante.

source: To do so, you have several ways:
fr: Pour ce faire, plusieurs possibilités s'offrent à vous :
pt_br: Para fazer isso, você tem várias maneiras:

source: using the "{{% livechat_label search_occupant_message %}}" action in the dropdown menu besides participants in the sidebar
fr: utiliser l'action "{{% livechat_label search_occupant_message %}}" dans le menu déroulant à côté des participant⋅es dans la barre latérale
pt_br: usando a ação "{{% livechat_label search_occupant_message %}}" no menu suspenso, além dos participantes na barra lateral

source: using the "{{% livechat_label search_occupant_message %}}" action in the dropdown menu besides chat messages
fr: utilisation de l'action "{{% livechat_label search_occupant_message %}}" dans le menu déroulant à côté des messages de tchat
pt_br: usando a ação "{{% livechat_label search_occupant_message %}}" no menu suspenso, além das mensagens de bate-papo

source: To have more space and better readability, open the chat in full-page mode.
fr: Pour avoir plus d'espace et une meilleure lisibilité, ouvrez le tchat en mode pleine page.
pt_br: Para ter mais espaço e melhor legibilidade, abra o chat em modo de página inteira.

source: In the search results, there are several informations that are shown at the right of the participant nickname:
fr: Dans les résultats de la recherche, plusieurs informations sont affichées à droite du pseudo de la personne participante :
pt_br: Nos resultados da pesquisa, há diversas informações que são mostradas à direita do apelido do participante:

source: if the current nickname is different than the nickname when the participant has sent the message, the original nickname will be shown
fr: si le pseudonyme actuel est différent du pseudonyme utilisé lorsque le⋅a participant⋅e a envoyé le message, le pseudonyme original sera affiché
pt_br: se o apelido atual for diferente do apelido quando o participante enviou a mensagem, o apelido original será mostrado

source: you will see the [JID (Jabber ID)](https://xmpp.org/extensions/xep-0029.html) of the participant
fr: vous verrez le [JID (Jabber ID)](https://xmpp.org/extensions/xep-0029.html) de la personne participante
pt_br: você verá o [JID (Jabber ID)](https://xmpp.org/extensions/xep-0029.html) do participante

source: you will also see the [occupant-id](https://xmpp.org/extensions/xep-0421.html) of the participant
fr: vous verrez également l'[occupant](-id)[https://xmpp.org/extensions/xep-0421.html) de la personne participante
pt_br: você também verá o [occupant-id](https://xmpp.org/extensions/xep-0421.html) do participante

source: The search result will also include all messages related to participants who had the same nickname. You can differenciate them by comparing [JID](https://xmpp.org/extensions/xep-0029.html) and [occupant-id](https://xmpp.org/extensions/xep-0421.html).
pt_br: O resultado da pesquisa também incluirá todas as mensagens relacionadas aos participantes que tinham o mesmo apelido. Você pode diferenciá-los comparando [JID](https://xmpp.org/extensions/xep-0029.html) e [occupant-id](https://xmpp.org/extensions/xep-0421.html).

source: Delete room content
fr: Supprimer le contenu des salons
pt_br: Excluir conteúdo da sala

source: You can delete old rooms: join the room, and use the menu on the top to destroy the room.
fr: Vous pouvez supprimer d'anciennes salles : rejoignez la salle, et utilisez le menu en haut pour détruire la salle.
pt_br: Você pode excluir salas antigas: entre na sala e use o menu no topo para destruí-la.

source: Instance moderation
fr: Modération de l'instance
pt_br: Moderação de instância

source: As Peertube instance moderator or administrator, you will probably need to check that your users are not behaving badly.
fr: En tant que modérateur⋅rice ou administrateur⋅rice de l'instance Peertube, vous allez probablement vouloir vérifier que les utilisateur⋅rices n'ont pas de comportement problématique.
pt_br: Como moderador ou administrador da instância do Peertube, você provavelmente precisará verificar se seus usuários não estão se comportando mal.

source: You can list all existing chatrooms: in the plugin settings screen, there is a button «List rooms».
fr: Vous pouvez lister toutes les salles de discussion existantes : dans l'écran des paramètres du plugin, il y a un bouton "Lister les salles".
pt_br: Você pode listar todas as salas de bate-papo existentes: na tela de configurações do plugin, há um botão «Listar salas».

source: From there, you can also promote yourself as room moderator by using the "{{% livechat_label promote %}}" button on the right.
fr: De là, vous pouvez également vous promouvoir en tant que modérateur⋅rice de salon en utilisant le bouton "{{% livechat_label promote %}}" sur la droite.
pt_br: A partir daí, você também pode se promover como moderador da sala usando o botão "{{% livechat_label promote %}}" à direita.

source: Plugin peertube-plugin-livechat moderation notes
pt_br: Notas de moderação do plugin peertube-plugin-livechat

source: Moderation notes
pt_br: Notas de moderação

source: The livechat plugin includes a Moderator Notes Application: you can write some notes, that could be associated to chat participants. Every room's admins have access to these notes, so they can edit them collaboratively.
pt_br: O plugin de chat ao vivo inclui um aplicativo de notas do moderador: você pode escrever algumas notas, que podem ser associadas aos participantes do chat. Os administradores de cada sala têm acesso a essas notas, para que possam editá-las de forma colaborativa.

source: You can for example use this Application to:
pt_br: Você pode, por exemplo, usar este aplicativo para:

source: share some notes between moderators
pt_br: compartilhar algumas notas entre os moderadores

source: take notes about participants that were kicked or caused troubles
pt_br: tomar notas sobre os participantes que foram expulsos ou causaram problemas

source: Using the Moderator Notes Application
pt_br: Usando o aplicativo Notas do moderador

source: Opening the Moderator Notes Application
pt_br: Abrindo o aplicativo Notas do Moderador

source: To open the Moderator Notes Application, there is a "{{% livechat_label "moderator_notes" %}}" button in the top chat menu:
pt_br: Para abrir o aplicativo Notas do Moderador, há um botão "{{% livechat_label "moderator_notes" %}}" no menu superior do chat:

source: Clicking this button will toggle the Application display:
pt_br: Clicar neste botão alternará a exibição do aplicativo:

source: Access rights
fr: Droits d'accès
pt_br: Direitos de acesso

source: Every room's admins have access to this Application (read and write access).
pt_br: Todos os administradores de sala têm acesso a este aplicativo (acesso de leitura e gravação).

source: When you promote someone as room admin or owner, they gets instant access to this Application. When you remove admin or owner rights to someone, they instantly lose access to this Application.
pt_br: Ao promover alguém como administrador ou proprietário de uma sala, essa pessoa obtém acesso instantâneo a este Aplicativo. Ao remover os direitos de administrador ou proprietário de alguém, essa pessoa perde instantaneamente o acesso a este Aplicativo.

source: Scope
pt_br: Escopo

source: Notes are only available in the room in which you have created them.
pt_br: As notas só ficam disponíveis na sala em que você as criou.

source: Chatrooms can be releated to video or channel. If you want to keep notes from one video to another, please consider using rooms associated to channels.
pt_br: As salas de bate-papo podem ser vinculadas a um vídeo ou canal. Se você quiser manter anotações de um vídeo para outro, considere usar salas vinculadas a canais.

source: Currently the video vs channel rooms is an instance-wide settings. Only Peertube admins can change it, and it applies to all chatrooms. In the future, this choice will be added in your channel's options.
pt_br: Atualmente, a configuração para salas de vídeo e canais é válida para toda a instância. Somente administradores do Peertube podem alterá-la, e ela se aplica a todas as salas de bate-papo. Futuramente, essa opção será adicionada às opções do seu canal.

source: Notes
fr: Remarques
pt_br: Notas

source: Create/Edit Notes
pt_br: Criar/Editar Notas

source: You can use the plus button on the top to create a new note. You can also edit existing notes using the edit button, or delate any note.
pt_br: Você pode usar o botão de adição na parte superior para criar uma nova nota. Você também pode editar notas existentes usando o botão de edição ou excluir qualquer nota.

source: All modification are instantly visible in all your browser tabs, and for all room's admins.
fr: Toutes les modifications sont instantanément visibles dans tous les onglets de votre navigateur, et pour tous les administrateur⋅rices du salon.
pt_br: Todas as modificações ficam instantaneamente visíveis em todas as abas do seu navegador e para todos os administradores da sala.

source: You can create a note associated to a participant in several ways:
pt_br: Você pode criar uma nota associada a um participante de várias maneiras:

source: using the "{{% livechat_label moderator_note_create_for_participant %}}" action in the dropdown menu besides participants in the sidebar
pt_br: usando a ação "{{% livechat_label moderator_note_create_for_participant %}}" no menu suspenso, além dos participantes na barra lateral

source: using the "{{% livechat_label moderator_note_create_for_participant %}}" action in the dropdown menu besides chat messages
pt_br: usando a ação "{{% livechat_label moderator_note_create_for_participant %}}" no menu suspenso, além das mensagens de bate-papo

source: When a note is associated to a participant, you will see their nickname and avatar on the top of the note.
pt_br: Quando uma nota é associada a um participante, você verá o apelido e o avatar dele na parte superior da nota.

source: Notes filtering
pt_br: Filtragem de notas

source: You can filter notes to find all notes related to a given participant in several ways:
pt_br: Você pode filtrar notas para encontrar todas as notas relacionadas a um determinado participante de várias maneiras:

source: click on the "{{% livechat_label moderator_note_search_for_participant %}}" button that is available on notes to find all notes related to the same participant
pt_br: clique no botão "{{% livechat_label moderator_note_search_for_participant %}}" disponível nas notas para encontrar todas as notas relacionadas ao mesmo participante

source: click on the "{{% livechat_label moderator_note_search_for_participant %}}" button in the dropdown menu besides participants in the sidebar
pt_br: clique no botão "{{% livechat_label moderator_note_search_for_participant %}}" no menu suspenso ao lado dos participantes na barra lateral

source: click on the "{{% livechat_label moderator_note_search_for_participant %}}" button in the dropdown menu besides chat messages
pt_br: clique no botão "{{% livechat_label moderator_note_search_for_participant %}}" no menu suspenso ao lado das mensagens de bate-papo

source: You can remove the filter by clicking on the close button.
pt_br: Você pode remover o filtro clicando no botão Fechar.

source: When you filters notes on a participant, there are several informations that are shown at the right of the participant nickname:
pt_br: Ao filtrar notas sobre um participante, várias informações são exibidas à direita do apelido do participante:

source: if the current nickname is different than the nickname when you created the note, the original nickname will be shown
pt_br: se o apelido atual for diferente do apelido quando você criou a nota, o apelido original será mostrado

source: The search result will also include all notes related to participants who had the same nickname. So you can also take note for anonymous users (who don't have any consistent JID or occupant-id). You can differenciate them by comparing JID and occupant-id.
pt_br: O resultado da pesquisa também incluirá todas as notas relacionadas aos participantes que tinham o mesmo apelido. Assim, você também pode anotar usuários anônimos (que não possuem um JID ou ID de ocupante consistente). Você pode diferenciá-los comparando o JID e o ID de ocupante.

source: Sorting notes
pt_br: Classificando notas

source: You can create polls to ask viewers their opinion
pt_br: Você pode criar enquetes para perguntar a opinião dos espectadores

source: Polls
fr: Sondages
pt_br: Pesquisas

source: Create a poll
fr: Créer un sondage
pt_br: Criar uma enquete

source: You can create a new poll by using the "{{% livechat_label new_poll %}}" action in the chat top menu:
fr: Vous pouvez créer un nouveau sondage en utilisant l'action "{{% livechat_label new_poll %}}" dans le menu du tchat :
pt_br: Você pode criar uma nova enquete usando a ação "{{% livechat_label new_poll %}}" no menu superior do chat:

source: This poll feature should not be considered as a reliable voting system. It is easy to cheat. There is no mechanism to prevent anonymous users to vote multiple times by just reloading the chat. Votes are never fully anonymous, someone having access to the server could see who voted for what choice.
fr: Cette fonctionnalité de sondage ne doit pas être considérée comme un système de vote fiable. Il est facile de tricher. Aucun mécanisme n'empêche les utilisateur⋅rices anonymes de voter plusieurs fois en rechargeant simplement le tchat. Les votes ne sont jamais totalement anonymes, quelqu'un ayant accès au serveur peut voir qui a voté pour quel choix.
pt_br: Este recurso de enquete não deve ser considerado um sistema de votação confiável. É fácil trapacear. Não há mecanismo que impeça usuários anônimos de votar várias vezes apenas recarregando o chat. Os votos nunca são totalmente anônimos; alguém com acesso ao servidor pode ver quem votou em qual opção.

source: Poll form
fr: Formulaire de sondage
pt_br: Formulário de enquete

source: Fill the form fields:
fr: Remplir les champs du formulaire :
pt_br: Preencha os campos do formulário:

source: "{{% livechat_label poll_question %}}": the question to ask to you viewers
fr: "{{% livechat_label poll_question %}}" : la question à poser aux spectateur⋅rices
pt_br: "{{% livechat_label poll_question %}}": a pergunta a ser feita aos espectadores

source: "{{% livechat_label poll_duration %}}": the duration for which viewers can vote
fr: "{{% livechat_label poll_duration %}}" : durée pendant laquelle les spectateur⋅rices peuvent voter
pt_br: "{{% livechat_label poll_duration %}}": a duração pela qual os espectadores podem votar

source: "{{% livechat_label poll_anonymous_results %}}": if checked, votes won't be publicly visible in the chat
fr: "{{% livechat_label poll_anonymous_results %}}" : si cette case est cochée, les votes ne seront pas visibles publiquement dans le tchat
pt_br: "{{% livechat_label poll_anonymous_results %}}": se marcado, os votos não serão visíveis publicamente no chat

source: "Choice N": choices that will be presented to viewers
fr: "Choix N" : choix qui seront présentés aux spectateur⋅rices
pt_br: “Choice N”: escolhas que serão apresentadas aos espectadores

source: You must at least fill the two first choices fields.
fr: Vous devez au moins remplir les deux premier choix.
pt_br: Você deve preencher pelo menos os dois primeiros campos de escolha.

source: Once you submit the form, the poll will instantly start.
fr: Une fois que vous aurez soumis le formulaire, le sondage commencera instantanément.
pt_br: Depois de enviar o formulário, a enquete começará imediatamente.

source: If there was a previous unfinished poll, it will end and its result will be shown.
fr: Si un sondage précédent était inachevé, il se terminera et son résultat sera affiché.
pt_br: Se houver uma enquete anterior não concluída, ela será encerrada e seu resultado será exibido.

source: Every room's admins can create a new poll.
fr: Les administrateur⋅rices de chaque salon peuvent créer un nouveau sondage.
pt_br: Os administradores de cada sala podem criar uma nova enquete.

source: When you promote someone as room admin or owner, they gets instant access to the "{{% livechat_label new_poll %}}" action.
fr: Lorsque vous promouvez quelqu'un en tant qu'administrateur⋅rice ou propriétaire du salon, iel obtient un accès instantané à l'action "{{% livechat_label new_poll %}}".
pt_br: Quando você promove alguém como administrador ou proprietário da sala, essa pessoa ganha acesso instantâneo à ação "{{% livechat_label new_poll %}}".

source: When you remove admin or owner rights to someone, they can't create new poll. But any existing poll will continue until it ends.
fr: Lorsque vous retirez les droits d'administrateur⋅rice ou de propriétaire à quelqu'un, cette personne ne peut plus créer de nouveaux sondages. Mais un éventuel sondage existant continuera jusqu'à ce qu'il se termine.
pt_br: Ao remover os direitos de administrador ou proprietário de alguém, essa pessoa não poderá criar uma nova enquete. Mas qualquer enquete existente continuará até o seu término.

source: Every user that is not muted can vote. This means that you can prevent anonymous users to vote by using the ["{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}" feature](/peertube-plugin-livechat/documentation/user/streamers/moderation).
fr: Tous les utilisateur⋅rices qui ne sont pas en sourdine peuvent voter. Cela signifie que vous pouvez empêcher les utilisateur⋅rices anonymes de voter en utilisant la fonctionnalité ["{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}"](/peertube-plugin-livechat/fr/documentation/user/streamers/moderation).
pt_br: Qualquer usuário que não esteja silenciado pode votar. Isso significa que você pode impedir que usuários anônimos votem usando o recurso ["{{% livechat_label livechat_configuration_channel_mute_anonymous_label %}}"](/peertube-plugin-livechat/documentation/user/streamers/moderation).

source: Poll workflow
fr: Flux de travail des sondages
pt_br: Fluxo de trabalho de enquete

source: When the polls starts, a first message will be sent in the chat, from the account of the user creating the poll.
fr: Lorsque les sondages commencent, un premier message est envoyé dans le tchat, à partir du compte de l'utilisateur⋅rice qui a créé le sondage.
pt_br: Quando a enquete começar, uma primeira mensagem será enviada no chat, a partir da conta do usuário que criou a enquete.

source: A banner will also appear to show the poll, and will be updated regularly with the current votes.
fr: Une bannière apparaîtra également pour indiquer le sondage en cours, et sera régulièrement mise à jour avec les votes en cours.
pt_br: Um banner também aparecerá para mostrar a enquete e será atualizado regularmente com os votos atuais.

source: Viewers can then vote by clicking on their choice, or by sending message like "!1" in the chat.
fr: Les spectateur⋅rices peuvent ensuite voter en cliquant sur leur choix, ou en envoyant un message du type "!1" dans le tchat.
pt_br: Os espectadores podem então votar clicando em sua escolha ou enviando uma mensagem como "!1" no chat.
