Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: This file can contain some JSON to enable more advanced options. To have a list of existing parameters, check `server/lib/debug.ts`. Restart Peertube after each content modification.
ca: Aquest fitxer també pot contenir JSON que pot activar altres opcions més avançades. Per obtenir-ne una llista, podeu consultar el codi a `server/lib/debug.ts`. Reinicieu Peertube després de cada modificació del seu contingut.
fr: Ce fichier peut également contenir du JSON qui pourra activer d'autres options. Pour en avoir la liste, vous pouvez regarder le code de `server/lib/debug.ts`. Redémarrez Peertube après chaque modification de son contenu.
pt_br: Este arquivo pode conter JSON para habilitar opções mais avançadas. Para obter uma lista dos parâmetros existentes, consulte `server/lib/debug.ts`. Reinicie o Peertube após cada modificação de conteúdo.

source: Don't enable this mode on a production server, neither on a public server. This could cause security issues.
ca: No activeu mai aquest mode en un servidor de producció, ni tan sols en un servidor públic. Això podria suposar problemes de seguretat.
fr: N'activer jamais ce mode sur un serveur de production, ni même sur un serveur public. Cela pourrait poser des problèmes de sécurité.
pt_br: Não habilite este modo em um servidor de produção, nem em um servidor público. Isso pode causar problemas de segurança.

source: Restart Prosody
ca: Reiniciar Prosody
fr: Redémarrer Prosody
pt_br: Reiniciar Prosódia

source: When debug mode is enabled, you can restart Prosody using this API call: `http://your_instance.tld/plugins/livechat/router/api/restart_prosody`. This call don't need any authentificaiton. It can be done from a command line, for example using `curl http://your_instance.tld/plugins/livechat/router/api/restart_prosody`.
ca: Per reiniciar Prosody quan el mode de depuració estigui activat, podeu cridar l'API `http://la_vostra_instancia.cat/plugins/livechat/router/api/restart_prosody`. Aquesta crida no necessita autenticació. Es pot fer des d'una línia d'ordres, per exemple amb `curl http://la_vostra_instancia.cat/plugins/livechat/router/api/restart_prosody`.
fr: Pour redémarrer Prosody quand le mode debug est activé, vous pouvez appeler l'API `http://votre_instance.tld/plugins/livechat/router/api/restart_prosody`. Cet appel n'a pas besoin d'authentification. Il peut se faire depuis une ligne de commande, par exemple avec `curl http://votre_instance.tld/plugins/livechat/router/api/restart_prosody.
pt_br: Quando o modo de depuração estiver ativado, você pode reiniciar o Prosody usando esta chamada de API: `http://your_instance.tld/plugins/livechat/router/api/restart_prosody`. Esta chamada não requer autenticação. Pode ser feita a partir de uma linha de comando, por exemplo, usando `curl http://your_instance.tld/plugins/livechat/router/api/restart_prosody`.

source: Prosody debugger
ca: Depurador de Prosody
fr: debugger Prosody
pt_br: Depurador de prosódia

source: It is possible to connect the Prosody AppImage to a remote debugger using [MobDebug](https://luarocks.org/modules/paulclinger/mobdebug).
ca: És possible connectar l'AppImage Prosody a un depurador remot mitjançant [MobDebug](https://luarocks.org/modules/paulclinger/mobdebug).
fr: Il est possible de connecter l'AppImage Prosody à un debugger distant en utilisant [MobDebug](https://luarocks.org/modules/paulclinger/mobdebug).
pt_br: É possível conectar o Prosody AppImage a um depurador remoto usando [MobDebug](https://luarocks.org/modules/paulclinger/mobdebug).

source: To do so, you have to setup MobDebug in a folder that can be accessed by the `peertube` user. Then, add this in the `debub_mode` file:
ca: Per fer-ho, col·loqueu MobDebug en una carpeta accessible per l'usuari `peertube`. A continuació afegiu això al fitxer `debug_mode` del connector:
fr: Pour cela, placer MobDebug dans un dossier accessible par le user `peertube`. Ensuite, ajouter cela dans le fichier `debug_mode` du plugin :
pt_br: Para isso, você precisa configurar o MobDebug em uma pasta acessível ao usuário `peertube`. Em seguida, adicione isto ao arquivo `debub_mode`:

source: { "debug_prosody": { "debugger_path": "/the_path_to_mobdebug/src", "host": "localhost", "port": "8172" } }
ca: { "debug_prosody": { "debugger_path": "/el_cami_a_mobdebug/src", "host": "localhost", "port": "8172" } }
fr: { "debug_prosody": { "debugger_path": "/le_chemin_vers_mobdebug/src", "host": "localhost", "port": "8172" } }
pt_br: { "debug_prosody": { "debugger_path": "/o_caminho_para_o_mobdebug/src", "host": "localhost", "porta": "8172" } }

source: `host` and `port` are optional. `debugger_path` must point to the folder where the `MobDebug` `.lua` file is.
ca: `host` i `port` són opcionals. `debugger_path` ha d'apuntar a la carpeta on es troba el fitxer `.lua` de `MobDebug`.
fr: `host` et `port` sont optionnels. `debugger_path` doit pointer vers le dossier où se trouve le fichier `.lua` de `MobDebug`.
pt_br: `host` e `port` são opcionais. `debugger_path` deve apontar para a pasta onde está o arquivo `.lua` `MobDebug`.

source: Restart Peertube.
ca: Reiniciar Peertube.
fr: Redémarrer Peertube.
pt_br: Reinicie o Peertube.

source: Start your debugger server.
ca: Inicieu el vostre servidor de depuració.
fr: Lancer votre serveur de debug.
pt_br: Inicie seu servidor depurador.

source: For Prosody to connect to the debugger, call the API `http://your_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. This call does not need any authentication. It can be done from a command line, for example with `curl http://your_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. You can even configure your debug server to launch this request automatically.
ca: Perquè Prosody es connecti al depurador, crideu a l'API `http://la_vostra_instancia.cat/plugins/livechat/router/api/restart_prosody?debugger=true`. Aquesta crida no necessita autenticació. Es pot fer des d'una línia d'ordres, per exemple amb `curl http://la_vostra_instancia.cat/plugins/livechat/router/api/restart_prosody?debugger=true`. Fins i tot podeu configurar el vostre servidor de depuració per executar aquesta ordre automàticament.
fr: Pour que Prosody se connecte au debugger, appelez l'API `http://votre_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. Cet appel n'a pas besoin d'authentification. Il peut se faire depuis une ligne de commande, par exemple avec `curl http://votre_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. Vous pouvez même configurer votre serveur de debuggage pour lancer cette commande automatiquement.
pt_br: Para que o Prosody se conecte ao depurador, chame a API `http://your_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. Essa chamada não requer autenticação. Ela pode ser feita a partir de uma linha de comando, por exemplo, com `curl http://your_instance.tld/plugins/livechat/router/api/restart_prosody?debugger=true`. Você pode até configurar seu servidor de depuração para iniciar essa solicitação automaticamente.

source: Prosody will then restart, connecting to the debugger.
ca: Aleshores Prosody es reiniciarà, connectant-se al depurador.
fr: Prosody va alors redémarrer en se connectant au debugger.
pt_br: O Prosody será reiniciado, conectando-se ao depurador.

source: Quick dev environment using Docker
ca: Entorn de desenvolupament ràpid mitjançant Docker
fr: Environnement de développement rapide via Docker
pt_br: Ambiente de desenvolvimento rápido usando Docker

source: There is a tutorial, in french, on the [Peertube forum](https://framacolibri.org/t/tutoriel-creer-un-environnement-de-developpement-de-plugin-peertube-rapidement-en-utilisant-docker-et-qui-permet-de-tester-la-federation/17631) that explains how to quickly build a dev env using Docker.
ca: Hi ha un tutorial, en francès, disponible al [fòrum Peertube](https://framacolibri.org/t/tutoriel-creer-un-environnement-de-developpement-de-plugin-peertube-rapidement-en-utilisant-docker-et-qui -allows-to-test-the-federation/17631) que explica com configurar ràpidament un entorn de desenvolupament amb Docker.
fr: Un tutoriel est disponible sur [le forum Peertube](https://framacolibri.org/t/tutoriel-creer-un-environnement-de-developpement-de-plugin-peertube-rapidement-en-utilisant-docker-et-qui-permet-de-tester-la-federation/17631) pour expliquer comment monter rapidement un environnement de développement en utilisant Docker.
pt_br: Há um tutorial, em francês, no [fórum Peertube](https://framacolibri.org/t/tutoriel-creer-un-environnement-de-developpement-de-plugin-peertube-rapidement-en-utilisant-docker-et-qui-permet-de-tester-la-federation/17631) que explica como construir rapidamente um ambiente de desenvolvimento usando o Docker.

source: A repo was made out of it, check out [pt-plugin-dev](https://codeberg.org/mose/pt-plugin-dev).
ca: S'ha creat un repositori basat en aquest tutorial: [pt-plugin-dev](https://codeberg.org/mose/pt-plugin-dev).
fr: Un dépot a été crée sur la base de ce tutoriel : [pt-plugin-dev](https://codeberg.org/mose/pt-plugin-dev).
pt_br: Um repositório foi criado a partir dele, confira [pt-plugin-dev](https://codeberg.org/mose/pt-plugin-dev).

source: Note: for an unknown reason, Prosody can't resolve containers DNS address when using the lua-unbound library. There is a dirty hack in the plugin: just create a `/data/plugins/data/peertube-plugin-livechat/no_lua_unbound` file in your docker-volumes, then restart containers.
ca: Nota: per algun motiu desconegut Prosody no pot resoldre les adreces DNS dels contenidors quan s'utilitza la biblioteca lua-unbound. Per evitar-ho hi ha una «nyapa»: només cal que creeu un fitxer `/data/plugins/data/peertube-plugin-livechat/no_lua_unbound` als vostres volums docker i reinicieu-los.
fr: Note : pour une raison obscure, Prosody n'arrive pas à résoudre les adresses DNS des conteneurs quand la librairie lua-unbound est utilisée. Pour contourner cela, il y a un «dirty hack» : il suffit de créer une fichier `/data/plugins/data/peertube-plugin-livechat/no_lua_unbound` dans vos docker-volumes, puis de les redémarrer.
pt_br: Observação: por um motivo desconhecido, o Prosody não consegue resolver o endereço DNS dos contêineres ao usar a biblioteca lua-unbound. Há um truque sujo no plugin: basta criar um arquivo `/data/plugins/data/peertube-plugin-livechat/no_lua_unbound` no seu docker-volumes e reiniciar os contêineres.

source: Quickly rebuild and install the plugin
ca: Reconstruir i instal·lar el connector ràpidament
fr: Reconstruire et installer rapidement le plugin
pt_br: Reconstrua e instale o plugin rapidamente

source: When you do modification, you don't have to always rebuild the full project, and reinstall the plugin on your dev environment. You can build only the modified part (for example, if you only modified client files: `npm run build:client`). Check the `package.json` files for available build scripts.
ca: Quan feu canvis no cal que reconstruïu tot el projecte i torneu a instal·lar el connector al vostre entorn de desenvolupament; podeu crear només la part modificada (per exemple, si només heu modificat els fitxers del client: `npm run build:client`). Trobareu la llista dels scripts de compilació disponibles al fitxer `package.json`.
fr: Lorsque vous faites des modifications, vous n'avez pas besoin de reconstruire le projet complet, et de réinstaller le plugin sur votre environnement de développement. Vous pouvez ne construire que la partie modifiée (par exemple, si vous n'avez modifié que les fichiers clients : `npm run build:client`). Vous trouverez la liste des scripts de construction disponibles dans le fichier `package.json`.
pt_br: Ao fazer modificações, você não precisa sempre reconstruir o projeto inteiro e reinstalar o plugin no seu ambiente de desenvolvimento. Você pode compilar apenas a parte modificada (por exemplo, se você modificou apenas os arquivos do cliente: `npm run build:client`). Verifique os arquivos `package.json` para ver os scripts de compilação disponíveis.

source: When the plugin is already installed on your dev instance, and you haven't changed any dependency, you can quickly install your work by following these steps:
ca: Quan el connector ja està instal·lat a la vostra instància de desenvolupament i si no heu modificat cap dependència, podeu instal·lar ràpidament el vostre treball seguint els passos següents:
fr: Lorsque le plugin est déjà installé sur votre instance de développement, et que vous n'avez modifié aucune dépendance, vous pouvez installer rapidement votre travail en suivant les étapes suivantes :
pt_br: Quando o plugin já estiver instalado na sua instância de desenvolvimento e você não tiver alterado nenhuma dependência, você pode instalar seu trabalho rapidamente seguindo estas etapas:

source: re-build necessary parts of the plugin (client, styles, ...),
ca: reconstruir les parts necessàries del connector (client, estils, ...),
fr: reconstruire les parties nécessaires du plugin (client, styles, ...),
pt_br: reconstruir partes necessárias do plugin (cliente, estilos, ...),

source: overwrite the `data/plugins/node_modules/peertube-plugin-livechat/dist/` content of your dev instance by the content of the plugin's `dist` folder,
ca: sobreescriure el contingut de `data/plugins/node_modules/peertube-plugin-livechat/dist/` de la vostra instància de desenvolupament amb el contingut de la carpeta `dist` del connector,
fr: écraser le contenu de `data/plugins/node_modules/peertube-plugin-livechat/dist/` de votre instance de développement par le contenu du dossier `dist` du plugin,
pt_br: sobrescrever o conteúdo `data/plugins/node_modules/peertube-plugin-livechat/dist/` da sua instância dev pelo conteúdo da pasta `dist` do plugin,

source: change recursively `plugins/node_modules/peertube-plugin-livechat/dist/` files owner to your `peertube` user,
ca: canviar recursivament el propietari dels fitxers `plugins/node_modules/peertube-plugin-livechat/dist/` al vostre usuari `peertube`,
fr: changer récursivement le propriétaire des fichiers `plugins/node_modules/peertube-plugin-livechat/dist/` pour votre utilisateur `peertube`,
pt_br: alterar recursivamente o proprietário dos arquivos `plugins/node_modules/peertube-plugin-livechat/dist/` para seu usuário `peertube`,

source: restart your instance.
ca: reiniciar la vostra instància.
fr: Redémarrez votre instance.
pt_br: reinicie sua instância.

source: Performance tests
ca: Proves de rendiment
fr: Tests de performance
pt_br: Testes de desempenho

source: The [livechat-perf-test](https://github.com/JohnXLivingston/livechat-perf-test) repository contains some tools to make performance tests. It can be used to evaluate code improvements, or find bottlenecks.
ca: El repositori [livechat-perf-test](https://github.com/JohnXLivingston/livechat-perf-test) conté algunes eines per realitzar proves de rendiment. Es poden utilitzar per avaluar millores del codi font o trobar colls d'ampolla.
fr: Le dépôt [livechat-perf-test](https://github.com/JohnXLivingston/livechat-perf-test) contient quelques outils pour effectuer des tests de performance. Ils peuvent être utilisés pour évaluer les améliorations du code source, ou trouver les goulots d'étranglement.
pt_br: O repositório [livechat-perf-test](https://github.com/JohnXLivingston/livechat-perf-test) contém algumas ferramentas para realizar testes de desempenho. Ele pode ser usado para avaliar melhorias no código ou encontrar gargalos.

source: Document the plugin, or translate the documentation.
ca: Documentar el connector o traduir la documentació.
fr: Documenter le plugin, ou traduire la documentation.
pt_br: Documente o plugin ou traduza a documentação.

source: Documentation
ca: Documentació
pt_br: Documentação

source: General information
ca: Informació general
fr: Généralités
pt_br: informações gerais

source: Always inform the community before working (by creating a new issue, or commenting an existing one). This is to avoid that two persons are working on the same thing, and prevent conflicts.
ca: Anuncia't sempre abans de començar a treballar (creant un tiquet o comentant un tiquet existent). Això és per evitar que diverses persones treballin en el mateix i entrin en conflicte.
fr: Toujours vous annoncer avant de commencer à travailler (en créant un ticket ou en commentant un ticket existant). Ceci afin d'éviter que plusieurs personnes travaillent sur la même chose et entrent en conflit.
pt_br: Sempre informe a comunidade antes de trabalhar (criando um novo problema ou comentando um existente). Isso evita que duas pessoas trabalhem na mesma coisa e previne conflitos.

source: Documentation work has to be merged in the `main` branch.
ca: El treball de documentació ha de fusionar-se a la branca `main`.
fr: Le travail de documentation se fait sur la branche `main`.
pt_br: O trabalho de documentação deve ser mesclado no branch `main`.

source: The documentation source code is in the `support/documentation/content` folder.
ca: El codi font de la documentació es troba a la carpeta `support/documentation/content` del repositori.
fr: Le code source de la documentation se trouve dans le dossier `support/documentation/content` du dépot de code.
pt_br: O código-fonte da documentação está na pasta `support/documentation/content`.

source: The documentation is generated using [Hugo](https://gohugo.io/). You have to install it on your computer if you want to preview your work.
ca: La documentació es genera mitjançant les eines [Hugo](https://gohugo.io/), l'heu d'instal·lar a la vostra màquina per poder previsualitzar la documentació.
fr: La documentation est générée via l'outils [Hugo](https://gohugo.io/). Celui-ci doit être installé sur votre machine pour pouvoir prévisualiser la documentation.
pt_br: A documentação é gerada usando [Hugo](https://gohugo.io/). Você precisa instalá-lo no seu computador se quiser visualizar seu trabalho.

source: The minimum required version for Hugo is 0.121.0. It was tested using version 0.132.2.
ca: La versió mínima requerida d'Hugo és la 0.121.0. Hem provat amb la versió 0.132.2.
fr: La version minimale requise de Hugo est 0.121.0. Nous avons testé avec la version 0.132.2.
pt_br: A versão mínima necessária para o Hugo é 0.121.0. Ele foi testado com a versão 0.132.2.

source: The used theme is [hugo-theme-relearn](https://mcshelby.github.io/hugo-theme-relearn). You should read its documentation before starting editing the documentation.
ca: El tema utilitzat és [hugo-theme-relearn](https://mcshelby.github.io/hugo-theme-relearn). Es recomana llegir la seva documentació abans de començar.
fr: Le thème utilisé est [hugo-theme-relearn](https://mcshelby.github.io/hugo-theme-relearn). Il est recommandé d'en lire la documentation avant de commencer.
pt_br: O tema usado é [hugo-theme-relearn](https://mcshelby.github.io/hugo-theme-relearn). Você deve ler a documentação antes de começar a editá-la.

source: When a new plugin version is released, or when documentation is updated, plugin maintainers will merge the `main` branch to the `documentation` branch. This will trigger github and gitlab pipelines, and update published documentation.
ca: Quan es publica una versió del connector o quan s'actualitza la documentació, els responsables del connector fusionaran la branca `main` amb la branca `documentation`. Això activarà les canonades github i gitlab i n'actualitzarà les versions publicades.
fr: Quand une version du plugin est publiée, ou quand la documentation est mise à jour, les mainteneur⋅euses du plugin fusionnerons la branche `main` dans la branche `documentation`. Ce qui aura pour effet de déclencher les pipelines github et gitlab pour mettre à jour les versions publiées.
pt_br: Quando uma nova versão do plugin é lançada ou quando a documentação é atualizada, os mantenedores do plugin mesclam a ramificação "main" com a ramificação "documentation". Isso acionará os pipelines do GitHub e do GitLab e atualizará a documentação publicada.

source: Translations
ca: Traduccions
fr: Traductions
pt_br: Traduções

source: The principal language is english (`en` code).
ca: L'idioma principal és l'anglès (codi `en`).
fr: La langue principale est l'anglais (code `en`).
pt_br: O idioma principal é o inglês (código `en`).

source: The `support/documentation/content/en` folder contains only english documentation files.
ca: La carpeta `support/documentation/content/en` només conté fitxers de documentació en anglès.
fr: Le dossier `support/documentation/content/en`ne contient que les fichiers de documentation en anglais.
pt_br: A pasta `support/documentation/content/en` contém apenas arquivos de documentação em inglês.

source: Documentation is translated using Weblate (see the [translation documentation](/peertube-plugin-livechat/contributing/translate/)). To do so, we use the [po4a tool](https://po4a.org/), as we will se later in this page.
ca: La documentació es tradueix mitjançant Weblate (vegeu [documentació de traducció](/peertube-plugin-livechat/en/contributing/translate/)). Per fer-ho, utilitzem l'eina [po4a](https://po4a.org), com veurem més endavant en aquesta pàgina.
fr: La documentation est traduite en utilisant Weblate (voir [la documentation sur la traduction](/peertube-plugin-livechat/fr/contributing/translate/)). Pour cela, on utilise l'outils [po4a](https://po4a.org), comme nous le verrons plus loin dans cette page.
pt_br: A documentação é traduzida usando o Weblate (veja a [documentação de tradução](/peertube-plugin-livechat/contributing/translate/)). Para isso, usamos a [ferramenta po4a](https://po4a.org/), como veremos mais adiante nesta página.

source: Add a new language
ca: Afegir un nou idioma
fr: Ajout d'une nouvelle langue
pt_br: Adicionar um novo idioma

source: In the `support/documentation/config.toml` file, please copy and modify the `[Languages.fr]` section.
ca: Al fitxer `support/documentation/config.toml`, inspira't en la secció `[Languages.fr]` per declarar el nou idioma.
fr: Dans le fichier `support/documentation/config.toml`, inspirez vous de la section `[Languages.fr]` pour déclarer la nouvelle langue.
pt_br: No arquivo `support/documentation/config.toml`, copie e modifique a seção `[Languages.fr]`.

source: If the translations are not complete, it does not matter, english will be used for missing strings.
ca: Si les traduccions no estan completes, està bé, s'utilitzarà la versió en anglès per a les cadenes que falten.
fr: Si les traductions ne sont pas complètes, ce n'est pas grave, la version anglaise sera utilisée pour les chaînes manquantes.
pt_br: Se as traduções não estiverem completas, não importa, o inglês será usado para as strings faltantes.

source: Preview
ca: Previsualitzar
fr: Prévisualiser
pt_br: Pré-visualização

source: To preview your modifications, just run:
ca: Per previsualitzar les vostres modificacions només cal executar:
fr: Pour prévisualiser vos modification, il suffit de lancer :
pt_br: Para visualizar suas modificações, basta executar:

source: Then open your browser on the address [http://localhost:1313/peertube-plugin-livechat/](http://localhost:1313/peertube-plugin-livechat/). This page will automatically refresh on each modification.
ca: A continuació obriu el vostre navegador a [http://localhost:1313/peertube-plugin-livechat/](http://localhost:1313/peertube-plugin-livechat/). Aquesta pàgina s'actualitzarà automàticament amb cada modificació.
fr: Puis d'ouvrir votre navigateur à l'adresse [http://localhost:1313/peertube-plugin-livechat/](http://localhost:1313/peertube-plugin-livechat/). Cette page se raffraichira automatiquement à chaque modification.
pt_br: Em seguida, abra seu navegador no endereço [http://localhost:1313/peertube-plugin-livechat/](http://localhost:1313/peertube-plugin-livechat/). Esta página será atualizada automaticamente a cada modificação.
