Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: ![Screenshot of the "{{% livechat_label share_chat_link %}}" dialog, on the "{{% livechat_label web %}} tab. There is a url you can copy.](/peertube-plugin-livechat/images/share_web.png?classes=shadow,border&height=200px "Share link popup - web tab")
ca: ![Captura de pantalla del diàleg "{{% livechat_label share_chat_link %}}", a la pestanya "{{% livechat_label web %}}. Hi ha un URL que podeu copiar.](/peertube-plugin-livechat/images/share_web .png?classes=shadow,border&height=200px "Emergent de compartir l'enllaç - pestanya web")

source: ![Screenshot of the "{{% livechat_label share_chat_link %}}" dialog, on the "{{% livechat_label connect_using_xmpp %}}" tab.](/peertube-plugin-livechat/images/share_xmpp_dialog.png?classes=shadow,border&height=200px "{{% livechat_label connect_using_xmpp %}}")
ca: ![Captura de pantalla del diàleg "{{% livechat_label share_chat_link %}}", a la pestanya "{{% livechat_label connect_using_xmpp %}}".](/peertube-plugin-livechat/images/share_xmpp_dialog.png?classes=shadow, border&height=200px "{{% livechat_label connect_using_xmpp %}}")

source: ![Screenshot of the dropdown menu at the top of the chat. Several entries are available.](/peertube-plugin-livechat/images/top_menu.png?classes=shadow,border&height=200px "Chat menu")
ca: ![Captura de pantalla del menú desplegable a la part superior del xat. Hi ha diverses entrades disponibles.](/peertube-plugin-livechat/images/top_menu.png?classes=shadow,border&height=200px "Menú de xat")

source: ![Screenshot of the chat configuration form.](/peertube-plugin-livechat/images/configure.png?classes=shadow,border&height=200px "Configure chat room")
ca: ![Captura de pantalla del formulari de configuració del xat.](/peertube-plugin-livechat/images/configure.png?classes=shadow,border&height=200px "Configurar la sala de xat")

source: ![Screenshot of the channel options page, with some fields to configure the bot commands.](/peertube-plugin-livechat/images/bot_commands.png?classes=shadow,border&height=400px "Commands configuration")
ca: ![Captura de pantalla de la pàgina d'opcions del canal, amb alguns camps per configurar les ordres del bot.](/peertube-plugin-livechat/images/bot_commands.png?classes=shadow,border&height=400px "Configuració d'ordres")

source: ![Screenshot of the channel options page, with several fields to configure the forbidden words.](/peertube-plugin-livechat/images/bot_forbidden_words.png?classes=shadow,border&height=400px "Forbidden words configuration")
ca: ![Captura de pantalla de la pàgina d'opcions del canal, amb diversos camps per configurar els mots prohibits.](/peertube-plugin-livechat/images/bot_forbidden_words.png?classes=shadow,border&height=400px "Configuració de mots prohibits")

source: ![Screenshot of a chat message that was deleted, with the following reason: "No url allowed".](/peertube-plugin-livechat/images/bot_deleted_message.png?classes=shadow,border&height=100px "Deleted message")
ca: ![Captura de pantalla d'un missatge de xat que s'ha suprimit, amb el motiu següent: "No es permet cap URL".](/peertube-plugin-livechat/images/bot_deleted_message.png?classes=shadow,border&height=100px "Missatge suprimit")

source: You can fill several "{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}" fields. When a user sends a message that match the configured criteria, the message will automatically be deleted.
ca: Podeu omplir diversos camps «{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}». Quan s'envia un missatge que coincideix amb un dels criteris configurats s'eliminarà automàticament.

source: In this field, you can set several words, group of words, or "regular expressions".
ca: En aquest camp podeu posar diversos mots, grups de paraules o «expressions regulars».

source: Each time a user sends a message, these words will be tested. If the message containes one of them, the message will be deleted.
ca: Cada vegada que algú envia un missatge aquestes paraules seran comprovades. Si el missatge conté algun d'aquests el missatge s'eliminarà.

source: ![Screenshot of the channel options. There is a form with multiple fields.](/peertube-plugin-livechat/images/channel_configuration.png?classes=shadow,border&height=400px "Channel configuration")
ca: ![Captura de pantalla de les opcions del canal. Hi ha un formulari amb diversos camps.](/peertube-plugin-livechat/images/channel_configuration.png?classes=shadow,border&height=400px "Configuració del canal")

source: ![Screenshot of the channel options page, with several fields to configure the "No duplicate message" option.](/peertube-plugin-livechat/images/bot_no_duplicate.png?classes=shadow,border&height=400px "No duplicate message configuration")
ca: ![Captura de pantalla de la pàgina d'opcions del canal, amb diversos camps per configurar l'opció "Cap missatge duplicat".](/peertube-plugin-livechat/images/bot_no_duplicate.png?classes=shadow,border&height=400px "Configuració de Cap missatge duplicat" )

source: ![Screenshot of the channel options page, with some fields to configure a new timer.](/peertube-plugin-livechat/images/bot_quotes.png?classes=shadow,border&height=200px "Timers configuration")
ca: ![Captura de pantalla de la pàgina d'opcions del canal, amb alguns camps per configurar un temporitzador nou.](/peertube-plugin-livechat/images/bot_quotes.png?classes=shadow,border&height=200px "Configuració dels temporitzadors")

source: ![Screenshot of the channel options page, with several fields to configure the "Forbid special characters" option.](/peertube-plugin-livechat/images/forbid_special_chars_configuration.png?classes=shadow,border&height=400px "Forbid special characters configuration")
ca: ![Captura de pantalla de la pàgina d'opcions del canal, amb diversos camps per configurar l'opció "Prohibir caràcters especials".](/peertube-plugin-livechat/images/forbid_special_chars_configuration.png?classes=shadow,border&height=400px "Configuració de Prohibir caràcters especials" )

source: ![Screenshot of the chatrooms configuration page. The page list the user's channels.](/peertube-plugin-livechat/images/chatrooms_menu.png?classes=shadow,border&height=400px "Chatrooms menu")
ca: ![Captura de pantalla de la pàgina de configuració de les sales de xat. La pàgina enumera els canals del compte.](/peertube-plugin-livechat/images/chatrooms_menu.png?classes=shadow,border&height=400px "Menú de les sales de xat")

source: ![Screenshot of the emoji configuration page. There is a form where you can add new emojis.](/peertube-plugin-livechat/images/channel_custom_emojis_configuration.png?classes=shadow,border&height=400px "Channel configuration / Channel emojis configuration")
ca: ![Captura de pantalla de la pàgina de configuració d'emojis. Hi ha un formulari on podeu afegir nous emojis.](/peertube-plugin-livechat/images/channel_custom_emojis_configuration.png?classes=shadow,border&height=400px "Configuració del canal / Configuració dels emojis del canal")

source: ![Screenshot of a chat session, with messages containing custom emojis. The emoji picker is open, and shows custom emojis.](/peertube-plugin-livechat/images/channel_custom_emojis.png?classes=shadow,border&height=400px "Channel configuration / Channel emojis")
ca: ![Captura de pantalla d'una sessió de xat, amb missatges que contenen emojis personalitzats. El selector d'emojis està obert i mostra emojis personalitzats.](/peertube-plugin-livechat/images/channel_custom_emojis.png?classes=shadow,border&height=400px "Configuració del canal / Emojis del canal")

source: [ { "sn": ":short_name:", "url": "https://example.com/image.png" } ]
ca: [ { "sn": ":short_name:", "url": "https://exemple.cat/image.png" } ]
