Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Votes counts will be updated regularly in the banner.
fr: Le décompte des votes sera mis à jour régulièrement dans la bannière.
pt_br: A contagem de votos será atualizada regularmente no banner.

source: Viewers can change their vote at any time, just by making a new choice. Their precedent choice will be replaced by the new one.
fr: Les spectateur⋅rices peuvent modifier leur vote à tout moment, en faisant un nouveau choix. Le choix précédent sera remplacé par le nouveau.
pt_br: Os espectadores podem alterar seu voto a qualquer momento, bastando fazer uma nova escolha. A escolha anterior será substituída pela nova.

source: Anonymous viewers can only vote once they have choosen their nickname.
fr: Les spectateur⋅rices anonymes ne peuvent voter que lorsqu'iels ont choisi leur pseudonyme.
pt_br: Espectadores anônimos só podem votar depois de escolherem seu apelido.

source: If "{{% livechat_label poll_anonymous_results %}}" is checked, votes won't be shown to other users. If unchecked, votes will be publicly visible as you will see message like "!1" in the chat.
fr: Si "{{% livechat_label poll_anonymous_results %}}" est coché, les votes ne seront pas montrés aux autres utilisateur⋅rices. Si cette option n'est pas cochée, les votes seront visibles publiquement sous forme de messages du type "!1" dans le tchat.
pt_br: Se a opção "{{% livechat_label poll_anonymous_results %}}" estiver marcada, os votos não serão exibidos para outros usuários. Se desmarcada, os votos ficarão visíveis publicamente, pois você verá uma mensagem como "!1" no chat.

source: For viewers using XMPP clients or outdated livechat plugin versions, the banner will not be visible. But they will see the message in the chat and will be able to vote by sending messages with their choices.
fr: Pour les spectateur⋅rices utilisant des clients XMPP ou des versions obsolètes du plugin livechat, la bannière ne sera pas visible. Mais iels verront le message dans le tchat et pourront voter en envoyant des messages avec leurs choix.
pt_br: Para espectadores que usam clientes XMPP ou versões desatualizadas do plugin de chat ao vivo, o banner não ficará visível. Mas eles verão a mensagem no chat e poderão votar enviando mensagens com suas escolhas.

source: When the poll ends, a new message will be sent in the chat, with the results.
fr: À la fin du sondage, un nouveau message sera envoyé dans le tchat, avec les résultats.
pt_br: Quando a enquete terminar, uma nova mensagem será enviada no chat, com os resultados.

source: The only way to get old polls results is to search for the poll end message in the chat. For now, polls results are not saved by any other means. So don't forget to note polls results if you want to keep them.
fr: Le seul moyen d'obtenir les résultats d'anciens sondages est de rechercher le message de fin de sondage dans le tchat. Pour l'instant, les résultats des sondages ne sont pas sauvegardés par d'autres moyens. N'oubliez donc pas de noter les résultats des sondages si vous souhaitez les conserver.
pt_br: A única maneira de obter resultados de enquetes antigas é procurar a mensagem de encerramento da enquete no chat. Por enquanto, os resultados das enquetes não são salvos por nenhum outro meio. Portanto, não se esqueça de anotar os resultados das enquetes se quiser mantê-los.

source: Plugin peertube-plugin-livechat slow mode
fr: Mode lent du plugin peertube-plugin-livechat
pt_br: Plugin peertube-plugin-livechat modo lento

source: Slow mode
fr: Mode lent
pt_br: Modo lento

source: As a streamer, you can choose to rate limit your viewers messages in the chat.
fr: En tant que streameur⋅euse, vous pouvez choisir de limiter la fréquence des messages de vos spectateur⋅rices dans le tchat.
pt_br: Como streamer, você pode escolher limitar a classificação das mensagens dos seus espectadores no chat.

source: This can be really usefull to:
fr: Cela peut s'avérer très utile pour :
pt_br: Isso pode ser muito útil para:

source: avoid message flooding
fr: éviter l'inondation de messages
pt_br: evitar inundação de mensagens

source: avoid unreadable chat if there are many viewers talking
fr: éviter que le tchat ne devienne illisible si de nombreux⋅ses personnes y parlent
pt_br: evite bate-papo ilegível se houver muitos espectadores falando

source: You can set a number of seconds that users will have to wait after sending a message, before sending another.
fr: Vous pouvez définir le nombre de secondes que les utilisateur⋅rices devront attendre après avoir envoyé un message avant d'en envoyer un autre.
pt_br: Você pode definir um número de segundos que os usuários terão que esperar após enviar uma mensagem antes de enviar outra.

source: This limitation does not apply to moderators.
fr: Cette limitation ne s'applique pas aux modérateur⋅rices.
pt_br: Esta limitação não se aplica aos moderadores.

source: Slow mode option
fr: Option du mode lent
pt_br: Opção de modo lento

source: On the [channel configuration page](/peertube-plugin-livechat/documentation/user/streamers/channel), you can set the slow mode option:
fr: Sur la [page de configuration de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/channel), vous pouvez définir une valeur pour l'option mode lent :
pt_br: Na [página de configuração do canal](/peertube-plugin-livechat/documentation/user/streamers/channel), você pode definir a opção de modo lento:

source: Setting the value to a positive integer will set the period during which users will not be able to post additional messages.
fr: Positionner la valeur à un nombre entier positif permet de fixer la période pendant laquelle les utilisateur⋅rices ne pourront pas envoyer de messages supplémentaires.
pt_br: Definir o valor como um número inteiro positivo definirá o período durante o qual os usuários não poderão postar mensagens adicionais.

source: To modify the value for an already existing room, just open the room "configuration" menu (on top of the chat window), and change the slow mode value in the configuration form.
fr: Pour modifier la valeur d'un salon déjà existant, il suffit d'ouvrir le menu "configuration" du salon (en haut de la fenêtre de tchat), et de modifier la valeur du mode lent dans le formulaire de configuration.
pt_br: Para modificar o valor de uma sala já existente, basta abrir o menu "configuração" da sala (na parte superior da janela de bate-papo) e alterar o valor do modo lento no formulário de configuração.

source: For viewers
fr: Pour les spectateur⋅rices
pt_br: Para espectadores

source: If the slow mode is enabled, users will be informed by a message.
fr: Si le mode lent est activé, les utilisateur⋅rices en seront informé⋅es par un message.
pt_br: Se o modo lento estiver ativado, os usuários serão informados por uma mensagem.

source: When they send a message, the input field will be disabled for X seconds (where X is the slow mode duration).
fr: Lorsqu'iels envoient un message, le champ de saisie est désactivé pendant X secondes (X étant la durée du mode lent).
pt_br: Quando eles enviam uma mensagem, o campo de entrada será desabilitado por X segundos (onde X é a duração do modo lento).

source: You can handle tasks and task lists with your moderation team.
fr: Vous pouvez gérer les tâches et les listes de tâches avec votre équipe de modération.
pt_br: Você pode gerenciar tarefas e listas de tarefas com sua equipe de moderação.

source: Tasks / To-do lists
fr: Tâches / listes de choses à faire
pt_br: Tarefas / Listas de tarefas

source: The livechat plugin includes a Task Application: a kind of "to-do list" feature where you can create task lists and add tasks to them. Every room's admins have access to these tasks, so you can edit them collaboratively.
fr: Le plugin livechat comprend une Application de Tâches : une sorte de "liste de choses à faire" où vous pouvez créer des listes de tâches et y ajouter des tâches. Les administrateur⋅rices de chaque salon de discussion ont accès à ces tâches, ce qui vous permet de les modifier de manière collaborative.
pt_br: O plugin de chat ao vivo inclui um Aplicativo de Tarefas: um tipo de recurso de "lista de tarefas" onde você pode criar listas de tarefas e adicionar tarefas a elas. Os administradores de cada sala têm acesso a essas tarefas, para que você possa editá-las de forma colaborativa.

source: You can for example use the Task Application to:
fr: Vous pouvez par exemple utiliser l'Application de Tâches pour :
pt_br: Você pode, por exemplo, usar o aplicativo de tarefas para:

source: prepare a list of themes you want to discuss during your livestream, so you can be sure you won't forget anything
fr: préparez une liste des thèmes que vous souhaitez aborder lors de votre direct, afin d'être sûr de ne rien oublier
pt_br: prepare uma lista de temas que você quer discutir durante sua transmissão ao vivo, para ter certeza de que não vai esquecer nada

source: highlight questions from your viewers, so you can come back to them later without forgetting to answer them
fr: mettre en évidence les questions de vos spectateur⋅rices, afin que vous puissiez y revenir plus tard sans oublier d'y répondre
pt_br: destaque as perguntas dos seus espectadores, para que você possa retornar a elas mais tarde sem se esquecer de respondê-las

source: Using the Task Application
fr: Utilisation de l'Application Tâches
pt_br: Usando o aplicativo de tarefas

source: Opening the Task Application
fr: Ouverture de l'Application Tâche
pt_br: Abrindo o aplicativo de tarefas

source: To open the Task Application, there is a "{{% livechat_label "tasks" %}}" button in the top chat menu:
fr: Pour ouvrir l'Application Tâches, il y a un bouton «{{% livechat_label tasks %}}» dans le menu haut du tchat :
pt_br: Para abrir o aplicativo de tarefas, há um botão "{{% livechat_label "tasks" %}}" no menu de bate-papo superior:

source: Clicking this button will toggle the Task Application display:
fr: En cliquant sur ce bouton, l'affichage de l'Application de Tâches bascule :
pt_br: Clicar neste botão alternará a exibição do aplicativo de tarefas:

source: Every room's admins have access to the Task Application (read and write access).
fr: Les administrateur⋅rices de chaque salon de discussion ont accès à l'application de tâches (accès en lecture et en écriture).
pt_br: Os administradores de cada sala têm acesso ao aplicativo de tarefas (acesso de leitura e gravação).

source: When you promote someone as room admin or owner, they gets instant access to the Task Application. When you remove admin or owner rights to someone, they instantly lose access to the Task Application.
fr: Lorsque vous promouvez quelqu'un en tant qu'administrateur⋅rice ou propriétaire d'un salon, iel obtient un accès instantané à l'Application Tâches. Lorsque vous retirez les droits d'admin ou de propriétaire à quelqu'un, iel perd instantanément l'accès à l'Application Tâches.
pt_br: Ao promover alguém como administrador ou proprietário de uma sala, essa pessoa obtém acesso instantâneo ao Aplicativo de Tarefas. Ao remover os direitos de administrador ou proprietário de alguém, essa pessoa perde instantaneamente o acesso ao Aplicativo de Tarefas.

source: Task lists
fr: Listes de tâches
pt_br: Listas de tarefas

source: By default, there is one task list that has the same name as your livestream.
fr: Par défaut, il y a une liste de tâches portant le même nom que votre direct.
pt_br: Por padrão, há uma lista de tarefas que tem o mesmo nome da sua transmissão ao vivo.

source: You can use the form at the bottom to create a new task list. You can also edit existing task lists using the edit button, or delete any task list. Deleting a task list will also delete all its tasks.
fr: Vous pouvez utiliser le formulaire en bas de page pour créer une nouvelle liste de tâches. Vous pouvez également modifier les listes de tâches existantes à l'aide du bouton "modifier" ou supprimer n'importe quelle liste de tâches. La suppression d'une liste de tâches entraîne la suppression de toutes les tâches qu'elle contient.
pt_br: Você pode usar o formulário na parte inferior para criar uma nova lista de tarefas. Você também pode editar listas de tarefas existentes usando o botão de edição ou excluir qualquer lista de tarefas. Excluir uma lista de tarefas também excluirá todas as suas tarefas.

source: Task lists are sorted alphabetically.
fr: Les listes de tâches sont triées par ordre alphabétique.
pt_br: As listas de tarefas são classificadas em ordem alfabética.

source: Tasks
fr: Tâches
pt_br: Tarefas

source: Create tasks
fr: Créer des tâches
pt_br: Criar tarefas

source: You can create a task using the button on the right of task lists. This opens a form with two fields: a mandatory task name, and an optional description.
fr: Vous pouvez créer une tâche en utilisant le bouton situé à droite des listes de tâches. Un formulaire s'ouvre alors avec deux champs : un nom de tâche obligatoire et une description facultative.
pt_br: Você pode criar uma tarefa usando o botão à direita da lista de tarefas. Isso abrirá um formulário com dois campos: um nome de tarefa obrigatório e uma descrição opcional.

source: Edit tasks
fr: Modifier les tâches
pt_br: Editar tarefas

source: Tasks can be edited by using the edit button on the right.
fr: Les tâches peuvent être modifiées en utilisant le bouton d'édition à droite.
pt_br: As tarefas podem ser editadas usando o botão de edição à direita.

source: Tasks can be marked complete (or uncomplete) by clicking directly on the checkbox in the list.
fr: Les tâches peuvent être marquées comme terminées (ou non terminées) en cliquant directement sur la case à cocher dans la liste.
pt_br: As tarefas podem ser marcadas como concluídas (ou incompletas) clicando diretamente na caixa de seleção na lista.

source: Sorting tasks / change task list
fr: Trier les tâches / changer de liste des tâches
pt_br: Classificando tarefas / alterando lista de tarefas

source: Create a task from a chat message
fr: Créer une tâche à partir d'un message du tchat
pt_br: Criar uma tarefa a partir de uma mensagem de bate-papo

source: You can create a task from a message in a chat, using the "{{% livechat_label "task_create" %}}" button in the dropdown menu at the right of the message. This will open a dialog box where you can choose which task list you want to add the task into. The task name will be the user nickname, and the task description the message content.
fr: Vous pouvez créer une tâche à partir d'un message du tchat, en utilisant le bouton "{{% livechat_label "task_create" %}}" dans le menu déroulant à droite du message. Cela ouvrira une boîte de dialogue dans laquelle vous pourrez choisir la liste de tâches dans laquelle vous souhaitez ajouter la tâche. Le nom de la tâche sera le pseudonyme de l'utilisateur⋅rice, et la description de la tâche le contenu du message.
pt_br: Você pode criar uma tarefa a partir de uma mensagem em um chat, usando o botão "{{% livechat_label "task_create" %}}" no menu suspenso à direita da mensagem. Isso abrirá uma caixa de diálogo onde você pode escolher em qual lista de tarefas deseja adicionar a tarefa. O nome da tarefa será o apelido do usuário e a descrição da tarefa, o conteúdo da mensagem.

source: Using this feature, for example, you can ask your moderators to highlight all chat questions, so you can see them at a glance during your livestream, and check them as answered.
fr: Grâce à cette fonctionnalité, vous pouvez par exemple demander à vos modérateur⋅rices de relever toutes les questions du tchat, afin que vous puissiez les voir d'un seul coup d'œil pendant votre direct, et vérifier que vous y avez répondu.
pt_br: Usando esse recurso, por exemplo, você pode pedir aos seus moderadores para destacar todas as perguntas do chat, para que você possa vê-las rapidamente durante sua transmissão ao vivo e marcá-las como respondidas.

source: URL in the message will be clickable. You can also do some styling: [Message Styling](https://xmpp.org/extensions/xep-0393.html).
fr: L'URL du message sera cliquable. Vous pouvez aussi mettre en forme : [Message Styling](https://xmpp.org/extensions/xep-0393.html).
pt_br: A URL na mensagem será clicável. Você também pode personalizar: [Estilo da Mensagem](https://xmpp.org/extensions/xep-0393.html).

source: Viewers
fr: Spectateur⋅rices
pt_br: Espectadores

source: When joining the chat, viewers will see the terms:
fr: Lorsqu'iels rejoignent le tchat, les spectateur⋅rices verrons les conditions :
pt_br: Ao entrar no chat, os espectadores verão os termos:

source: You can change the terms content at any time, it will be instantly updated for all viewers.
fr: Vous pouvez modifier le contenu des conditions à tout moment, il sera instantanément mis à jour pour tous les téléspectateur⋅rices.
pt_br: Você pode alterar o conteúdo dos termos a qualquer momento, ele será atualizado instantaneamente para todos os espectadores.

source: If your Peertube instance allows joining chat with [XMPP clients](https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/), users using such clients will see the terms as chat messages, coming from a "Peertube" account. When you update terms, they will receive a new message with the update terms content.
fr: Si votre instance Peertube permet de rejoindre le tchat avec des [clients XMPP](https://livingston.frama.io/peertube-plugin-livechat/fr/documentation/admin/advanced/xmpp_clients/), les utilisateur⋅rices utilisant ces clients verront les conditions comme des messages de tchat provenant d'un compte "Peertube". Lorsque vous mettez à jour les conditions, iels recevront un nouveau message avec le contenu des conditions d'utilisation mis à jour.
pt_br: Se a sua instância do Peertube permitir a participação em chats com [clientes XMPP](https://livingston.frama.io/peertube-plugin-livechat/documentation/admin/advanced/xmpp_clients/), os usuários que utilizam esses clientes verão os termos como mensagens de chat, provenientes de uma conta "Peertube". Ao atualizar os termos, eles receberão uma nova mensagem com o conteúdo da atualização.

source: How to chat for stream viewers
fr: Comment tchater pour les spectateur⋅rices
pt_br: Como conversar com espectadores de transmissão

source: Joining chat rooms
fr: Rejoindre les salons de discussion
pt_br: Entrando em salas de bate-papo

source: When you are watching a Peertube video that has the chat activated, you will see the chat next to the video:
fr: Quand vous regardez une vidéo Peertube qui a le tchat activé, vous le verrez à coté de celle-ci :
pt_br: Ao assistir a um vídeo do Peertube com o chat ativado, você verá o chat ao lado do vídeo:

source: There are two slightly different use cases, depending on wether or not you have an account on the Peertube instance. See bellow for more informations.
fr: Il y a deux cas d'usages légèrement différents, dépendant de si vous avez un compte sur l'instance Peertube ou non. Voir plus bas pour plus d'informations.
pt_br: Existem dois casos de uso ligeiramente diferentes, dependendo se você possui ou não uma conta na instância do Peertube. Veja abaixo para mais informações.

source: If you haven't a Peertube account
fr: Si vous n'avez pas de compte Peertube
pt_br: Se você não tem uma conta no Peertube

source: If you are not logged in on the Peertube instance where you are watching the video, you will automatically join the chat. You will be assigned a random nickname (something like "Anonymous 12345").
fr: Si vous n'êtes pas identifié⋅e sur l'instance Peertube où vous regardez la vidéo, vous allez automatiquement rejoindre le tchat. Un pseudonyme aléatoire vous sera assigné (quelque chose de la forme «Anonyme 12345»).
pt_br: Se você não estiver logado na instância do Peertube onde está assistindo ao vídeo, você entrará automaticamente no chat. Você receberá um apelido aleatório (algo como "Anônimo 12345").

source: Before being able to speak in the chat room, you have to enter a nickname in the field on the bottom of the window.
fr: Avant de pouvoir parler dans le salon, vous allez devoir choisir un pseudonyme dans le champ au bas de la fenêtre.
pt_br: Antes de poder falar na sala de bate-papo, você precisa digitar um apelido no campo na parte inferior da janela.

source: Log in using an external authentication provider
fr: Se connecter à l'aide d'un fournisseur d'authentification externe
pt_br: Faça login usando um provedor de autenticação externo

source: The Peertube instance can configure external authentication providers (Mastodon accounts, Google accounts, ...). In such case, you will see a "{{% livechat_label login_using_external_account %}}" button, that will open a dialog modal. In this dialog modal, there will be some buttons to connect using a remote account.
fr: L'instance Peertube peut configurer des fournisseurs d'authentification externes (comptes Mastodon, comptes Google, ...). Dans ce cas, vous verrez un bouton "{{% livechat_label login_using_external_account %}}", qui ouvrira une boîte de dialogue modale. Dans cette modale de dialogue, il y aura des boutons pour se connecter en utilisant un compte distant.
pt_br: A instância do Peertube pode configurar provedores de autenticação externos (contas Mastodon, contas Google, etc.). Nesse caso, você verá um botão "{{% livechat_label login_using_external_account %}}", que abrirá uma janela de diálogo. Nessa janela, haverá alguns botões para conectar-se usando uma conta remota.

source: Once you signed in the remote account, and have granted access, your nickname and avatar (if available) will be automatically fetched. No other data will be stored. These data will be automatically deleted several hours after your quit the chat.
fr: Une fois que vous vous êtes connecté au compte distant et que l'accès vous a été accordé, votre pseudonyme et votre avatar (le cas échéant) seront automatiquement récupérés. Aucune autre donnée ne sera stockée. Ces données seront automatiquement supprimées quelques heures après que vous ayez quitté le tchat.
pt_br: Após fazer login na conta remota e conceder acesso, seu apelido e avatar (se disponível) serão recuperados automaticamente. Nenhum outro dado será armazenado. Esses dados serão excluídos automaticamente algumas horas após você sair do chat.

source: If you have a Peertube account
fr: Si vous avez un compte Peertube
pt_br: Se você tem uma conta no Peertube

source: If you are connected with your Peertube account, you will automatically join the room, using your Peertube nickname and avatar.
fr: Si vous êtes connecté avec votre compte Peertube, vous allez automatiquement rejoindre le salon, en utilisant votre pseudonyme Peertube et votre avatar.
pt_br: Se você estiver conectado à sua conta do Peertube, você entrará automaticamente na sala, usando seu apelido e avatar do Peertube.
