Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Then you need to open the C2S port (by default `52822`, but check the plugin settings to get the current value) in your firewall so that it can be reached from the internet. If you don't want to use C2S connections for anything else than your Matterbridge service, you should restrict access to this port to your Matterbridge server IP.
ca: A continuació heu d'obrir el port C2S (per defecte `52822`, però comproveu la configuració del connector per obtenir el valor actual) al vostre tallafoc perquè sigui accessible des d'Internet. Si no voleu utilitzar connexions C2S per a res que no sigui el vostre servei Matterbridge, hauríeu de restringir l'accés a aquest port a la IP del vostre servidor Matterbridge.
fr: Ensuite, vous devez ouvrir le port C2S (par défaut `52822`, mais vérifiez les paramètres du plugin pour obtenir la valeur actuelle) dans votre pare-feu afin qu'il soit accessible depuis l'internet. Si vous ne souhaitez pas utiliser les connexions C2S pour autre chose que votre service Matterbridge, vous devriez restreindre l'accès à ce port à l'IP de votre serveur Matterbridge.
pt_br: Em seguida, você precisa abrir a porta C2S (por padrão, `52822`, mas verifique as configurações do plugin para obter o valor atual) no seu firewall para que ela possa ser acessada pela internet. Se você não quiser usar conexões C2S para nada além do seu serviço Matterbridge, restrinja o acesso a essa porta ao IP do seu servidor Matterbridge.

source: You also need to add DNS records (A and AAAA) for `anon.example.org` and `room.example.org` (replace `example.org` by your actual domain name).
ca: També heu d'afegir registres DNS (A i AAAA) per a «anon.exemple.cat» i «room.exemple.cat» (substituïu «exemple.cat» pel vostre nom de domini actual).
fr: Vous devez également ajouter des enregistrements DNS (A et AAAA) pour `anon.example.org` et `room.example.org` (remplacez `example.org` par votre nom de domaine actuel).
pt_br: Você também precisa adicionar registros DNS (A e AAAA) para `anon.example.org` e `room.example.org` (substitua `example.org` pelo seu nome de domínio real).

source: In case you are using a port other than `5222` (XMPP standard port) you also need to set the [xmpp-client SRV record](https://prosody.im/doc/dns#srv_records) to the correct port.
ca: Si utilitzeu un port diferent de `5222` (port estàndard XMPP), també heu de configurar el registre SRV [xmpp-client](https://prosody.im/doc/dns#srv_records) al port correcte.
fr: Si vous utilisez un port autre que `5222` (port standard XMPP), vous devez également définir l'enregistrement SRV [xmpp-client](https://prosody.im/doc/dns#srv_records) sur le port correct.
pt_br: Caso você esteja usando uma porta diferente de `5222` (porta padrão XMPP), você também precisa definir o [registro SRV do cliente xmpp](https://prosody.im/doc/dns#srv_records) para a porta correta.

source: Configurating Matterbridge
ca: Configurar Matterbridge
fr: Configurer Matterbridge
pt_br: Configurando o Matterbridge

source: In the version 1.22.4, Matterbridge added support for XMPP anonymous connections needed to connect to the built-in prosody.
ca: A la versió 1.22.4, Matterbridge va afegir suport per a connexions anònimes XMPP, necessàries per connectar-se al servidor Prosody integrat.
fr: Dans la version 1.22.4, Matterbridge a ajouté la prise en charge des connexions anonymes XMPP, nécessaires pour se connecter au serveur Prosody intégré.
pt_br: Na versão 1.22.4, o Matterbridge adicionou suporte para conexões anônimas XMPP necessárias para conectar à prosódia integrada.

source: So in the TOML config file put:
ca: Per tant, al fitxer de configuració TOML heu de posar:
fr: Ainsi, dans le fichier de configuration TOML, il faut mettre :
pt_br: Então no arquivo de configuração TOML coloque:

source: Replace `example.org` by your actual instance domain name.
ca: Substituïu `exemple.cat` pel nom de domini de la vostra instància.
fr: Remplacez `example.org` par le nom de domaine de votre instance.
pt_br: Substitua `example.org` pelo nome de domínio da sua instância real.

source: Replace `52822` by the actual port if you changed it.
ca: Substituïu `52822` pel port actual si l'heu canviat.
fr: Remplacez `52822` par le port actuel si vous l'avez changé.
pt_br: Substitua `52822` pela porta real, caso você a tenha alterado.

source: `mypeertube` can be replaced by another name.
ca: `elmeupeertube` es pot substituir per un altre nom.
fr: `mypeertube` peut être remplacé par un autre nom.
pt_br: `mypeertube` pode ser substituído por outro nome.

source: Using `peertube` as the Nick will provide put PeerTube icon for overlay messages, can be also done with overlay config modification.
ca: L'ús de `peertube` com a àlies (Nick) proporcionarà la icona PeerTube per als missatges superposats, que també es pot fer canviant la configuració de la superposició.
fr: L'utilisation de `peertube` comme pseudonyme (Nick) fournira l'icône PeerTube pour les messages superposés, ce qui peut également être fait avec la modification de la configuration de la superposition.
pt_br: Usar `peertube` como Nick fornecerá o ícone do PeerTube para mensagens de sobreposição, o que também pode ser feito com modificações na configuração da sobreposição.

source: The setting `NoTLS=true` allows connecting to a server with self-signed certificates.
ca: El paràmetre `NoTLS=true` us permet connectar-vos a un servidor amb certificats autofirmats.
fr: Le paramètre `NoTLS=true` permet de se connecter à un serveur avec des certificats auto-signés.
pt_br: A configuração `NoTLS=true` permite conectar a um servidor com certificados autoassinados.

source: Now you can add this account to gateways and bridge specific live-chat channels.
ca: Ara podeu afegir aquest compte a passarel·les i que faci de pont entre canals de xat.
fr: Vous pouvez désormais ajouter ce compte aux passerelles et faire le pont des canaux de tchat.
pt_br: Agora você pode adicionar esta conta a gateways e conectar canais de bate-papo ao vivo específicos.

source: This documentation use an anonymous account to connect the bridge to the chat. But since the livechat v10.1.0, there is a new way to generate long term authentication token, that allows to connect using your account. This is used for [OBS docks](/peertube-plugin-livechat/documentation/user/obs). Using this feature for other purposes is not documented and not officially supported yet. If you want to use it anyway, you can request a token by calling then `/plugins/livechat/router/api/auth/tokens` endpoint. To get needed headers and request body, just check what happens when you generate a new token for OBS docks.
ca: Aquesta documentació utilitza un compte anònim per connectar la passarel·la al xat. Però des de la versió 10.1.0 del livechat, hi ha una nova manera de generar una fitxa d'autenticació a llarg termini, que us permet iniciar sessió amb el vostre compte. S'utilitza per a [OBS docks](/peertube-plugin-livechat/ca/documentation/user/obs). L'ús d'aquesta funció per a altres finalitats no està documentat i encara no s'admet oficialment. Si el voleu utilitzar de totes maneres, podeu sol·licitar una fitxa cridant a `/plugins/livechat/router/api/auth/tokens`. Per obtenir les capçaleres necessàries i el cos de la sol·licitud, només cal que mireu què passa quan genereu una nova fitxa per a OBS docks.
fr: Cette documentation utilise un compte anonyme pour connecter la passerelle au tchat. Mais depuis la version 10.1.0 de livechat, il existe une nouvelle façon de générer un jeton d'authentification à long terme, qui permet de se connecter en utilisant son compte. Ceci est utilisé pour les [docks OBS](/peertube-plugin-livechat/fr/documentation/user/obs). L'utilisation de cette fonctionnalité à d'autres fins n'est pas documentée et n'est pas encore officiellement supportée. Si vous voulez l'utiliser quand même, vous pouvez demander un jeton en appelant le point de terminaison `/plugins/livechat/router/api/auth/tokens`. Pour obtenir les en-têtes et le corps de requête nécessaires, regardez simplement ce qui se passe lorsque vous générez un nouveau jeton pour les docks OBS.
pt_br: Esta documentação utiliza uma conta anônima para conectar a ponte ao chat. Mas, desde o LiveChat v10.1.0, existe uma nova maneira de gerar um token de autenticação de longo prazo, que permite a conexão usando sua conta. Isso é usado para [docas OBS](/peertube-plugin-livechat/documentation/user/obs). O uso desse recurso para outros fins não está documentado e ainda não é oficialmente suportado. Se você quiser usá-lo mesmo assim, pode solicitar um token chamando o endpoint `/plugins/livechat/router/api/auth/tokens`. Para obter os cabeçalhos e o corpo da solicitação necessários, basta verificar o que acontece quando você gera um novo token para docas OBS.

source: Allow connections using XMPP clients
ca: Permetre la connexió mitjançant clients XMPP
fr: Autoriser la connexion en utilisant des clients XMPP
pt_br: Permitir conexões usando clientes XMPP

source: XMPP clients
ca: Clients XMPP
fr: Clients XMPP
pt_br: Clientes XMPP

source: This chat module is based on the XMPP protocol, also known as Jabber. It is therefore possible to connect to the chats using [XMPP client software](https://en.wikipedia.org/wiki/XMPP#Clients). This can for example be useful to facilitate moderation operations.
ca: Aquest mòdul de xat es basa en el protocol XMPP, també conegut com Jabber. Per tant, és possible connectar-se als xats mitjançant [programari client XMPP](https://ca.wikipedia.org/wiki/Extensible_Messaging_and_Presence_Protocol#Clients). Això pot ser útil, per exemple, per facilitar les operacions de moderació.
fr: Ce module de tchat repose sur le protocole XMPP, aussi connu sous le nom de Jabber. Il est donc possible de se connecter aux tchats en utilisant des [logiciels clients XMPP](https://fr.wikipedia.org/wiki/Clients_XMPP). Cela peut par exemple être utile pour faciliter les opérations de modération.
pt_br: Este módulo de bate-papo é baseado no protocolo XMPP, também conhecido como Jabber. Portanto, é possível conectar-se aos bate-papos usando [software cliente XMPP](https://en.wikipedia.org/wiki/XMPP#Clients). Isso pode ser útil, por exemplo, para facilitar as operações de moderação.

source: For the user documentation associated with these features, please refer to the [user documentation page](/peertube-plugin-livechat/documentation/user/xmpp_clients/).
ca: Per obtenir la documentació d'usuari associada a aquestes funcions, consulteu la [pàgina de documentació de l'usuari](/peertube-plugin-livechat/ca/documentation/user/xmpp_clients/).
fr: Pour la documentation utilisateur⋅rice associé à ces fonctionnalités, veuillez vous référer à la page [de documentation utilisateur⋅rice](/peertube-plugin-livechat/fr/documentation/user/xmpp_clients/).
pt_br: Para obter a documentação do usuário associada a esses recursos, consulte a [página de documentação do usuário](/peertube-plugin-livechat/documentation/user/xmpp_clients/).

source: Enabling these features requires configuration changes on the server, and on the DNS records. It is not possible to configure this only from the Peertube interface, and it requires some basic system some basic system admin skills.
ca: L'habilitació d'aquestes funcions requereix canvis de configuració al servidor i als registres DNS. No és possible activar-los només des de la interfície PeerTube, i això requereix unes habilitats bàsiques d'administració del sistema.
fr: L'activation de ces fonctionnalités demande des changements de configuration sur le serveur, et sur les enregistrements DNS. Il n'est pas possible de les activer uniquement depuis l'interface de Peertube, et cela demande d'avoir quelques compétences basiques d'admin système.
pt_br: A ativação desses recursos requer alterações de configuração no servidor e nos registros DNS. Não é possível configurar isso apenas pela interface do Peertube e requer algumas habilidades básicas de administração do sistema.

source: Login to your Peertube account
ca: Iniciar sessió amb el vostre compte de PeerTube
fr: Connexion à votre compte Peertube
pt_br: Entre na sua conta Peertube

source: This feature is not yet available, and will come in a future version of the plugin.
ca: Aquesta funcionalitat encara no està disponible i arribarà en una versió futura del connector.
fr: Cette fonctionnalité n'est pas encore disponible, et viendra dans une prochaine version du plugin.
pt_br: Este recurso ainda não está disponível e estará disponível em uma versão futura do plugin.

source: Connection using an external XMPP account
ca: Iniciar sessió amb un compte XMPP extern
fr: Connexion en utilisant un compte XMPP externe
pt_br: Conexão usando uma conta XMPP externa

source: To enable this feature, you will need to set up your server and DNS records, so that XMPP clients can find and access the [Prosody server](https://prosody.im) that this plugin uses internally.
ca: Per habilitar aquesta funció haureu de configurar el vostre servidor i els registres DNS, de manera que els clients XMPP puguin trobar i accedir al servidor [Prosody](https://prosody.im) que aquest connector utilitza internament.
fr: Pour activer cette fonctionnalité, il va falloir paraméter votre serveur et vos enregistrements DNS, de sorte que les clients XMPP puissent trouver et accéder au serveur [Prosody](https://prosody.im) que ce plugin utilise en interne.
pt_br: Para habilitar esse recurso, você precisará configurar seu servidor e registros DNS para que os clientes XMPP possam encontrar e acessar o [servidor Prosody](https://prosody.im) que este plugin usa internamente.

source: Plugin settings
ca: Configuració del connector
fr: Paramètres du plugin
pt_br: Configurações do plugin

source: Start by going to the livechat plugin settings of your instance, then enable the setting "Enable connection to room using external XMPP accounts". By checking this setting, new settings appear below.
ca: Comenceu anant a la configuració del connector de livechat de la vostra instància i, a continuació, activeu la configuració «Permetre connexions a les sales mitjançant comptes XMPP externs». En marcar-ho, apareixen nous camps a continuació.
fr: Commencez par aller dans les paramètres du plugin livechat de votre instance, puis activez le paramètre «Autoriser les connexions aux salons via des comptes XMPP externes». En cochant celui-ci, de nouveaux champs apparaissent en dessous.
pt_br: Comece acessando as configurações do plugin de chat ao vivo da sua instância e ative a opção "Habilitar conexão com a sala usando contas XMPP externas". Ao marcar esta opção, as novas configurações serão exibidas abaixo.

source: First of all, the "Prosody server to server port" field. This one defaults to 5269, which is the standard port for this service. You can however change to another port, if this is already in use on your server.
ca: Primer, el camp «Port per a connexions de servidor Prosody a servidor». El valor predeterminat és 5269, que és el port estàndard per a aquest servei. Tanmateix, podeu canviar a un altre port, si aquest ja s'utilitza al vostre servidor.
fr: Tout d'abord, le champs «Port Prosody serveur vers serveur». Celui-ci prend par défaut la valeur 5269, qui est le port standard pour ce service. Vous pouvez toutefois changer pour un autre port, si celui-ci est déjà utilisé sur votre serveur.
pt_br: Primeiro, o campo "Porta de servidor Prosody para servidor". O padrão é 5269, que é a porta padrão para este serviço. No entanto, você pode alterar para outra porta, se ela já estiver em uso no seu servidor.

source: Next, the field "Server to server network interfaces" field allows you to specify which network interfaces the server should listen on. The default value "*, ::" indicates to listen on all IP addresses. You can change these values, if you wish to listen on only certain IP addresses. The syntax is explained next to the setting.
ca: A continuació, el camp «Interfícies de xarxa per a connexions de servidor a servidor» us permet indicar a quines interfícies de xarxa ha d'escoltar el servidor. El valor predeterminat «*, ::» indica que s'escolta a totes les adreces IP. Podeu canviar aquests valors, si voleu escoltar només en determinades IP. La sintaxi s'explica al costat del camp.
fr: Ensuite, le champs «Interfaces réseau pour les connexions serveur vers serveur» vous permet d'indiquer sur quelles interfaces réseau le serveur doit écouter. La valeur par défaut «*, ::» indique d'écouter sur toutes les addresses IP. Vous pouvez changer ces valeurs, si vous souhaiter n'écouter que sur certaines IP. La syntaxe est expliquée à coté du champs.
pt_br: Em seguida, o campo "Interfaces de rede entre servidores" permite especificar em quais interfaces de rede o servidor deve escutar. O valor padrão "*, ::" indica que todos os endereços IP devem ser escutados. Você pode alterar esses valores se desejar escutar apenas determinados endereços IP. A sintaxe é explicada ao lado da configuração.

source: For the "Certificate folder" setting, you can leave it empty. In this case, the plugin will automatically generate self-signed certificates. Some XMPP servers may refuse to connect, depending on their configuration. In this case, you can indicate here a path on the server, in which you must place certificates to be used by the module. It is up to you to generate and renew them. See bellow for more information.
ca: Quant al camp «Carpeta de certificats», podeu deixar-lo buit. En aquest cas, el connector generarà automàticament certificats autofirmats. Alguns servidors XMPP poden negar-se a connectar-se, depenent de llur configuració. En aquest cas, podeu indicar aquí una ruta al servidor, en la qual heu de col·locar els certificats per ser utilitzats pel mòdul. Depèn de vosaltres generar-los i renovar-los. Més informació a continuació.
fr: Pour le champs «Dossiers des certificats», vous pouvez le laisser vide. Dans ce cas là, le plugin va générer automatiquement des certificats auto-signés. Il se pourrait que certains serveurs XMPP refusent de se connecter, cela dépendant de leur paramétrage. Dans ce cas, vous pouvez indiquer ici un chemin sur le serveur, dans lequel vous placerez des certificats à utiliser par le module. Charge à vous de les générer et de les renouveller. Voir plus loin pour une explication plus détaillée.
pt_br: Para a configuração "Pasta de certificados", você pode deixá-la vazia. Nesse caso, o plugin gerará automaticamente certificados autoassinados. Alguns servidores XMPP podem se recusar a conectar, dependendo de sua configuração. Nesse caso, você pode indicar aqui um caminho no servidor, no qual deverá colocar os certificados a serem usados pelo módulo. Cabe a você gerá-los e renová-los. Veja abaixo para mais informações.

source: You must open the configured port (5269 by default) on your firewall.
ca: Heu d'obrir el port configurat (5269 per defecte) al vostre tallafoc.
fr: Vous devez ouvrir le port configuré (5269 par défaut) sur votre pare-feu.
pt_br: Você deve abrir a porta configurada (5269 por padrão) no seu firewall.

source: If you are using Docker for your Peertube, you need to modify the `docker-compose.yml` file to open port 5269 of the `peertube` container, so that the outer world can connect to it.
ca: Si utilitzeu Docker per al vostre PeerTube heu de modificar el fitxer `docker-compose.yml` per obrir el port 5269 del contenidor `peertube` al món exterior.
fr: Si vous utilisez Docker pour votre Peertube, il faut modifier le fichier `docker-compose.yml` pour ouvrir le port 5269 du conteneur `peertube` au monde extérieur.
pt_br: Se você estiver usando o Docker para seu Peertube, precisará modificar o arquivo `docker-compose.yml` para abrir a porta 5269 do contêiner `peertube`, para que o mundo externo possa se conectar a ele.

source: You need to add [DNS records](https://prosody.im/doc/dns) allowing remote servers to find "room.your_instance.tld" and "external.your_instance.tld" components.
ca: Heu d'afegir [registres DNS](https://prosody.im/doc/dns) per permetre que els servidors remots trobin els components «room.exemple.cat» i «external.exemple.cat».
fr: Vous devez ajouter des [enregistrements DNS](https://prosody.im/doc/dns) permettant aux serveurs distant de trouver les composants «room.votre_instance.tld» et «external.votre_instance.tld».
pt_br: Você precisa adicionar [registros DNS](https://prosody.im/doc/dns) permitindo que servidores remotos encontrem os componentes "room.your_instance.tld" e "external.your_instance.tld".

source: The easiest way to do this is to add SRV records for the "room" and "external" [subdomain](https://prosody.im/doc/dns#subdomains):
ca: La manera més senzilla de fer-ho és afegir registres SRV per als [subdominis](https://prosody.im/doc/dns#subdomains) «room» i «external»:
fr: Le plus simple pour cela est d'ajouter des enregistrements SRV pour les [sous-domaines](https://prosody.im/doc/dns#subdomains) «room» et «external» :
pt_br: A maneira mais fácil de fazer isso é adicionar registros SRV para o "room" e o "external" [subdomínio](https://prosody.im/doc/dns#subdomains):

source: record name: _xmpp-server._tcp.room.your_instance.tld. (replace «your_instance.tld» by your instance uri)
ca: nom del registre: _xmpp-server._tcp.room.exemple.cat. (substituïu «exemple.cat» per la URI de la vostra instància)
fr: nom de l'enregistrement : _xmpp-server._tcp.room.votre_instance.tld. (remplacez «votre_instance.tld» par la valeur adéquate)
pt_br: nome do registro: _xmpp-server._tcp.room.your_instance.tld. (substitua «your_instance.tld» pelo URI da sua instância)

source: class: IN
pt_br: classe: IN

source: priority: 0
pt_br: prioridade: 0

source: weight: 5
pt_br: peso: 5

source: port: 5269 (adapt if your changed the default port)
ca: port: 5269 (adapteu-lo si heu canviat el port)
fr: port: 5269 (adaptez si vous avez changé le port)
pt_br: porta: 5269 (adaptar se você alterou a porta padrão)

source: target: your_instance.tld. (replace by your instance uri)
ca: target: exemple.cat. (substituïu-lo per la URI de la vostra instància)
fr: target: votre_instance.tld. (remplacez par la valeur adéquate)
pt_br: alvo: your_instance.tld. (substitua pelo uri da sua instância)

source: record name: _xmpp-server._tcp.external.your_instance.tld. (replace «your_instance.tld» by your instance uri)
ca: record name: _xmpp-server._tcp.external.exemple.cat. (substituïu «exemple.ca» per la URI de la vostra instància)
fr: nom de l'enregistrement : _xmpp-server._tcp.external.votre_instance.tld. (remplacez «votre_instance.tld» par la valeur adéquate)
pt_br: nome do registro: _xmpp-server._tcp.external.your_instance.tld. (substitua «your_instance.tld» pelo uri da sua instância)

source: Be careful to keep the dot after "your_instance.tld".
ca: Aneu amb compte de mantindre el punt després d'«exemple.cat».
fr: Attention à bien conserver le point après «votre_instance.tld».
pt_br: Tenha cuidado para manter o ponto depois de "your_instance.tld".

source: Using the `dig` command to check your records, you should get a result similar to this:
ca: Si utilitzeu l'ordre `dig` per comprovar els vostres registres, hauríeu d'obtenir un resultat semblant a aquest:
fr: En utilisant la commande `dig` pour vérifier vos enregistrements, vous devriez obtenir un résultat similaire à celui-ci :
pt_br: Usando o comando `dig` para verificar seus registros, você deverá obter um resultado semelhante a este:

source: $ dig +short _xmpp-server._tcp.room.videos.john-livingston.fr. SRV 0 5 5269 videos.john-livingston.fr. $ dig +short _xmpp-server._tcp.external.videos.john-livingston.fr. SRV 0 5 5269 videos.john-livingston.fr.
pt_br: $ dig +short _xmpp-server._tcp.room.videos.john-livingston.fr. SRV 0 5 5269 vídeos.john-livingston.fr. $ dig +short _xmpp-server._tcp.external.videos.john-livingston.fr. SRV 0 5 5269 vídeos.john-livingston.fr.
