Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Contact the author
ca: Contactar amb l'autor
fr: Contacter l'auteur
pt_br: Entre em contato com o autor

source: Contact me
ca: Contacteu amb mi
fr: Me contacter
pt_br: Entre em contato comigo

source: If you have any question, or if you want to talk about this plugin, you can join this XMPP room with any Jabber client: [plugin-livechat-support@room.im.yiny.org](xmpp:plugin-livechat-support@room.im.yiny.org?join).
ca: Si teniu cap pregunta o voleu parlar sobre aquest connector, podeu unir-vos a aquesta sala XMPP amb qualsevol client de Jabber: [plugin-livechat-support@room.im.yiny.org](xmpp:plugin-livechat-support@room.im.yiny.org?join).
fr: Si vous avez des questions ou souhaitez parler de ce plugin, vous pouvez rejoindre ce salon XMPP avec n'importe quel client Jabber : [plugin-livechat-support@room.im.yiny.org](xmpp:plugin-livechat-support@room.im.yiny.org?join).
pt_br: Se você tiver alguma dúvida ou quiser conversar sobre este plugin, você pode entrar nesta sala XMPP com qualquer cliente Jabber: [plugin-livechat-support@room.im.yiny.org](xmpp:plugin-livechat-support@room.im.yiny.org?join).

source: If you want to support the project financially, you can contact me by mail at git.[at].john-livingston.fr, or check my [Liberapay profile](https://liberapay.com/JohnLivingston/).
ca: Si voleu donar suport econòmic al projecte, podeu contactar amb mi per correu electrònic a git.[at].john-livingston.fr, o consultar el meu [perfil de Liberapay](https://liberapay.com/JohnLivingston/).
fr: Si vous souhaitez supporter le projet financièrement, vous pouvez me contacter par mail à l'adresse git.[arobase].john-livingston.fr, ou passer par mon [profil Liberapay](https://liberapay.com/JohnLivingston/).
pt_br: Se você quiser apoiar o projeto financeiramente, pode entrar em contato comigo por e-mail em git.[at].john-livingston.fr ou conferir meu [perfil do Liberapay](https://liberapay.com/JohnLivingston/).

source: Contributor Covenant Code of Conduct
ca: Convenció de codi de conducta per col·laboradors/es
fr: Convention de Code de conduite Contributeur⋅rices
pt_br: Código de Conduta do Pacto do Colaborador

source: Code of Conduct
ca: Codi de conducta
fr: Code de conduite
pt_br: Código de Conduta

source: This Code of Conduct is adapted from the [Contributor Covenant](https://www.contributor-covenant.org), version 2.1, available at [https://www.contributor-covenant.org/version/2/1/code_of_conduct.html](https://www.contributor-covenant.org/version/2/1/code_of_conduct.html). Translations are available at [https://www.contributor-covenant.org/translations](https://www.contributor-covenant.org/translations). Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement by mail at git.[at].john-livingston.fr.
ca: Aquest codi de conducta està adaptat de [Contributor Covenant](https://www.contributor-covenant.org), versió 2.1, disponible a [https://www.contributor-covenant.org/version/2/1/code_of_conduct .html](https://www.contributor-covenant.org/version/2/1/code_of_conduct.html). Les traduccions estan disponibles a [https://www.contributor-covenant.org/translations](https://www.contributor-covenant.org/translations). Els casos de comportament abusiu, assetjador o altres comportaments inacceptables es poden informar als líders de la comunitat responsables de fer complir el codi de conducta a git.[at].john-livingston.fr.
fr: Ce code de conduite est adapté du [Contributor Covenant](https://www.contributor-covenant.org), version 2.1, disponible à l'adresse [https://www.contributor-covenant.org/version/2/1/code_of_conduct.html](https://www.contributor-covenant.org/version/2/1/code_of_conduct.html). Les traductions sont disponibles à l'adresse [https://www.contributor-covenant.org/translations](https://www.contributor-covenant.org/translations). Les cas de comportements abusifs, harcelants ou tout autre comportement inacceptables peuvent être signalés aux dirigeant·e·s de la communauté responsables de l’application du code de conduite à git.[at].john-livingston.fr.
pt_br: Este Código de Conduta é uma adaptação do [Contributor Covenant](https://www.contributor-covenant.org), versão 2.1, disponível em [https://www.contributor-covenant.org/version/2/1/code_of_conduct.html](https://www.contributor-covenant.org/version/2/1/code_of_conduct.html). As traduções estão disponíveis em [https://www.contributor-covenant.org/translations](https://www.contributor-covenant.org/translations). Casos de comportamento abusivo, assediador ou de outra forma inaceitável podem ser denunciados aos líderes da comunidade responsáveis pela aplicação da lei por e-mail para git.[at].john-livingston.fr.

source: Develop
ca: Desenvolupar
fr: Développer
pt_br: Desenvolver

source: Always talk about features you want to develop by creating/finding and commenting the issue tackling your problem before you start working on it, and inform the community that you begin coding by claiming the issue.
ca: Anuncieu sempre les funcions en què voleu treballar creant un tiquet o comentant-ne un d'existent, abans de començar a treballar-hi, i anunciar clarament a la comunitat que esteu començant a treballar-hi. Això és per evitar que diverses persones treballin en el mateix i entrin en conflicte.
fr: Toujours annoncer les fonctionnalités sur lesquelles vous voulez travailler en créant un ticket ou en commentant un ticket existant, avant de commencer à travailler dessus.Et annoncez clairement à la communauté que vous commencez à travailler dessus. Ceci afin d'éviter que plusieurs personnes travaillent sur la même chose et entrent en conflit.
pt_br: Fale sempre sobre os recursos que você quer desenvolver, criando/encontrando e comentando o problema que o aborda antes de começar a trabalhar nele, e informe à comunidade que você começou a codificar reivindicando o problema.

source: Pull Request must be done on the `main` branch.
ca: Les «Pull Request» s'han de fer a la branca `main`.
fr: Les Pull Request sont à faire sur la branche `main`.
pt_br: O Pull Request deve ser feito no branch `main`.

source: Until march 2023, contribution were made on the `develop` branch. This procedure is now deprecated.
ca: Fins al març de 2023, s'havia de contribuir a la branca `develop`. Aquest procediment ja està obsolet.
fr: Jusqu'à mars 2023, il fallait contribuer sur la branche `develop`. Cette procédure est désormais obsolète.
pt_br: Até março de 2023, as contribuições eram feitas no branch `develop`. Este procedimento está obsoleto.

source: Prerequisite for building this plugin
ca: Requisits previs per compilar aquest connector
fr: Pré-requis pour compiler le plugin
pt_br: Pré-requisito para construir este plugin

source: It is highly recommended to be familiar with following concepts:
ca: És molt recomanable estar familiaritzat/da amb els conceptes següents:
fr: Il est hautement recommandé d'être familier avec les concepts suivants :
pt_br: É altamente recomendável estar familiarizado com os seguintes conceitos:

source: Typescript
pt_br: Texto datilografado

source: To build the plugin, you must have following packages:
ca: Per construir el connector cal que tingueu instal·lats els paquets següents:
fr: Pour construire le module, vous avez besoin d'avoir installé les paquets suivants :
pt_br: Para construir o plugin, você deve ter os seguintes pacotes:

source: `build-essential`
pt_br: `construção-essencial`

source: `reuse`
pt_br: `reutilização`

source: Please note that this plugin needs an AppImage for the Prosody XMPP server. This AppImage is provided by the [Prosody AppImage](https://github.com/JohnXLivingston/prosody-appimage) sideproject. The `build-prosody.sh` script download binaries attached to this remote repository, and checks that their sha256 hashsum are correct.
ca: Tingueu en compte que aquest connector necessita una AppImage del servidor XMPP Prosody. Aquesta AppImage la proporciona el projecte [Prosody AppImage](https://github.com/JohnXLivingston/prosody-appimage). L'script `build-prosody.sh` baixa els binaris connectats a aquest repositori remot i verifica que les sumes de verificació sha256 siguin correctes.
fr: Veuillez noter que ce plugin a besoin d'une AppImage du serveur XMPP Prosody. Cette AppImage est fournie par le project [Prosody AppImage](https://github.com/JohnXLivingston/prosody-appimage). Le script `build-prosody.sh` télécharge les binaires attachés à ce dépôt distant, et vérifie que les sommes de contrôles sha256 sont correctes.
pt_br: Observe que este plugin precisa de uma AppImage para o servidor Prosody XMPP. Esta AppImage é fornecida pelo projeto paralelo [Prosody AppImage](https://github.com/JohnXLivingston/prosody-appimage). O script `build-prosody.sh` baixa os binários anexados a este repositório remoto e verifica se seus hashsums sha256 estão corretos.

source: Clone the repository, buid the plugin, and create your feature branch:
ca: Cloneu el repositori, construïu el connector i creeu la vostra branca de funcionalitat:
fr: Clonez le dépôt, construisez le plugin, et créez votre branche de fonctionnalité :
pt_br: Clone o repositório, construa o plugin e crie seu branch de recurso:

source: # Clone the repository. Dont forget the --recursive to clone submodules. git clone https://github.com/JohnXLivingston/peertube-plugin-livechat.git --recursive cd peertube-plugin-livechat # Install NPM dependencies and build the module for the first time: npm install # Build the plugin after a modification: npm run build # If you have a fork from the repository, add it as remote (example): git remote add me git@github.com:MY_GITHUB_ACCOUNT/peertube-plugin-livechat.git # Create a local branch for you developments, and checkout it (example): git checkout my_development # Note: if an issue is associated, use fix_1234 as your branch name (where 1234 is the issue's number) # To propose your modifications, push your branch to your repository (example): git push --set-upstream me my_development # Then go to your github repository with your web browser to propose the Pull Request (see additional instructions below)
ca: # Clonar el repositori. No oblideu el --recursive, per clonar els submòduls. git clone https://github.com/JohnXLivingston/peertube-plugin-livechat.git --recursive cd peertube-plugin-livechat # Instal·lar les dependències NPM i compilar el connector per primera vegada: npm install # Compilar el connector després d'una modificació: npm run build # Si teniu una bifurcació del repositori, afegiu-la de manera remota (exemple): git remote add me git@github.com:EL_MEU_COMPTE_GITHUB/peertube-plugin-livechat.git # Creeu una sucursal local per als vostres desenvolupaments i col·loqueu-vos-hi (exemple): git checkout meu_desenvolupament # Nota: si hi ha associat un tiquet, utilitzeu el nom fix_1234 (on 1234 és el número de tiquet) # Per proposar les vostres modificacions envieu la vostra branca al vostre repositori (exemple): git push --set-upstream me meu_desenvolupament # A continuació, aneu al vostre repositori github amb el vostre navegador web per proposar la «Pull Request» (vegeu les instruccions addicionals a continuació)
fr: # Cloner le dépot. N'oubliez pas le --recursive, pour clôner les sous-modules. git clone https://github.com/JohnXLivingston/peertube-plugin-livechat.git --recursive cd peertube-plugin-livechat # Installer les dépendances NPM et compiler le plugin pour la première fois : npm install # Compiler le plugin après une modification : npm run build # Si vous avez un fork du dépot, ajoutez le en remote (exemple) : git remote add me git@github.com:MON_COMPTE_GITHUB/peertube-plugin-livechat.git # Créez une branche locale pour vos développements et placez vous dessus (exemple) : git checkout mon_developpement # NB: si un ticket y est associé, utilisé le nom fix_1234 (où 1234 est le numéro du ticket) # Pour proposer vos modifications, poussez votre branche sur votre dépot (exemple) : git push --set-upstream me mon_developpement # Rendez-vous ensuite sur votre dépot github avec votre navigateur web pour proposer la Pull Request (voir les instructions complémentaires ci-dessous)
pt_br: # Clone o repositório. Não se esqueça de usar --recursive para clonar submódulos. git clone https://github.com/JohnXLivingston/peertube-plugin-livechat.git --recursive cd peertube-plugin-livechat # Instale as dependências do NPM e compile o módulo pela primeira vez: npm install # Compile o plugin após uma modificação: npm run build # Se você tiver um fork do repositório, adicione-o como remoto (exemplo): git remote add me git@github.com:MY_GITHUB_ACCOUNT/peertube-plugin-livechat.git # Crie uma ramificação local para seus desenvolvimentos e faça check-out dela (exemplo): git checkout my_development # Observação: se um problema estiver associado, use fix_1234 como nome do seu branch (onde 1234 é o número do issue) # Para propor suas modificações, envie seu branch para seu repositório (exemplo): git push --set-upstream me my_development # Em seguida, vá para seu repositório github com seu navegador da web para propor o Pull Request (veja instruções adicionais abaixo)

source: Once you are ready to show your code to ask for feedback, submit a *draft* Pull Request. Once you are ready for a code review before merge, submit a Pull Request. In any case, please link your PR to the issues it solves by using the GitHub syntax: "fixes #issue_number".
ca: Quan estigueu preparat/da per mostrar el vostre codi i demanar comentaris, envieu una «Pull Request» *esborrany*. Quan estigueu preparat/da per a una revisió del codi abans de la fusió, envieu una «Pull Request». En tots els casos, enllaceu la vostra PR amb el tiquet en qüestió mitjançant la sintaxi de GitHub: «fixes #issue_NombreTiquet».
fr: Quand vous êtes prêt⋅e à montrer votre code pour avoir un retour, soumettez une Pull Request *draft*. Quand vous êtes prêt⋅e pour une relecture de code avant merge, soumettez une Pull Request. Dans tous les cas, merci de lier votre Pull Request au ticket concerné en utilisant la syntax de GitHub : «fixes #issue_number».
pt_br: Quando estiver pronto para mostrar seu código e solicitar feedback, envie um *rascunho* de Pull Request. Quando estiver pronto para uma revisão de código antes da mesclagem, envie um Pull Request. De qualquer forma, vincule seu PR aos problemas que ele resolve usando a sintaxe do GitHub: "fixes #issue_number".

source: The front-end code is in the `client` folder, the back-end code in `server`. There are some shared code in `shared` folder.
ca: El codi del «front-end» es troba a la carpeta `client`. El codi del «back-end» a `server`. Hi ha codi compartit entre els dos a `shared`.
fr: Le code du front-end est dans le dossier `client`. Le code backend dans `server`. Il y a du code partagé entre les deux dans `shared`.
pt_br: O código do front-end está na pasta `client`, o código do back-end em `server`. Há alguns códigos compartilhados na pasta `shared`.

source: For general instructions (developping plugins, building, installation, ...), please refer to the [Peertube documentation](https://docs.joinpeertube.org/contribute-plugins?id=write-a-plugintheme).
ca: Per a instruccions genèriques sobre el desenvolupament de connectors (construcció, instal·lació, etc.), consulteu la [documentació de Peertube](https://docs.joinpeertube.org/contribute-plugins?id=write-a-plugintheme).
fr: Pour les instructions génériques concernant le développement de plugins (building, installation, ...), merci de vous référer à la [documentation Peertube](https://docs.joinpeertube.org/contribute-plugins?id=write-a-plugintheme).
pt_br: Para instruções gerais (desenvolvimento de plugins, construção, instalação, ...), consulte a [documentação do Peertube](https://docs.joinpeertube.org/contribute-plugins?id=write-a-plugintheme).

source: You can build the plugin with extra debug features simply by using:
ca: Podeu construir el connector amb informació de depuració addicional mitjançant:
fr: Vous pouvez *builder* le plugin avec des infos de debug supplémentaires en utilisant :
pt_br: Você pode construir o plugin com recursos extras de depuração simplesmente usando:

source: This plugin is [REUSE](https://reuse.software/) compliant: it uses SPDX headers to identify licensing information of its source code. More information on the [REUSE](https://reuse.software/) website. You can use the [reuse](https://reuse.readthedocs.io/en/stable/readme.html#) command line tool to help you update headers. The `npm run lint` command will use the `reuse` command to check compliance. Don't forget to add your copyright information in SPDX headers when you modify some code.
ca: Aquest connector compleix amb l'estàndard [REUSE](https://reuse.software/): utilitza capçaleres SPDX per identificar la informació de llicència del seu codi font. Més informació al lloc web [REUSE](https://reuse.software/). Podeu utilitzar l'eina de línia d'ordres [reuse](https://reuse.readthedocs.io/en/stable/readme.html#) per ajudar-vos a actualitzar les capçaleres. L'ordre `npm run lint` utilitzarà l'ordre `reuse` per comprovar el compliment. No oblideu afegir la vostra informació de copyright a les capçaleres SPDX quan canvieu el codi.
fr: Ce plugin est conforme à la norme [REUSE](https://reuse.software/) : il utilise des en-têtes SPDX pour identifier les informations de licence de son code source. Plus d'informations sur le site [REUSE](https://reuse.software/). Vous pouvez utiliser l'outil en ligne de commande [reuse](https://reuse.readthedocs.io/en/stable/readme.html#) pour vous aider à mettre à jour les en-têtes. La commande `npm run lint` utilisera la commande `reuse` pour vérifier la conformité. N'oubliez pas d'ajouter vos informations de copyright dans les en-têtes SPDX lorsque vous modifiez du code.
pt_br: Este plugin é compatível com [REUSE](https://reuse.software/): ele usa cabeçalhos SPDX para identificar informações de licenciamento de seu código-fonte. Mais informações no site [REUSE](https://reuse.software/). Você pode usar a ferramenta de linha de comando [reuse](https://reuse.readthedocs.io/en/stable/readme.html#) para ajudar a atualizar os cabeçalhos. O comando `npm run lint` usará o comando `reuse` para verificar a conformidade. Não se esqueça de adicionar suas informações de direitos autorais nos cabeçalhos SPDX ao modificar algum código.

source: This plugin uses ESBuild for frontend code generation, as the official `peertube-plugin-quickstart` plugin. ESBuild can handle Typescript, but does not check types (see [ESBuild documentation](https://esbuild.github.io/content-types/#typescript)). That's why we first compile Typescript with the `-noEmit` option, just to check types (`check:client:ts` in package.json file). Then, if everything is okay, we run ESBuild to generate the compiled javascript.
ca: Aquest connector utilitza ESBuild per compilar el codi del «front-end», com el connector oficial `peertube-plugin-quickstart`. ESBuild pot gestionar Typescript, però no verifica els tipus (vegeu [documentació d'ESBuild](https://esbuild.github.io/content-types/#typescript)). És per això que primer compilem Typescript amb l'opció `-noEmit`, només per comprovar els tipus (`check:client:ts` al fitxer package.json). Aleshores, si tot està bé, iniciem ESBuild per generar el javascript compilat.
fr: Ce plugin utilise ESBuild pour compiler le code front-end, comme le plugin `peertube-plugin-quickstart` officiel. ESBuild peut gérer Typescript, mais ne vérifie pas les types (voir [la documentation ESBuild](https://esbuild.github.io/content-types/#typescript)). C'est pourquoi on compile d'abord Typescript avec l'option `-noEmit`, juste pour vérifier les types (`check:client:ts` dans le fichier package.json). Ensuite, si tout est ok, on lance ESBuild pour générer le javascript compilé.
pt_br: Este plugin usa o ESBuild para geração de código frontend, como o plugin oficial `peertube-plugin-quickstart`. O ESBuild pode lidar com Typescript, mas não verifica os tipos (consulte a [documentação do ESBuild](https://esbuild.github.io/content-types/#typescript)). É por isso que primeiro compilamos o Typescript com a opção `-noEmit`, apenas para verificar os tipos (`check:client:ts` no arquivo package.json). Em seguida, se tudo estiver correto, executamos o ESBuild para gerar o JavaScript compilado.

source: Debug Mode
ca: Mode de depuració
pt_br: Modo de depuração

source: There is a debug mode for this plugin, that shorten some delay. For example, some log files will rotate every two minutes, instead of once per day. This permit to test more easily certain actions, for which it could normally take hours or days to wait.
ca: Hi ha un mode de depuració per al connector, que escurçarà el temps necessari per a determinades accions. Per exemple, rotarà els registres cada dos minuts, en lloc de cada dia. Això facilita la prova de determinades accions, per a les quals normalment hauríeu d'esperar hores o dies.
fr: Il existe un mode de debug pour le plugin, qui va raccourcir le délais de certaines actions. Par exemple, il va faire tourner les journaux toutes les deux minutes, au lieu de tous les jours. Cela permet de tester plus facilement certaines actions, pour lesquelles il faudrait normalement attendre des heures ou des jours.
pt_br: Este plugin possui um modo de depuração que reduz um pouco o atraso. Por exemplo, alguns arquivos de log serão atualizados a cada dois minutos, em vez de uma vez por dia. Isso permite testar com mais facilidade determinadas ações, que normalmente levariam horas ou dias para serem concluídas.

source: To enable this mode, you juste have to create the `/var/www/peertube/storage/plugins/data/peertube-plugin-livechat/debug_mode` file (replacing `/var/www/peertube/storage/` by the correct path on your installation).
ca: Per activar aquest mode només cal que creeu un fitxer `/var/www/peertube/storage/plugins/data/peertube-plugin-livechat/debug_mode` (adaptant `/var/www/peertube/storage/` a la vostra instal·lació si escau) .
fr: Pour activer ce mode, il suffit de créer un fichier `/var/www/peertube/storage/plugins/data/peertube-plugin-livechat/debug_mode` (en adaptant `/var/www/peertube/storage/` à votre installation le cas échéant).
pt_br: Para habilitar este modo, você só precisa criar o arquivo `/var/www/peertube/storage/plugins/data/peertube-plugin-livechat/debug_mode` (substituindo `/var/www/peertube/storage/` pelo caminho correto na sua instalação).

source: The simple existence of this file is sufficient to trigger the debug mode. To make sure it's taken into account, you can restart your Peertube instance.
ca: La mera existència d'aquest fitxer és suficient per activar el mode de depuració. Per assegurar-vos que es té en compte, podeu reiniciar la vostra instància de Peertube.
fr: La simple existance de ce fichier suffit à déclencher le mode debug. Pour être sûr qu'il est pris en compte, vous pouvez redémarrer votre instance Peertube.
pt_br: A simples existência deste arquivo é suficiente para acionar o modo de depuração. Para garantir que ele seja levado em consideração, você pode reiniciar sua instância do Peertube.
