Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: If you can't fix this immediatly, you can disable Websocket by unchecking "{{% livechat_label disable_websocket_label %}}" in the plugin setting page. In such case, you should also check "{{% livechat_label federation_dont_publish_remotely_label %}}", as chat federation won't work without Websocket.
ca: Si no podeu solucionar-ho immediatament, podeu desactivar Websocket desmarcant «{{% livechat_label disable_websocket_label %}}» a la pàgina de configuració del connector. En aquest cas, també hauríeu de desmarcar «{{% livechat_label federation_dont_publish_remotely_label %}}», perquè la federació de xat no funcionarà sense Websocket.
fr: Si vous ne pouvez pas corriger cela tout de suite, vous pouvez déactiver Websocket en décochant "{{% livechat_label disable_websocket_label %}}" dans la page des paramètres du plugin. En pareil cas, vous devriez aussi décocher "{{% livechat_label federation_dont_publish_remotely_label %}}", car la fédération du tchat ne fonctionnera pas sans Websocket.
pt_br: Se não conseguir corrigir isso imediatamente, você pode desativar o Websocket desmarcando "{{% livechat_label disable_websocket_label %}}" na página de configurações do plugin. Nesse caso, você também deve marcar "{{% livechat_label federation_dont_publish_remotely_label %}}", pois a federação de chat não funcionará sem o Websocket.

source: Important notes when upgrading for an older version.
ca: Notes importants per a l'actualització des d'una versió anterior del connector.
fr: Notes importantes pour la mise à jour depuis une ancienne version du plugin.
pt_br: Notas importantes ao atualizar para uma versão mais antiga.

source: Upgrade from version older than 6.0.0
ca: Actualització des d'una versió anterior a la 6.0.0
fr: Mise à jour depuis une version antérieure à 6.0.0
pt_br: Atualização de versão anterior à 6.0.0

source: IMPORTANT NOTE
ca: NOTA IMPORTANT
pt_br: NOTA IMPORTANTE

source: Since version v6.0.0, this plugin does not need any Prosody installation.
ca: Des de la versió v6.0.0, aquest connector no necessita cap instal·lació de Prosody.
fr: Depuis la version v6.0.0, ce plugin ne nécessite plus l'installation de Prosody.
pt_br: Desde a versão v6.0.0, este plugin não necessita de instalação do Prosody.

source: If you were using this plugin before this version, and if you had installed Prosody manually, you can safely uninstall Prosody.
ca: Si utilitzàveu aquest connector abans i heu instal·lat Prosody manualment, podeu desinstal·lar-lo amb seguretat.
fr: Si vous utilisiez ce plugin avant, et que vous aviez installé Prosody manuellement, vous pouvez le désinstaller en tout sécurité.
pt_br: Se você estava usando este plugin antes desta versão e se instalou o Prosody manualmente, você pode desinstalá-lo com segurança.

source: If you were using the custom Peertube docker image that is embedding Prosody, you can switch back to the official Peertube image.
ca: Si estàveu utilitzant la imatge de docker especial de Peertube (que incloïa Prosody) podeu canviar a la imatge oficial de Peertube.
fr: Si vous utilisiez l'image docker spéciale de Peertube (qui incluais Prosody), vous pouvez basculer sur l'image officielle de Peertube.
pt_br: Se você estava usando a imagem do Docker personalizada do Peertube que está incorporando o Prosody, você pode voltar para a imagem oficial do Peertube.

source: Plugin peertube-plugin-livechat user documentation
ca: Documentació d'usuari per al connector peertube-plugin-livechat
fr: Documentation utilisateur⋅rice du plugin peertube-plugin-livechat
pt_br: Documentação do usuário do plugin peertube-plugin-livechat

source: User documentation
ca: Documentació d'usuari
fr: Documentation utilisateur⋅rice
pt_br: Documentação do usuário

source: Documentation to stream the chat content using OBS.
ca: Documentació per publicar contingut de xat mitjançant OBS.
fr: Documentation pour diffuser le contenu du tchat à l'aide d'OBS.
pt_br: Documentação para transmitir o conteúdo do bate-papo usando o OBS.

source: [OBS](https://obsproject.com) is a popular Free And Open Source streaming software, with advanced capacities for your live streams. In the current page, you will find some advices to handle your live chats using OBS.
ca: [OBS](https://obsproject.com) és un popular programari d'emissió en directe de codi obert i gratuït amb capacitats avançades. En aquesta pàgina trobareu alguns consells per gestionar els vostres xats en directe amb OBS.
fr: [OBS](https://obsproject.com) est un logiciel populaire de diffusion en direct, libre et open source, avec des capacités avancées pour vos diffusions. Dans la présente page, vous allez trouver quelques conseils pour gérer les tchats de vos directs en utilisant OBS.
pt_br: [OBS](https://obsproject.com) é um software de streaming popular, gratuito e de código aberto, com recursos avançados para suas transmissões ao vivo. Nesta página, você encontrará algumas dicas para gerenciar seus chats ao vivo usando o OBS.

source: OBS Overlay
ca: Superposició OBS
fr: Overlay OBS
pt_br: Sobreposição OBS

source: You can easily include the chat in your video stream.
ca: Podeu incloure fàcilment el xat al vostre flux de vídeo.
fr: Vous pouvez facilement inclure le tchat dans votre flux vidéo.
pt_br: Você pode facilmente incluir o bate-papo no seu fluxo de vídeo.

source: You can use the "{{% livechat_label share_chat_link %}}" feature to generate an URL to your chat. This button should be near the chat if you are the video owner (unless it was desactivated by your server admins).
ca: Podeu utilitzar la funció «{{% livechat_label share_chat_link %}}» per generar un URL al vostre xat. El botó hauria d'estar a prop del xat si sou el propietari del vídeo (tret que els administradors del vostre servidor l'hagin desactivat).
fr: Vous pouvez utiliser la fonction «{{% livechat_label share_chat_link %}}» pour générer une URL vers votre tchat. Le bouton devrait se trouver près du tchat si vous êtes le⋅a propriétaire de la vidéo (à moins qu'il n'ait été désactivé par les administrateur⋅rices de votre serveur).
pt_br: Você pode usar o recurso "{{% livechat_label share_chat_link %}}" para gerar uma URL para o seu chat. Este botão deve estar próximo ao chat se você for o proprietário do vídeo (a menos que tenha sido desativado pelos administradores do seu servidor).

source: Check the "{{% livechat_label read_only %}}" checkbox in the modal.
ca: Marqueu la casella de selecció «{{% livechat_label read_only %}}» al modal.
fr: Cochez la case à cocher «{{% livechat_label read_only %}}» dans la modale.
pt_br: Marque a caixa de seleção "{{% livechat_label read_only %}}" no modal.

source: Then use this link as a "web browser source" in OBS.
ca: A continuació, utilitzeu aquest enllaç com a «font del navegador web» a OBS.
fr: Utilisez alors ce lien en tant que «source navigateur web» dans OBS.
pt_br: Em seguida, use este link como uma "fonte do navegador da web" no OBS.

source: You can use the "{{% livechat_label transparent_background %}}" option to have a transparent background in OBS. If you want to customize the background transparency, you can add this CSS in your OBS browser source's settings:
ca: Podeu utilitzar l'opció «{{% livechat_label transparent_background %}}» per obtenir un fons transparent a OBS. Si voleu personalitzar la transparència del fons, podeu afegir aquest CSS a la configuració de font del navegador a OBS:
fr: Vous pouvez utiliser l'option «{{% livechat_label transparent_background %}}» pour obtenir un fond transparent dans OBS. Si vous souhaitez personnaliser la transparence de l'arrière-plan, vous pouvez ajouter ce CSS dans les paramètres de la source navigateur dans OBS :
pt_br: Você pode usar a opção "{{% livechat_label transparent_background %}}" para ter um fundo transparente no OBS. Se quiser personalizar a transparência do fundo, adicione este CSS nas configurações do código-fonte do navegador do OBS:

source: In the previous CSS snippet, you can of course change the color or the transparency, by adapting the color values.
ca: Al fragment CSS anterior, per descomptat, podeu canviar el color o la transparència, adaptant els valors del color.
fr: Dans l'extrait CSS précédent, vous pouvez bien sûr changer la couleur ou la transparence, en adaptant les valeurs de couleur.
pt_br: No trecho CSS anterior, você pode, é claro, alterar a cor ou a transparência, adaptando os valores da cor.

source: Note: you can entirely customize chat colors. This is undocumented yet, but you can try this: in the modal, check «use curent theme colors», then you can try to manually change color values in the URL. You must use valid CSS color values, and they must be properly URL encoded.
ca: Nota: podeu personalitzar els colors. Encara no està documentat, però podeu provar això: a la finestra modal, marqueu «utilitza els colors del tema actuals» i, a continuació, intenteu canviar manualment els valors de color a l'URL. Heu d'utilitzar valors de color CSS vàlids i han d'estar codificats correctament a l'URL.
fr: Remarque : vous pouvez personnaliser les couleurs. Ce n'est pas encore documenté, mais vous pouvez essayer ceci : dans la fenêtre modale, cochez «utiliser les couleurs actuelles du thème», puis essayez de modifier manuellement les valeurs de couleur dans l'URL. Vous devez utiliser des valeurs de couleur CSS valides, et elles doivent être correctement encodées dans l'URL.
pt_br: Observação: você pode personalizar totalmente as cores do chat. Isso ainda não está documentado, mas você pode tentar o seguinte: no modal, marque a opção "usar cores do tema atual" e tente alterar manualmente os valores de cor na URL. Você deve usar valores de cor CSS válidos, e eles devem estar codificados corretamente na URL.

source: OBS Dock
ca: Acoblament d'OBS
fr: Dock OBS
pt_br: Doca OBS

source: This feature can be disabled by the instance's adminitrators.
ca: Aquesta funció la pot desactivar l'administració de la instància.
fr: Cette fonction peut être désactivée par les administrateur⋅rices de l'instance.
pt_br: Esse recurso pode ser desabilitado pelos administradores da instância.

source: You can use OBS "Custom browser docks" to integrate the chat in your OBS while you are streaming. The livechat plugin offers a way to create long term token that can identify you automatically to join the chat, so you don't have to enter your password in OBS.
ca: Podeu utilitzar els «acoblaments de navegador personalitzats» d'OBS per integrar el xat al vostre OBS durant l'emissió en directe. El connector de livechat ofereix la possibilitat de crear una fitxa a llarg termini que us pugui identificar automàticament per unir-vos al xat, de manera que no cal que introduïu la vostra contrasenya a OBS.
fr: Vous pouvez utiliser les "Dock internet personnalisés" d'OBS pour intégrer le tchat dans votre OBS pendant le direct. Le plugin livechat offre la possibilité de créer un jeton à long terme qui peut vous identifier automatiquement pour rejoindre le tchat, de sorte que vous n'ayez pas à entrer votre mot de passe dans OBS.
pt_br: Você pode usar os "Docks de navegador personalizados" do OBS para integrar o chat ao seu OBS durante a transmissão. O plugin de chat ao vivo oferece uma maneira de criar um token de longo prazo que pode identificá-lo automaticamente para entrar no chat, para que você não precise digitar sua senha no OBS.

source: To do so, just use the "{{% livechat_label share_chat_link %}}" feature, and open the "{{% livechat_label share_chat_dock %}}" tab. From there, you can create a new token using the "+" button.
ca: Per fer-ho només cal que utilitzeu la funció «{{% livechat_label share_chat_link %}}» i obriu la pestanya «{{% livechat_label share_chat_dock %}}». Des d'aquí podeu crear una fitxa nova amb el botó «+».
fr: Pour ce faire, il suffit d'utiliser la fonctionnalité "{{% livechat_label share_chat_link %}}" et d'ouvrir l'onglet "{{% livechat_label share_chat_dock %}}". À partir de là, vous pouvez créer un nouveau jeton en utilisant le bouton "+".
pt_br: Para isso, basta usar o recurso "{{% livechat_label share_chat_link %}}" e abrir a aba "{{% livechat_label share_chat_dock %}}". A partir daí, você pode criar um novo token usando o botão "+".

source: Then, copy the url, and use the "Docks / Custom browser docks" menu from your OBS to add a dock with this URL.
ca: A continuació copieu l'URL i utilitzeu el menú «Acoblament / Acoblaments de navegador personalitzats» del vostre OBS per afegir un acoblament amb aquest URL.
fr: Ensuite, copiez l'URL et utilisez le menu "Docks / Docks internet personnalisés" de votre OBS pour ajouter un dock avec cette URL.
pt_br: Em seguida, copie a URL e use o menu "Docks / Docks de navegador personalizados" do seu OBS para adicionar um dock com essa URL.

source: Once you have done, you will have a new dock connected to the chat with your account.
ca: Un cop fet això tindreu un nou acoblament connectat al xat amb el vostre compte.
fr: Une fois que vous l'aurez fait, vous aurez un nouveau dock connecté au tchat avec votre compte.
pt_br: Depois de fazer isso, você terá um novo dock conectado ao bate-papo com sua conta.

source: Tokens are valid to join any chat room. You don't have to generate separate tokens for each of your rooms. You can also customize the nickame that will be used by changing the `n` parameter in the url.
ca: Les fitxes són vàlides per unir-se a qualsevol sala de xat. No cal que genereu fitxes independents per a cadascuna de les vostres sales. També podeu personalitzar l'àlies que s'utilitzarà canviant el paràmetre `n` a l'URL.
fr: Les jetons sont valables pour rejoindre n'importe quel salon de discussion. Vous n'avez pas besoin de générer des tokens séparés pour chacun de vos salons. Vous pouvez également personnaliser le pseudo qui sera utilisé en changeant le paramètre `n` dans l'url.
pt_br: Tokens são válidos para entrar em qualquer sala de bate-papo. Você não precisa gerar tokens separados para cada uma das suas salas. Você também pode personalizar o apelido que será usado alterando o parâmetro `n` na URL.

source: Don't share these links to anyone, as it would allow them to connect as yourself.
ca: No compartiu aquests enllaços amb ningú, ja que els permetrien iniciar sessió en el vostre nom.
fr: Ne communiquez ces liens à personne, car ils leur permettraient de se connecter en tant que vous-même.
pt_br: Não compartilhe esses links com ninguém, pois isso permitirá que eles se conectem como se fossem você.

source: If a token is compromised, or no more needed, you can revoke them.
ca: Si una fitxa està compromesa o ja no és necessària, podeu revocar-la.
fr: Si un jeton est compromis ou n'est plus nécessaire, vous pouvez le révoquer.
pt_br: Se um token for comprometido ou não for mais necessário, você pode revogá-lo.

source: These tokens can be used for other purposes, as connecting to your account with XMPP bots or clients. This feature is not documented yet, and not officially supported. So use with care.
ca: Aquestes fitxes es poden utilitzar per a altres finalitats, com ara connectar-se al vostre compte amb bots o clients XMPP. Aquesta funció encara no està documentada i no se suporta oficialment. Per tant, s'ha d'utilitzar amb precaució.
fr: Ces jetons peuvent être utilisés à d'autres fins, comme la connexion à votre compte avec des robots ou des clients XMPP. Cette fonctionnalité n'est pas encore documentée et n'est pas officiellement supportée. Il convient donc de l'utiliser avec précaution.
pt_br: Esses tokens podem ser usados para outros fins, como conectar-se à sua conta com bots ou clientes XMPP. Este recurso ainda não está documentado e não possui suporte oficial. Portanto, use com cuidado.

source: Mixing multiple chats in your live stream
ca: Barrejar diversos xats a la vostra emissió en directe
fr: Mélanger plusieurs tchats dans votre flux en direct
pt_br: Misturando vários chats em sua transmissão ao vivo

source: You can use the [social_stream browser extension](https://github.com/steveseguin/social_stream#readme) to mix multiple chat source (from Peertube, Twitch, Youtube, Facebook, ...) and include their contents in your live stream. The compatibility with this plugin was added in recent versions.
ca: Podeu utilitzar l'[extensió del navegador social_stream](https://github.com/steveseguin/social_stream#readme) per barrejar diverses fonts de xat (Peertube, Twitch, Youtube, Facebook, etc.) i incloure el seu contingut a la vostra emissió en directe. La compatibilitat amb aquest connector s'ha afegit en les darreres versions.
fr: Vous pouvez utiliser l'extension [social_stream browser extension](https://github.com/steveseguin/social_stream#readme) pour mélanger plusieurs sources de tchat (Peertube, Twitch, Youtube, Facebook, ...) et inclure leurs contenus dans votre flux en direct. La compatibilité avec ce plugin a été ajoutée dans les versions récentes.
pt_br: Você pode usar a [extensão de navegador social_stream](https://github.com/steveseguin/social_stream#readme) para misturar várias fontes de bate-papo (do Peertube, Twitch, YouTube, Facebook, ...) e incluir seus conteúdos na sua transmissão ao vivo. A compatibilidade com este plugin foi adicionada em versões recentes.

source: Room owners and administrators can send special announcements in the chat.
ca: Administradors/es i propietaris/es de les sales poden enviar anuncis especials al xat.
pt_br: Proprietários e administradores de salas podem enviar anúncios especiais no chat.

source: Announcements
ca: Anuncis
pt_br: Anúncios

source: These messages will be more visible than standard messages.
ca: Aquests missatges seran més visibles que els missatges estàndard.
pt_br: Essas mensagens serão mais visíveis do que as mensagens padrão.

source: To send announcements, owners and administrators will have a "{{% livechat_label announcements_message_type %}}" selector on the top of the message field:
ca: Per enviar anuncis, propietaris/es i administradors/es tenen un selector «{{% livechat_label announcements_message_type %}}» a la part superior del camp del missatge:
pt_br: Para enviar anúncios, proprietários e administradores terão um seletor "{{% livechat_label announcements_message_type %}}" na parte superior do campo de mensagem:

source: There are several message types:
ca: Hi ha diversos tipus de missatges:
pt_br: Existem vários tipos de mensagens:

source: **{{% livechat_label announcements_message_type_standard %}}**: to send a standard message.
ca: **{{% livechat_label announcements_message_type_standard %}}**: per enviar un missatge estàndard.
pt_br: **{{% livechat_label announcements_message_type_standard %}}**: para enviar uma mensagem padrão.

source: **{{% livechat_label announcements_message_type_highlight %}}**: these messages will simply be highlighted in a blue box.
ca: **{{% livechat_label announcements_message_type_highlight %}}**: aquests missatges simplement es ressaltaran en un quadre blau.
pt_br: **{{% livechat_label announcements_message_type_highlight %}}**: essas mensagens serão simplesmente destacadas em uma caixa azul.

source: **{{% livechat_label announcements_message_type_announcement %}}**: these messages will be in a green box, and a bold "{{% livechat_label announcements_message_type_announcement %}}" title will be added.
ca: **{{% livechat_label announcements_message_type_announcement %}}**: aquests missatges estaran en un quadre verd i s'afegirà un títol «{{% livechat_label announcements_message_type_announcement %}}» en negreta.
pt_br: **{{% livechat_label announcements_message_type_announcement %}}**: essas mensagens estarão em uma caixa verde e um título em negrito "{{% livechat_label announcements_message_type_announcement %}}" será adicionado.

source: **{{% livechat_label announcements_message_type_warning %}}**: these messages will be in a rend box, and a bold "{{% livechat_label announcements_message_type_announcement %}}" title will be added.
ca: **{{% livechat_label announcements_message_type_warning %}}**: aquests missatges estaran en un quadre de trencament, i s'afegirà un títol «{{% livechat_label announcements_message_type_announcement %}}» en negreta.
pt_br: **{{% livechat_label announcements_message_type_warning %}}**: essas mensagens estarão em uma caixa de recorte e um título em negrito "{{% livechat_label announcements_message_type_announcement %}}" será adicionado.

source: User that are not owner or administrator of the chatroom can't send such messages.
ca: El compte que no sigui propietari/a o administrador/a de la sala de xat no pot enviar aquests missatges.
pt_br: Usuários que não são proprietários ou administradores da sala de bate-papo não podem enviar tais mensagens.

source: Note: Standards XMPP clients will display announcements as standard messages.
ca: Nota: Els clients XMPP estàndards mostraran anuncis com a missatges estàndard.
pt_br: Observação: os clientes XMPP padrão exibirão anúncios como mensagens padrão.

source: Some basics about how to setup and use the chat for your live stream
ca: Informació bàsica sobre com configurar i utilitzar el xat per a les vostres emissions en directe
fr: Quelques informations de base sur comment configurer et utiliser le tchat pour vos directs
pt_br: Algumas noções básicas sobre como configurar e usar o chat para sua transmissão ao vivo

source: Some basics
ca: Alguns conceptes bàsics
fr: Quelques basiques
pt_br: Alguns princípios básicos

source: Enabling the chat for you live streams
ca: Activar el xat per a les vostres emissions en directe
fr: Activer le tchat pour vos diffusions en direct
pt_br: Habilitando o chat para suas transmissões ao vivo

source: Instance administrators can choose to disable or enable chat in specific cases. Information in this section are only true in the default case.
ca: L'administració de la instància pot optar per desactivar o activar el xat en determinats casos específics. La informació d'aquesta secció només és aplicable en el cas predeterminat.
fr: Les administrateur⋅rices de l'instance peuvent choisir de désactiver ou activer le tchat dans certains cas spécifiques. Les informations dans cette section ne sont applicables que dans le cas par défaut.
pt_br: Os administradores de instância podem optar por desabilitar ou habilitar o chat em casos específicos. As informações nesta seção são verdadeiras apenas no caso padrão.

source: When you create or modify a Peertube live, there is a "plugin settings" tab:
ca: Quan creeu o modifiqueu un Peertube en directe hi ha una pestanya «Configuració del connector»:
fr: Quand vous créez ou modifiez un direct Peertube, il y a un onglet «paramètres du plugins» :
pt_br: Ao criar ou modificar um Peertube ao vivo, há uma aba "configurações do plugin":

source: In the "plugin settings" tab, there is a "{{% livechat_label use_chat %}}" checkbox. Just check or uncheck it to enable or disable the chat associated to your video.
ca: A la pestanya «Configuració del connector» hi ha una casella de selecció «{{% livechat_label use_chat %}}». Simplement marqueu-lo o desmarqueu-lo per activar o desactivar el xat associat al vostre vídeo.
fr: Dans l'onglet «paramètres du plugin», il y a une case à cocher «{{% livechat_label use_chat %}}». Cochez ou décochez la simplement pour activer ou désactiver le tchat associé à votre vidéo.
pt_br: Na aba "Configurações do plugin", há uma caixa de seleção "{{% livechat_label use_chat %}}". Basta marcá-la ou desmarcá-la para ativar ou desativar o bate-papo associado ao seu vídeo.
