Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: In last resort, it will use your Peertube public URI. So, any API Call will go throught your Nginx server. This could fail in some case: for example if you are in a Docker container, where the public hostname does not resolve to the correct IP. In such case, try changing the "{{% livechat_label prosody_peertube_uri_label %}}" settings, by setting `http://127.0.0.1:9000` (assuming 9000 is the port on which Peertube listen, ask your instance administrators if you don't know).
ca: Com a últim recurs, utilitzarà l'URI públic de la vostra instància. Així, les crides a l'API passaran per Nginx. Això pot fallar en alguns casos: per exemple, si esteu en un contenidor Docker per al qual el nom d'amfitrió públic no es resol a la IP correcta. En aquest cas, proveu de canviar el paràmetre «{{% livechat_label prosody_peertube_uri_label %}}», posant `http://127.0.0.1:9000` (si és el port 9000 que fa servir el vostre PeerTube, pregunteu als administradors de la vostra instància si no ho sabeu).
fr: En dernier recours, cela utilisera l'URI publique de votre instance. Donc les appels d'API passeront à traver Nginx. Cela peut échouer dans certains cas : par exemple si vous êtes dans un conteneur Docker pour lequel le hostname publique ne résoud pas sur la bonne IP. Dans ce cas, essayez de changer le paramètre "{{% livechat_label prosody_peertube_uri_label %}}", en mettant `http ://127.0.0.1 :9000` (si c'est bien le port 9000 qui est utilisé par votre Peertube, demandez aux administrateur⋅rices de votre instance si vous ne savez pas).
pt_br: Em último caso, ele usará o URI público do Peertube. Portanto, qualquer chamada de API passará pelo seu servidor Nginx. Isso pode falhar em alguns casos: por exemplo, se você estiver em um contêiner Docker, onde o nome do host público não resolve para o IP correto. Nesse caso, tente alterar as configurações de "{{% livechat_label prosody_peertube_uri_label %}}" definindo `http://127.0.0.1:9000` (assumindo que 9000 é a porta na qual o Peertube escuta, pergunte aos administradores da sua instância se você não souber).

source: This setting enable XMPP clients to connect to the built-in Prosody server. For now, this option **only allows connections from localhost clients**.
ca: Aquesta configuració permet als clients XMPP connectar-se al servidor Prosody incrustat. Actualment aquesta opció **només permet connexions de client a localhost**.
fr: Ce paramètre permet aux clients XMPP de se connecter au serveur Prosody intégré. Pour l'instant, cette option **n'autorise que les connexions des clients sur le localhost**.
pt_br: Esta configuração permite que clientes XMPP se conectem ao servidor Prosody integrado. Por enquanto, esta opção **permite conexões apenas de clientes de host local**.

source: As example, this option can allow an instance of Matterbridge (once it could use anonymous login) *on the same machine* to bridge your chat with another services like a Matrix room.
ca: Per exemple, aquesta opció pot permetre que una instància de Matterbridge (un cop pugui utilitzar una connexió anònima) *a la mateixa màquina* vinculi el vostre xat a altres serveis, com ara una sala de Matrix.
fr: Par exemple, cette option peut permettre à une instance Matterbridge (une fois qu'elle pourra utiliser une connexion anonyme) *sur la même machine* de faire le lien entre votre tchat et d'autres services tels qu'une salle Matrix.
pt_br: Por exemplo, esta opção pode permitir que uma instância do Matterbridge (que poderia usar login anônimo) *na mesma máquina* faça uma ponte entre seu bate-papo e outros serviços, como uma sala Matrix.

source: This setting enable XMPP external components to connect to the server. By default, this option **only allows connections from localhost components**. You have to change the "{{% livechat_label prosody_components_interfaces_label %}}" value to listen on other network interfaces.
ca: Aquesta configuració permet que els components XMPP externs es connectin al servidor. Per defecte, aquesta opció **només permet connexions de components a localhost**. Heu de canviar el valor del paràmetre “{{% livechat_label prosody_components_interfaces_label %}}” per escoltar a altres interfícies de xarxa.
fr: Ce paramètre permet aux composants externes XMPP de se connecter au serveur. Par défaut cette option **n'autorise que les connexions des composants sur localhost**. Vous devez changer la valeur du paramètre «{{% livechat_label prosody_components_interfaces_label %}}» pour écouter sur d'autres interfaces réseau.
pt_br: Esta configuração permite que componentes externos XMPP se conectem ao servidor. Por padrão, esta opção **permite conexões apenas de componentes do host local**. Você precisa alterar o valor "{{% livechat_label prosody_components_interfaces_label %}}" para escutar em outras interfaces de rede.

source: This feature could be used to connect bridges or bots.
ca: Aquesta funció es pot utilitzar per connectar ponts o robots.
fr: Cette fonction pourrait être utilisée pour connecter des ponts ou des robots.
pt_br: Esse recurso pode ser usado para conectar pontes ou bots.

source: More informations on Prosody external components [here](https://prosody.im/doc/components).
ca: Més informació sobre els components externs de Prosody [aquí](https://prosody.im/doc/components).
fr: Plus d'informations sur les composants externes de Prosody [ici] (https://prosody.im/doc/components).
pt_br: Mais informações sobre os componentes externos do Prosody [aqui](https://prosody.im/doc/components).

source: For more information, please check [the documentation](/peertube-plugin-livechat/documentation/admin/mod_firewall/).
ca: Per obtenir més informació, consulteu [la documentació](/peertube-plugin-livechat/ca/documentation/admin/mod_firewall/).
pt_br: Para mais informações, consulte [a documentação](/peertube-plugin-livechat/documentation/admin/mod_firewall/).

source: Plugin documentation
ca: Documentació del connector
fr: Documentation du plugin
pt_br: Documentação do plugin

source: For now, the plugin only works out of the box for x86_64 and arm64 CPU architecture. Here are some instructions for other CPU architectures.
ca: De moment, el connector només admet les arquitectures de CPU x86_64 i arm64. Si us plau, trobareu instruccions per fer-lo funcionar en altres arquitectures de CPU aquí.
fr: Pour l'instant le plugin ne supporte de base que les architectures CPU x86_64 et arm64. Veuillez trouver ici des instructions pour le faire fonctionner sur d'autres architectures CPU.
pt_br: Por enquanto, o plugin funciona apenas para arquiteturas de CPU x86_64 e arm64. Aqui estão algumas instruções para outras arquiteturas de CPU.

source: Known issues: CPU Compatibility
ca: Problemes coneguts: compatibilitat de CPU
fr: Problème connu : compatibilité CPU
pt_br: Problemas conhecidos: compatibilidade da CPU

source: The Prosody AppImage included in the plugin will only work on x86_64 and arm64 CPU. It is not compatible with other CPU architectures.
ca: L'AppImage Prosody inclòs al connector només funciona amb CPU x86_64 i arm64. No és compatible amb altres arquitectures de CPU.
fr: L'AppImage Prosody inclue dans le plugin ne fonctionne que sur des CPU x86_64 et arm64. Elle n'est pas compatible avec d'autres architectures CPU.
pt_br: O Prosody AppImage incluído no plugin funciona apenas em CPUs x86_64 e arm64. Não é compatível com outras arquiteturas de CPU.

source: To use the plugin, you will have to manually install Prosody on your server (see below).
ca: Per utilitzar el connector haureu d'instal·lar manualment Prosody al vostre servidor (vegeu més avall).
fr: Pour utiliser le plugin, vous allez devoir installer manuellement Prosody sur votre serveur (voir plus bas).
pt_br: Para usar o plugin, você terá que instalar manualmente o Prosody no seu servidor (veja abaixo).

source: Once it is done, you have to check `Use system Prosody` in the plugin settings.
ca: Un cop fet això haureu de comprovar el paràmetre `Utilitzar Prosody del sistema` del connector.
fr: Une fois cela fait, vous aurez à cocher le paramètre `Use system Prosody` du plugin.
pt_br: Uma vez feito isso, você deve marcar `Usar Prosódia do Sistema` nas configurações do plugin.

source: On non-docker Peertube installation
ca: Instal·lació diferent de Docker
fr: Installation autres que Docker
pt_br: Na instalação do Peertube não Docker

source: For standard installation, you just have to install the official `prosody` package for your linux distribution.
ca: Per a instal·lacions estàndard només heu d'instal·lar el paquet `prosody` disponible oficialment per a la vostra distribució de Linux.
fr: Pour les installations standard, vous avez juste à installer le paquet `prosody` officiellement disponible pour votre distribution linux.
pt_br: Para instalação padrão, você só precisa instalar o pacote oficial `prosody` para sua distribuição Linux.

source: For example, on Debian/Ubuntu:
ca: Per exemple, a Debian/Ubuntu:
fr: Par exemple, sur Debian/Ubuntu :
pt_br: Por exemplo, no Debian/Ubuntu:

source: You can then disable the service that starts automatically when you install Prosody (the plugin will launch a Prosody process, there is no need for the service to run). For example, on Debian/Ubuntu (and other Systemd based linux distributions):
ca: A continuació podeu desactivar el servei que s'inicïi automàticament quan instal·leu el paquet (el connector iniciarà el seu propi procés de Prosody i no necessita que el servei s'executi al servidor). Per exemple, a Debian/Ubuntu (i altres distribucions basades en Systemd):
fr: Vous pouvez alors désactiver le service qui démarre automatiquement quand vous installé le paquet (le plugin va lancer son propre processus Prosody, et n'a pas besoin que le service tourne sur le serveur). Par exemple, sur Debian/Ubuntu (et les autres distributions se basant sur Systemd) :
pt_br: Você pode então desabilitar o serviço que inicia automaticamente ao instalar o Prosody (o plugin iniciará um processo Prosody, não há necessidade de executar o serviço). Por exemplo, no Debian/Ubuntu (e outras distribuições Linux baseadas em Systemd):

source: Warning: do not disable Prosody if it is used for another service on your server, like for example Jitsi.
ca: Avís: no desactiveu Prosody si l'utilitza un altre servei del vostre servidor, per exemple, per Jitsi.
fr: Attention : ne désactivez pas Prosody s'il est utilisé par un autre service sur votre serveur, par exemple pour Jitsi.
pt_br: Aviso: não desabilite o Prosody se ele for usado para outro serviço no seu servidor, como por exemplo o Jitsi.

source: You will have to generate a Peertube image that includes Prosody in the same container that Peertube. I know this is not the standard way to do this with Docker, but keep in mind it is a temporary workaround.
ca: Haureu de generar una imatge de PeerTube que inclogui Prosody al mateix contenidor que Peertube. Sé que aquesta no és la manera estàndard de fer les coses amb Docker, però tingueu en compte que aquesta és una solució temporal.
fr: Vous allez devoir générer une image de Peertube qui inclu Prosody dans le même conteneur que Peertube. Je sais que ce n'est pas la façon de faire standard avec Docker, mais gardez en tête que ceci est une solution de contournement temporaire.
pt_br: Você precisará gerar uma imagem do Peertube que inclua o Prosody no mesmo contêiner do Peertube. Sei que essa não é a maneira padrão de fazer isso com o Docker, mas lembre-se de que é uma solução temporária.

source: To generate and use such an image, please refer to the Docker documentation. The Docker file to generate the image should be:
ca: Per generar aquesta imatge, consulteu la documentació de Docker. El fitxer Docker per generar la imatge hauria de ser:
fr: Pour générer cette image, merci de vous référer à la documentation de Docker. Le fichier Docker pour générer l'image devrait être :
pt_br: Para gerar e usar essa imagem, consulte a documentação do Docker. O arquivo Docker para gerar a imagem deve ser:

source: You have to disable `metronome` (the XMPP server provided by Yunohost), and install `prosody`.
ca: Heu de desactivar `metronome` (el servidor XMPP utilitzat per Yunohost) i instal·lar `prosody`.
fr: Vous avez à désactiver `metronome` (le serveur XMPP utilisé par Yunohost), et installer`prosody`.
pt_br: Você precisa desabilitar o `metronome` (o servidor XMPP fornecido pela Yunohost) e instalar o `prosody`.

source: This is already done by the Yunohost Peertube application, as it was required for the plugin before the v6.0.0.
ca: Això ja ho fa l'aplicació Yunohost PeerTube, ja que era un requisit previ per a les versions de connectors anteriors a la v6.0.0.
fr: Ceci est déjà fait par l'application Yunohost Peertube, étant donné que c'était un pré-requis pour les version du plugin antérieures à la v6.0.0.
pt_br: Isso já é feito pelo aplicativo Yunohost Peertube, pois era necessário para o plugin antes da versão v6.0.0.

source: But it may be removed in a near feature (to avoid drawbacks of this method). I have to discuss with Yunohost team, to decide how we can do to minimize drawbacks, and maximize compatibility.
ca: Però es pot eliminar de l'aplicació Yunohost PeerTube en un futur proper (per evitar els inconvenients d'aquest mètode). Necessito parlar amb l'equip de Yunohost per decidir la manera correcta de fer-ho per minimitzar les molèsties i maximitzar la compatibilitat.
fr: Mais il se pourrait que ce soit retiré de l'application Yunohost Peertube dans un futur proche (pour éviter les inconvénients de cette méthode). Je dois discuter avec l'équipe Yunohost, pour décider de la bonne façon de faire pour minimiser les inconvénients et maximiser la compatibilité.
pt_br: Mas pode ser removido em breve (para evitar as desvantagens deste método). Preciso discutir com a equipe da Yunohost para decidir como podemos minimizar as desvantagens e maximizar a compatibilidade.

source: Plugin peertube-plugin-livechat installation guide
ca: Instal·lació el connector peertube-plugin-livechat
fr: Installation du plugin peertube-plugin-livechat
pt_br: Guia de instalação do plugin peertube-plugin-livechat

source: Installation guide
ca: Guia d'instal·lació
fr: Documentation d'installation
pt_br: Guia de instalação

source: Before updating to a major release, please read the release notes and breaking changes list : [CHANGELOG](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md).
ca: Abans d'actualitzar el connector a una nova versió principal, llegiu les notes de la versió i la llista de possibles canvis no compatibles amb versions anteriors: [CHANGELOG](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md).
fr: Avant de mettre à jour le plugin vers une nouvelle version majeure, merci de lire les notes de version, et la liste des éventuelles modifications non rétro-compatibles : [CHANGELOG](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md).
pt_br: Antes de atualizar para uma versão principal, leia as notas de versão e a lista de alterações significativas: [CHANGELOG](https://github.com/JohnXLivingston/peertube-plugin-livechat/blob/main/CHANGELOG.md).

source: To install or update the plugin, **just use the Peertube web admin interface**.
ca: Per instal·lar o actualitzar aquest connector, **només feu servir la vostra interfície web d'administració de PeerTube**.
fr: Pour installer ou mettre à jour ce plugin, **utilisez simplement l'interface web d'administration de votre Peertube**.
pt_br: Para instalar ou atualizar o plugin, **basta usar a interface de administração web do Peertube**.

source: Here are some other more specific instructions:
ca: A continuació es mostren més instruccions:
fr: Vous trouverez ci-dessous d'autres instructions :
pt_br: Aqui estão algumas outras instruções mais específicas:

source: Some classic mistakes and workarounds.
ca: Alguns errors comuns i solucions alternatives.
fr: Quelques erreurs classiques, et solutions de contournement.
pt_br: Alguns erros clássicos e soluções alternativas.

source: I just installed/upgraded the plugin, but nothing happens
ca: Acabo d'instal·lar/actualitzar el connector, però no passa res
fr: Je viens juste d'installer/mettre-à-jour le plugin, mais rien ne se passe
pt_br: Acabei de instalar/atualizar o plugin, mas nada acontece

source: If you have just installed/upgraded the plugin, but nothing happens (no chat, no settings, buttons in the settings page does not work, ...), just try to reload the page.
ca: Si acabeu d'instal·lar/actualitzar el connector i no passa res (no hi ha xat, cap configuració, els botons no funcionen a la configuració, etc.), només heu de provar de tornar a carregar la pàgina.
fr: Si vous venez juste d'installer/mettre-à-jour le plugin, et que rien ne se passe (pas de tchat, pas de paramètres, des boutons qui ne fonctionnent pas dans les paramètres, ...), essayez juste de recharger la page.
pt_br: Se você acabou de instalar/atualizar o plugin, mas nada acontece (sem bate-papo, sem configurações, os botões na página de configurações não funcionam, ...), tente recarregar a página.

source: Diagnostic tool
ca: Eina de diagnòstic
fr: Outil de diagnostic
pt_br: Ferramenta de diagnóstico

source: If the chat does not work, there is a diagnostic tool in the plugin's settings pages.
ca: Si el xat no funciona hi ha una eina de diagnòstic a la pàgina de configuració del connector.
fr: Si le tchat ne fonctionne pas, il y a un outil de diagnostic dans la page des paramètres du plugin.
pt_br: Se o chat não funcionar, há uma ferramenta de diagnóstico nas páginas de configurações do plugin.

source: Open the plugin settings, and click on the "launch diagnostic" button.
ca: Obriu la configuració del connector i feu clic al botó «Executar diagnòstics».
fr: Ouvrez les paramètres du plugin, et cliquez sur le bouton "lancer le diagnostique".
pt_br: Abra as configurações do plugin e clique no botão "iniciar diagnóstico".

source: If there is any error in the diagnostic page, you can search in this page for a solution, or refer to the [Bug tracking documentation page](/peertube-plugin-livechat/issues/) if you can't find any response.
ca: Si hi ha un error a la pàgina de diagnòstic podeu buscar una solució en aquesta pàgina, o si no trobeu una resposta, consultar [la pàgina de documentació «desenvolupaments / errors»](/peertube-plugin -livechat/ca/issues/).
fr: S'il y a une erreur sur la page de diagnostique, vous pouvez chercher une solution sur cette page, ou si vous ne trouvez pas de réponse, vous référer à [la page de documentation «évolutions / bugs»](/peertube-plugin-livechat/fr/issues/).
pt_br: Se houver algum erro na página de diagnóstico, você pode procurar uma solução nesta página ou consultar a [Página de documentação de rastreamento de bugs](/peertube-plugin-livechat/issues/) se não encontrar nenhuma resposta.

source: Chat does not load
ca: El xat no es carrega
fr: Le tchat ne se charge pas
pt_br: O chat não carrega

source: Internal API calls
ca: Crides internes a l'API
fr: Appels d'API interne
pt_br: Chamadas de API internas

source: In such case, try changing the "{{% livechat_label prosody_peertube_uri_label %}}" settings, by setting `http://127.0.0.1:9000` (assuming 9000 is the port on which Peertube listen, ask your instance administrators if you don't know).
ca: En aqueix cas, proveu de canviar el paràmetre «{{% livechat_label prosody_peertube_uri_label %}}», posant `http://127.0.0.1:9000` (assumint és el port 9000 el que fa servir el vostre PeerTube, pregunteu als administradors de la instància si no ho sabeu).
fr: Dans ce cas, essayez de changer le paramètre "{{% livechat_label prosody_peertube_uri_label %}}", en mettant `http://127.0.0.1:9000` (si c'est bien le port 9000 qui est utilisé par votre Peertube, demandez aux administrateur⋅rices de votre instance si vous ne savez pas).
pt_br: Nesse caso, tente alterar as configurações de "{{% livechat_label prosody_peertube_uri_label %}}", definindo `http://127.0.0.1:9000` (assumindo que 9000 é a porta na qual o Peertube escuta, pergunte aos administradores da sua instância se você não souber).

source: Check the help for [this setting](/peertube-plugin-livechat/documentation/admin/settings/) for more information.
ca: Consulteu la pàgina d'ajuda [per a aquesta configuració](/peertube-plugin-livechat/ca/documentation/admin/settings).
fr: Veuillez vous référer à la page d'aide [pour ce paramètre](/peertube-plugin-livechat/fr/documentation/admin/settings).
pt_br: Verifique a ajuda para [esta configuração](/peertube-plugin-livechat/documentation/admin/settings/) para obter mais informações.

source: If everything is fine in the diagnostic tools, but chat windows remains empty: it can be a Websocket issue. Since Peertube version 5.0.0, there are some additional configuration to do on the server side. Check with the instance administrators that they did not forgot to apply changes listed in the [Peertube v5.0.0 release notes](https://github.com/Chocobozzz/PeerTube/blob/master/CHANGELOG.md#v500).
ca: Si tot està bé segons l'eina de diagnòstic, però la finestra de xat roman buida: això pot ser un problema de Websocket. Des de la versió 5.0.0 de PeerTube, hi ha una configuració addicional per fer al costat del servidor. Consulteu amb els administradors de la vostra instància si no s'han oblidat d'aplicar els canvis enumerats a les [Notes de la versió de Peertube 5.0.0](https://github.com/Chocobozzz/PeerTube/blob/master/CHANGELOG.md#v500) .
fr: Si tout est OK d'après l'outil de diagnostique, mais que la fenêtre de tchat reste vide : cela peut être un soucis Websocket. Depuis la version 5.0.0 de Peertube, il y a de la configuration supplémentaire à faire du côté du serveur. Vérifiez avec les administrateur⋅rices de votre instance s'iels n'ont pas oublié d'appliquer les changements listés dans les [notes de version 5.0.0 de Peertube](https://github.com/Chocobozzz/PeerTube/blob/master/CHANGELOG.md#v500).
pt_br: Se tudo estiver correto nas ferramentas de diagnóstico, mas as janelas de bate-papo permanecerem vazias: pode ser um problema de Websocket. Desde a versão 5.0.0 do Peertube, há algumas configurações adicionais a serem feitas no lado do servidor. Verifique com os administradores da instância se eles não se esqueceram de aplicar as alterações listadas nas [Notas de lançamento do Peertube v5.0.0](https://github.com/Chocobozzz/PeerTube/blob/master/CHANGELOG.md#v500).

source: You can confirm that it is a Websocket issue by opening your browser console, and checking for error logs talking about failed Websocket connection.
ca: Podeu confirmar si es tracta d'un problema de Websocket obrint la consola del vostre navegador i comprovant si hi ha cap registre d'errors que mencioni una connexió de Websocket fallida.
fr: Vous pouvez confirmer si c'est un problème de Websocket en ouvrant la console de votre navigateur, et en vérifiant s'il y a des journaux d'erreur mentionnant une connexion Websocket échouée.
pt_br: Você pode confirmar que é um problema de Websocket abrindo o console do navegador e verificando os logs de erros que falam sobre falha na conexão do Websocket.
