Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: There can be other settings in this tab, depending on plugins installed on your Peertube instance.
ca: Pot haver-hi altres paràmetres en aquesta pestanya, depenent dels connectors instal·lats a la vostra instància de Peertube.
fr: Il peut y avoir d'autres paramètres dans cet onglet, en fonction des plugins installés sur votre instance Peertube.
pt_br: Pode haver outras configurações nesta aba, dependendo dos plugins instalados na sua instância do Peertube.

source: Per channel chat
ca: Xat per canal
fr: Tchat par chaîne
pt_br: Bate-papo por canal

source: On the instance level, Peertube's administrators can choose if chat rooms are unique per video, or if there will be an unique chat room per channel. Please contact your instance's administrators for more information on how they configure the livechat plugin.
ca: A nivell d'instància l'administració pot triar si les sales de xat són úniques per vídeo o si seran úniques per canal. Poseu-vos en contacte amb l'administració de la vostra instància per obtenir més informació sobre com es configura el connector livechat.
fr: Au niveau de l'instance, les administrateur⋅rices peuvent choisir si les salons de discussions sont uniques par vidéo, ou s'ils vont être uniques par chaîne. Veuillez contacter les administrateur⋅rices de votre instance pour plus d'information sur la façon dont est configuré le plugin livechat.
pt_br: No nível da instância, os administradores do Peertube podem escolher se as salas de bate-papo serão exclusivas para cada vídeo ou se haverá uma sala de bate-papo exclusiva para cada canal. Entre em contato com os administradores da sua instância para obter mais informações sobre como configurar o plugin de bate-papo ao vivo.

source: Share the chat
ca: Compartir el xat
fr: Partager le tchat
pt_br: Compartilhe o bate-papo

source: On top of the chat, there is a "{{% livechat_label share_chat_link %}}" button.
ca: A sobre del xat hi ha un botó «{{% livechat_label share_chat_link %}}».
fr: Au dessus du tchat, il y a un bouton «{{% livechat_label share_chat_link %}}».
pt_br: No topo do chat, há um botão "{{% livechat_label share_chat_link %}}".

source: This button opens a popup, where you can obtain an url to join the chat. This url can be shared.
ca: Aquest botó obre una finestra emergent, on trobareu un URL per unir-vos al xat. Aquest URL es pot compartir.
fr: Ce bouton ouvre une popup, où vous trouverez une url pour rejoindre le tchat. Vous pouvez partager cette url.
pt_br: Este botão abre um pop-up, onde você pode obter uma URL para entrar no chat. Essa URL pode ser compartilhada.

source: The "{{% livechat_label share_chat_embed %}}" tab provide some links to embed the chat in websites, or in your live stream.
ca: La pestanya «{{% livechat_label share_chat_embed %}}» ofereix enllaços per incrustar el xat als llocs web o al vostre flux de vídeo en directe.
fr: L'onglet "{{% livechat_label share_chat_embed %}}" fournit des liens pour intégrer le tchat dans des sites web ou dans votre flux vidéo en direct.
pt_br: A aba "{{% livechat_label share_chat_embed %}}" fornece alguns links para incorporar o bate-papo em sites ou na sua transmissão ao vivo.

source: You can customize some options:
ca: Podeu personalitzar algunes opcions:
fr: Vous pouvez personnaliser certaines options :
pt_br: Você pode personalizar algumas opções:

source: {{% livechat_label read_only %}}: you will only be able to read the chat, not write. This is useful to include the chat content in your live stream (see the [OBS documentation](/peertube-plugin-livechat/documentation/user/obs)).
ca: {{% livechat_label read_only %}}: només podreu llegir el xat, no escriure-hi. Això és útil per incloure contingut de xat a les vostres emissions en directe (vegeu [documentació OBS](/peertube-plugin-livechat/ca/documentation/user/obs)).
fr: {{% livechat_label read_only %}} : vous ne pourrez que lire le tchat, et non y écrire. Ceci est utile pour inclure le contenu du tchat dans vos diffusions directes (voir la [documentation OBS](/peertube-plugin-livechat/documentation/user/obs)).
pt_br: {{% livechat_label read_only %}}: você só poderá ler o chat, não escrever. Isso é útil para incluir o conteúdo do chat na sua transmissão ao vivo (consulte a [documentação do OBS](/peertube-plugin-livechat/documentation/user/obs)).

source: {{% livechat_label use_current_theme_color %}}: if checked, your current theme colors will be added to the url, so that any user that opens the link will have the same color set.
ca: {{% livechat_label use_current_theme_color %}} : si està marcat, els colors del tema actual s'afegiran a l'URL, de manera que les persones que obrin aquest enllaç tindran la mateixa combinació de colors.
fr: {{% livechat_label use_current_theme_color %}} : si coché, les couleurs de votre thème courant seront ajoutés à l'url, de sorte que ls personnes ouvrant ce lien auront le même jeu de couleurs.
pt_br: {{% livechat_label use_current_theme_color %}}: se marcado, as cores do seu tema atual serão adicionadas à URL, para que qualquer usuário que abrir o link tenha o mesmo conjunto de cores.

source: {{% livechat_label generate_iframe %}}: instead of an url, you will obtain an HTML snippet that you can add to your website to embed the chat.
ca: {{% livechat_label generate_iframe %}} : en comptes d'un URL tindreu un fragment HTML que podeu afegir al vostre lloc web per incloure el xat.
fr: {{% livechat_label generate_iframe %}} : à la place d'une url, vous aurez un extrait HTML que vous pouvez ajouter à votre site web pour inclure le tchat.
pt_br: {{% livechat_label generate_iframe %}}: em vez de uma URL, você obterá um snippet HTML que pode adicionar ao seu site para incorporar o chat.

source: For more information on the "{{% livechat_label share_chat_dock %}}" tab, check the [OBS documentation](/peertube-plugin-livechat/documentation/user/obs).
ca: Per obtenir més informació sobre la pestanya «{{% livechat_label share_chat_dock %}}», consulteu la [documentació OBS](/peertube-plugin-livechat/ca/documentation/user/obs).
fr: Pour plus d'information sur l'onglet "{{% livechat_label share_chat_dock %}}", veuillez vous référer à la [documentation OBS](/peertube-plugin-livechat/fr/documentation/user/obs).
pt_br: Para mais informações sobre a aba "{{% livechat_label share_chat_dock %}}", verifique a [documentação do OBS](/peertube-plugin-livechat/documentation/user/obs).

source: In the "{{% livechat_label web %}}" tab, the provided url opens the chat in the Peertube interface. You can share this link to other users to invite them to join the chat.
ca: A la pestanya «{{% livechat_label web %}}», l'URL proporcionat obre el xat a la interfície de PeerTube. Pots compartir aquest enllaç amb altres persones per convidar-les a unir-se al xat.
fr: Dans l'onglet "{{% livechat_label web %}}", l'URL fournie ouvre le tchat dans l'interface Peertube. Vous pouvez partager ce lien avec d'autres utilisateurs pour les inviter à rejoindre le tchat.
pt_br: Na aba "{{% livechat_label web %}}", o URL fornecido abre o chat na interface do Peertube. Você pode compartilhar este link com outros usuários para convidá-los a participar do chat.

source: The "{{% livechat_label share_chat_link %}}" popup can also contain a "{{% livechat_label connect_using_xmpp %}}" tab. This will only be available if your instance's administators have enabled an correctly configured this option. Using this option, you can provide a link to join the chat using any [XMPP client software](https://en.wikipedia.org/wiki/XMPP#Clients). Using such softwares can for example facilitate moderation actions.
ca: La finestra emergent «{% livechat_label share_chat_link %}}» també pot contenir una pestanya «{{% livechat_label connect_using_xmpp %}}». Aquesta pestanya només està disponible si els administradors de la vostra instància han activat i configurat correctament aquesta opció. Amb aquesta opció podeu proporcionar un enllaç per unir-vos al canal mitjançant qualsevol [client XMPP](https://ca.wikipedia.org/wiki/Extensible_Messaging_and_Presence_Protocol#Clients). Amb l'ús d'aquest programari, serà més fàcil gestionar les accions de moderació, per exemple.
fr: La popup «{{% livechat_label share_chat_link %}}» peut également contenir un onglet «{{% livechat_label connect_using_xmpp %}}». Cet onglet n'est disponible que si les admintrateur⋅rices de votre instance ont activé et configuré correctement cette option. En utilisant cette option, vous pouvez fournir un lien permettant de rejoindre le salon en utilisant n'importe quel [client XMPP](https://fr.wikipedia.org/wiki/Clients_XMPP). En utilisant de tels logiciels, il sera par exemple plus simple de gérer les actions de modération.
pt_br: O pop-up "{{% livechat_label share_chat_link %}}" também pode conter uma aba "{{% livechat_label connect_using_xmpp %}}". Isso só estará disponível se os administradores da sua instância tiverem habilitado e configurado corretamente esta opção. Usando esta opção, você pode fornecer um link para entrar no chat usando qualquer [software cliente XMPP](https://en.wikipedia.org/wiki/XMPP#Clients). O uso desses softwares pode, por exemplo, facilitar ações de moderação.

source: Moderation
ca: Moderació
fr: Modération
pt_br: Moderação

source: Please refer to the [moderation documentation](/peertube-plugin-livechat/documentation/user/streamers/moderation).
ca: Consulteu la [documentació de moderació](/peertube-livechat-plugin/ca/documentation/user/streamers/moderation).
fr: Veuillez vous référer à la [documentation de modération](/peertube-plugin-livechat/fr/documentation/user/streamers/moderation).
pt_br: Consulte a [documentação de moderação](/peertube-plugin-livechat/documentation/user/streamers/moderation).

source: Include the chat in your video stream
ca: Incloeu diversos xats a la vostra emissió en directe
fr: Inclure plusieurs tchats dans votre flux en direct
pt_br: Inclua o bate-papo no seu fluxo de vídeo

source: Please refer to the [OBS documentation](/peertube-plugin-livechat/documentation/user/obs).
ca: Consulteu la [documentació OBS](/peertube-plugin-livechat/ca/documentation/user/obs).
fr: Veuillez vous référer à la [documentation OBS](/peertube-plugin-livechat/fr/documentation/user/obs).
pt_br: Consulte a [documentação do OBS](/peertube-plugin-livechat/documentation/user/obs).

source: Chat persistence
ca: Persistència del xat
fr: Persistance du tchat
pt_br: Persistência de bate-papo

source: By default, the chat is persistent. This means that the room content will be kept for a while. User joining will see messages posted before their arrival.
ca: Per defecte el xat és persistent. Això vol dir que el contingut de les sales es conservarà durant un temps. Les persones que s'hi uneixin podran veure els missatges enviats abans que arribessin.
fr: Par défaut, le tchat est persistant. Cela veut dire que le contenu des salons sera conservé pendant un moment. Les utilisateur⋅rices qui le rejoignent pourront voir les messages envoyés avant leur arrivée.
pt_br: Por padrão, o chat é persistente. Isso significa que o conteúdo da sala será mantido por um tempo. Os usuários que entrarem verão as mensagens publicadas antes de entrarem.

source: You can change the persistence behaviour. [Open the chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers), and click on "Configure".
ca: Podeu canviar el comportament de persistència. [Obriu el menú desplegable](/peertube-plugin-livechat/ca/documentation/user/viewers) i feu clic a «Configurar».
fr: Vous pouvez changer le comportement de la persistance. [Ouvrez le menu déroulant](/peertube-plugin-livechat/fr/documentation/user/viewers), et cliquez sur «Configurer».
pt_br: Você pode alterar o comportamento de persistência. [Abra o menu suspenso do bate-papo](/peertube-plugin-livechat/documentation/user/viewers) e clique em "Configurar".

source: There are several options that can be changed.
ca: Hi ha diverses opcions que es poden canviar.
fr: Il y a plusieurs options qui peuvent être changées.
pt_br: Há várias opções que podem ser alteradas.

source: You can for example set the default and maximum number of messages to return to 0, so that new incomers won't see any previously sent message.
ca: Per exemple, podeu establir el valor predeterminat i el valor màxim del nombre de missatges per tornar a 0. D'aquesta manera les persones que s'incorporin a la sala no podran veure els missatges enviats anteriorment.
fr: Vous pouvez par exemple définir la valeur par défaut, et la valeur maximum du nombre de messages à retourner à 0. Ainsi les personnes rejoignant le salon ne pourront voir les messages envoyés précédemment.
pt_br: Você pode, por exemplo, definir o número padrão e máximo de mensagens para retornar a 0, para que novos usuários não vejam nenhuma mensagem enviada anteriormente.

source: You can also uncheck "enable archiving": if unchecked, messages will be pruned if the server restarts.
ca: També podeu desmarcar «habilitar l'arxiu»: si no està marcat, els missatges es netejaran si el servidor es reinicia.
fr: Vous pouvez aussi décocher «activer l'archivage» : si décoché, les messages seront nettoyés si le serveur redémarre.
pt_br: Você também pode desmarcar "Habilitar arquivamento": se desmarcado, as mensagens serão removidas se o servidor for reiniciado.

source: By unchecking "Persistent", the room will be cleared if there is no more participant.
ca: Si desactiveu «Persistent» la sala se suprimirà quan no hi hagi més participants.
fr: En décochant «Persistant», le salon sera effacé quand il n'y aura plus de participant⋅es.
pt_br: Ao desmarcar "Persistente", a sala será limpa se não houver mais participantes.

source: Delete the chat content
ca: Destruir el contingut del xat
fr: Détruire le contenu du tchat
pt_br: Excluir o conteúdo do bate-papo

source: If you want to delete the chat content, [open the chat dropdown menu](/peertube-plugin-livechat/documentation/user/viewers), then click on "Destroy". A popup will open, asking a confirmation.
ca: Si voleu destruir el contingut del xat, [obriu el menú desplegable](/peertube-plugin-livechat/ca/documentation/user/viewers) i feu clic a «Destruir». S'obrirà una finestra emergent que demana confirmació.
fr: Si vous voulez détruire le contenu du tchat, [ouvrez le menu déroulant](/peertube-plugin-livechat/fr/documentation/user/viewers), et cliquez sur «Détruire». Une popup va s'ouvrir, demandant confirmation.
pt_br: Se quiser excluir o conteúdo do chat, [abra o menu suspenso do chat](/peertube-plugin-livechat/documentation/user/viewers) e clique em "Destruir". Um pop-up será aberto, solicitando confirmação.

source: The chat will be automatically recreated each time someone tries to join it as long as the video exists, and has the "{{% livechat_label use_chat %}}" feature activated.
ca: El xat es recrearà automàticament cada vegada que algú intenti unir-s'hi, sempre que el vídeo existeixi i tingui activada la configuració «{{% livechat_label use_chat %}}».
fr: Le tchat sera automatiquement recréé à chaque fois que quelqu'un essayera de le rejoindre, tant que la vidéo existe et qu'elle a le paramètre «{{% livechat_label use_chat %}}» activé.
pt_br: O bate-papo será recriado automaticamente sempre que alguém tentar entrar, desde que o vídeo exista e tenha o recurso "{{% livechat_label use_chat %}}" ativado.

source: The bot can respond to several commands.
ca: El bot pot respondre a diferents ordres.
fr: Le bot peut répondre à différentes commandes.
pt_br: O bot pode responder a vários comandos.

source: Commands
ca: Ordres
fr: Commandes
pt_br: Comandos

source: You can setup several commands.
ca: Podeu configurar diferents ordres.
fr: Vous pouvez paramétrer différentes commandes.
pt_br: Você pode configurar vários comandos.

source: The bot can automatically moderate messages containing forbidden words.
ca: El bot pot moderar automàticament els missatges que contenen mots prohibits.
fr: Le bot peut automatiquement modérer les messages contenant des mots interdits.
pt_br: O bot pode moderar automaticamente mensagens contendo palavras proibidas.

source: Forbidden words
ca: Mots prohibits
fr: Mots interdits
pt_br: Palavras proibidas

source: You can for example fill this field with a swear words list.
ca: Per exemple, podeu omplir aquest camp amb una llista d'insults.
fr: Vous pouvez par exemple remplir ce champs avec une liste d'insultes.
pt_br: Você pode, por exemplo, preencher este campo com uma lista de palavrões.

source: To get some examples, please check these [forbidden words suggestions](https://framagit.org/Livingston/peertube-plugin-livechat/-/tree/main/support/forbidden_words).
ca: Per obtenir alguns exemples, consulteu [suggeriments de paraules prohibides](https://framagit.org/Livingston/peertube-plugin-livechat/-/tree/main/support/forbidden_words).
fr: Pour avoir quelques exemples, merci de vous référer aux [suggestions de mots interdits](https://framagit.org/Livingston/peertube-plugin-livechat/-/tree/main/support/forbidden_words).
pt_br: Para obter alguns exemplos, verifique estas [sugestões de palavras proibidas](https://framagit.org/Livingston/peertube-plugin-livechat/-/tree/main/support/forbidden_words).

source: If you have some usefull words lists, you are welcome to contribute to this suggestion page. There are in the `support/forbidden_words` folder of the livechat source code. See the [contribution guide](/peertube-plugin-livechat/contributing/) for more information.
ca: Si teniu llistes de mots útils podeu contribuir a aquesta pàgina de suggeriments. Es troben a la carpeta `support/forbidden_words` del codi font. Consulteu la [guia de contribució](/peertube-livechat-plugin/ca/contributing/) per obtenir més informació.
fr: Si vous avez des listes de mots utiles, vous êtes les bienvenu⋅es pour contribuer à cette page de suggestion. Elles sont dans le dossier `support/forbidden_words` du code source. Veuillez vous référer au [guide de contribution](/peertube-plugin-livechat/fr/contributing/) pour plus d'informations.
pt_br: Se você tiver alguma lista de palavras úteis, sinta-se à vontade para contribuir com esta página de sugestões. Elas estão na pasta `support/forbidden_words` do código-fonte do chat ao vivo. Consulte o [guia de contribuição](/peertube-plugin-livechat/contributing/) para obter mais informações.

source: These words are case insensitive.
ca: Aquests mots no distingeixen entre majúscules i minúscules.
fr: Ces mots ne sont pas sensibles à la casse.
pt_br: Essas palavras não diferenciam maiúsculas de minúsculas.

source: You can combine a short [moderation delay](/peertube-plugin-livechat/documentation/user/streamers/moderation_delay) (1 second for example) with the [moderation bot](/peertube-plugin-livechat/documentation/user/streamers/bot) to delete messages containing swear words before any non-moderator user will see them.
ca: Podeu combinar un [retard de moderació](/peertube-plugin-livechat/ca/documentation/user/streamers/moderation_delay) breu (1 segon per exemple) amb el [bot de moderació](/peertube-plugin-livechat/ca/documentation/user/streamers/bot) per eliminar les publicacions que contenen insults abans que fins i tot un usuari que no sigui moderador les vegi.
fr: Vous pouvez combiner un [délai de modération](/peertube-plugin-livechat/fr/documentation/user/streamers/moderation_delay) court (1 seconde par exemple) avec le [bot dé modération](/peertube-plugin-livechat/fr/documentation/user/streamers/bot) pour supprimer les messages contenant des gros mots avant même qu'un⋅e utilisateur⋅rice non-modérateur⋅rice ne les voie.
pt_br: Você pode combinar um curto [atraso de moderação](/peertube-plugin-livechat/documentation/user/streamers/moderation_delay) (1 segundo, por exemplo) com o [bot de moderação](/peertube-plugin-livechat/documentation/user/streamers/bot) para excluir mensagens contendo palavrões antes que qualquer usuário não moderador as veja.

source: This features is still experimental. There might be some issues with non-latin alphabets. You can [open an issue](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) to report your problems.
ca: Aquesta característica encara és experimental. Pot ser que hi hagi problemes amb els alfabets no llatins. Si és així podeu [obrir un tiquet](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) per informar del vostre problema.
fr: Cette fonction est encore expérimentale. Il pourrait y avoir quelques problèmes avec les alphabets non-latin. Si c'est le cas, vous pouvez [ouvrir un ticket](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) pour signaler votre problème.
pt_br: Este recurso ainda é experimental. Pode haver alguns problemas com alfabetos não latinos. Você pode [abrir um problema](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) para relatar seus problemas.

source: By checking this option, each line of the "{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}" field will be considered as a [regular expression](https://en.wikipedia.org/wiki/Regular_expression).
ca: En marcar aquesta opció cada línia del camp «{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}» es considerarà com una [expressió regular](https://ca.wikipedia.org/wiki/Expressi%C3%B3_regular).
fr: En cochant cette option, chaque ligne du champs «{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}» sera considéré comme une [expression régulière](https://fr.wikipedia.org/wiki/Expression_r%C3%A9guli%C3%A8re).
pt_br: Ao marcar esta opção, cada linha do campo "{{% livechat_label livechat_configuration_channel_forbidden_words_label %}}" será considerada como uma [expressão regular](https://en.wikipedia.org/wiki/Regular_expression).

source: Chat bot setup
ca: Configuració del bot de xat
fr: Configuration du bot de tchat
pt_br: Configuração do bot de bate-papo

source: Chat bot
ca: Bot de xat
fr: Bot de tchat
pt_br: Bot de bate-papo

source: This feature comes with the livechat plugin version 8.0.0, and can be disabled by your instance's admins.
ca: Aquesta funció s'inclou a la versió 8.0.0 del connector de livechat i l'administració de la instància la pot desactivar.
fr: Cette fonctionnalité arrive avec le plugin livechat version 8.0.0, et peut être désactivée par les admins de votre instance.
pt_br: Este recurso vem com o plugin LiveChat versão 8.0.0 e pode ser desabilitado pelos administradores da sua instância.

source: You can enable a chat bot on your chatrooms. The bot configuration is made channel per channel, and will apply to all related videos' chatrooms.
ca: Podeu activar un bot de xat a les vostres sales. La configuració del bot es fa canal per canal i s'aplica a les sales de tots els vídeos d'aquests canals.
fr: Vous pouvez activer un bot de tchat dans vos salons. La configuration du bot se fait chaîne par chaîne, et s'applique aux salons de toutes les vidéos de celles-ci.
pt_br: Você pode habilitar um bot de bate-papo em suas salas de bate-papo. A configuração do bot é feita canal por canal e será aplicada a todas as salas de bate-papo com vídeos relacionados.

source: To access this page, check the [channel configuration documentation](/peertube-plugin-livechat/documentation/user/streamers/channel).
ca: Per accedir a aquesta pàgina consulteu la [documentació de configuració del canal](/peertube-livechat-plugin/ca/documentation/user/streamers/channel).
fr: Pour accéder à cette page, veuillez vous référer à la [documentation sur la configuration des chaînes](/peertube-plugin-livechat/fr/documentation/user/streamers/channel).
pt_br: Para acessar esta página, verifique a [documentação de configuração do canal](/peertube-plugin-livechat/documentation/user/streamers/channel).
