Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Integrate the chat in your live stream
fr: Intégrer le tchat dans vos directs
pt_br: Integre o chat na sua transmissão ao vivo

source: When using software as [OBS](https://obsproject.com) for you live stream, you can embed the chat in the video stream. This is for example useful for replays.
fr: Lorsque vous utilisez un logiciel tel que [OBS](https://obsproject.com) pour votre diffusion en direct, vous pouvez intégrer le tchat dans le flux vidéo. C'est par exemple utile pour les rediffusions.
pt_br: Ao usar o software [OBS](https://obsproject.com) para sua transmissão ao vivo, você pode incorporar o bate-papo na transmissão de vídeo. Isso é útil, por exemplo, para replays.

source: In the following screenshot, you can see a live replay, where the chat content is embeded on bottom of the video:
fr: Dans la capture d'écran suivante, vous pouvez voir une rediffusion de direct où le contenu du tchat est inclus dans le bas de la vidéo :
pt_br: Na captura de tela a seguir, você pode ver uma repetição ao vivo, onde o conteúdo do bate-papo está incorporado na parte inferior do vídeo:

source: In the following screenshot, you can see an OBS setup, where the chat is included as a source in the current scene (background color can be changed, and can be transparent):
fr: Dans la capture d'écran suivante, vous pouvez voir une configuration OBS, où le chat est inclus en tant que source dans la scène actuelle (la couleur de fond peut être modifiée et peut être transparente) :
pt_br: Na captura de tela a seguir, você pode ver uma configuração do OBS, onde o bate-papo é incluído como uma fonte na cena atual (a cor de fundo pode ser alterada e pode ser transparente):

source: Other usages
fr: Autres usages
pt_br: Outros usos

source: By default, each streamer will be able to activate/deactivate the chat for their live streams.
fr: Par défaut, chaque streameur⋅euse peut activer/désactiver le tchat pour leurs directs.
pt_br: Por padrão, cada streamer poderá ativar/desativar o chat para suas transmissões ao vivo.

source: But on the instance level, administrators can choose to activate the chat for all videos (live and/or VOD).
fr: Mais au niveau de l'instance, les administrateur⋅rices peuvent choisir d'activer le tchat pour toutes les vidéos (directs et/ou vidéo à la demande).
pt_br: Mas no nível da instância, os administradores podem optar por ativar o chat para todos os vídeos (ao vivo e/ou VOD).

source: You can even activate the chat for specific VOD videos. This is how the [demo](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae) page works: it is not a live stream, but I have activated the chat specifically for this video.
fr: Vous pouvez également activer le tchat pour des vidéos à la demande spécifiques. C'est comme cela que fonctionne la page de [démo](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae) : ce n'est pas un direct, mais j'ai activé le tchat spécifiquement pour cette vidéo.
pt_br: Você pode até ativar o chat para vídeos VOD específicos. É assim que a página [demo](https://www.yiny.org/w/399a8d13-d4cf-4ef2-b843-98530a8ccbae) funciona: não é uma transmissão ao vivo, mas ativei o chat especificamente para este vídeo.

source: Bug tracking / New features requests
fr: Évolutions / suivi des bugs
pt_br: Rastreamento de bugs / Solicitações de novos recursos

source: If you have new feature requests, bugs, or difficulties to setup the plugin, you can use the [Github issue tracker](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues). If possible, try using english or french.
fr: Si vous avez des demandes de nouvelles fonctionnalités, des bugs, ou des difficultés à installer et utiliser le plugin, vous pouvez utiliser l'outils [Github issue tracker](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues). Si possible, merci d'y écrire en anglais ; mais le français sera accepté.
pt_br: Se você tiver novas solicitações de recursos, bugs ou dificuldades para configurar o plugin, pode usar o [Rastreador de problemas do GitHub](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues). Se possível, tente usar inglês ou francês.

source: To have a glimpse to the roadmap for upcoming features, please refer to:
fr: Pour avoir un aperçu de la feuille de routes pour les fonctionnalités à venir, vous pouvez vous référer à :
pt_br: Para ter uma ideia do roteiro dos próximos recursos, consulte:

source: this [github project](https://github.com/users/JohnXLivingston/projects/1).
fr: ce [projet github](https://github.com/users/JohnXLivingston/projects/1).
pt_br: este [projeto github](https://github.com/users/JohnXLivingston/projects/1).

source: the [milestones on github](https://github.com/JohnXLivingston/peertube-plugin-livechat/milestones).
fr: les [jalons sur github](https://github.com/JohnXLivingston/peertube-plugin-livechat/milestones).
pt_br: os [marcos no github](https://github.com/JohnXLivingston/peertube-plugin-livechat/milestones).

source: If you are a webdesigner or a ConverseJS/Prosody/XMPP expert, and want to help improve this plugin, you are welcome.
fr: Si vous êtes webdesigner ou avez une expertise en ConverseJS/Prosody/XMPP et souhaitez participer à l'évolution de ce plugin, n'hésitez pas à me contacter.
pt_br: Se você é um webdesigner ou especialista em ConverseJS/Prosody/XMPP e quer ajudar a melhorar este plugin, seja bem-vindo.

source: ESBuild vs Typescript
fr: ESBuild versus Typescript

source: To do so, make sure you have `po4a` (version >= 0.69) installed on your computer.
ca: Per fer-ho, assegureu-vos que teniu instal·lat `po4a` (versió >= 0.69) al vostre ordinador.
fr: Pour cela, assurez vous d'avoir `po4a` (version >= 0.69) installé sur votre ordinateur.

source: Thanks to David Revoy for his work on Peertube's mascot, [Sepia](https://www.davidrevoy.com/index.php?tag/peertube). The character design is under CC-By licence, and the SVG files used to create some logo and avatars in this plugin are GPLv3.0. PNG files are under CC-By licences, and comes from the [online Sepia Avatar Generator](https://www.peppercarrot.com/extras/html/2023_peertube-generator/).
ca: Gràcies a David Revoy pel seu treball a la mascota de Peertube, [Sepia](https://www.davidrevoy.com/index.php?tag/peertube). El disseny del personatge està sota llicència CC-By i els fitxers SVG utilitzats per crear alguns logotips i avatars en aquest connector són GPLv3.0. Els fitxers PNG estan sota llicències CC-By i provenen del [generador d'avatars Sepia en línia](https://www.peppercarrot.com/extras/html/2023_peertube-generator/).
fr: Merci à David Revoy pour son travail sur la mascotte de Peertube, [Sepia](https://www.davidrevoy.com/index.php?tag/peertube). Le design est en licence CC-By, et les fichiers SVG utilisés pour créer certains logos et avatars en GPLv3.0.

source: On livechat versions >= 10.1.0 a new option call `Client to server network interfaces` was added to allow changing this.
ca: A les versions de livechat >= 10.1.0, s'ha afegit una nova crida d'opció «interfícies de client a servidor» per permetre que això es pugui canviar.
fr: Sur les versions de livechat >= 10.1.0, un nouvel appel d'option `interfaces client vers serveur` a été ajouté pour permettre de changer cela.

source: Firewall
ca: Tallafoc
fr: Pare-feu

source: ![Screenshot of a Peertube video page, with a chat on the right. At the bottom of the chat, there is a "{{% livechat_label login_using_external_account %}}" button.](/peertube-plugin-livechat/images/external_login_button.png?classes=shadow,border&height=200px "{{% livechat_label login_using_external_account %}} button")
ca: ![Captura de pantalla d'una pàgina de vídeo de PeerTube, amb un xat a la dreta. A la part inferior del xat, hi ha un botó "{{% livechat_label login_using_external_account %}}".](/peertube-plugin-livechat/images/external_login_button.png?classes=shadow,border&height=200px "{{% livechat_label login_account_external_using %}}")
fr: livechat_label: login_using_external_account: "Se connecter avec un compte externe"

source: This feature is still experimental. This feature is available with the plugin version >= 9.0.0.
ca: Aquesta característica encara és experimental. Aquesta funció arriba amb la versió de livechat >= 9.0.0.
fr: Cette fonctionnalité est encore expérimentale. Cette fonctionnalité arrive avec le plugin livechat version >= 9.0.0.

source: For more information on this feature, check the documentation for [channel's terms & conditions](/peertube-plugin-livechat/documentation/user/streamers/terms).
ca: Per obtenir més informació sobre aquesta funció, consulteu la documentació [condicions d'ús del canal](/peertube-plugin-livechat/ca/documentation/user/streamers/terms).
fr: Pour plus d'informations sur cette fonctionnalité, veuillez vous référer à la documentation des [conditions d'utilisations de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/terms).

source: If this setting is left empty, and you are using Peertube >= 5.1 or later, the plugin will use values from your Peertube configuration file to guess on which interface and port request have to be done.
ca: Si aquest paràmetre es deixa buit i utilitzeu PeerTube >= 5.1, el connector utilitzarà els valors del vostre fitxer de configuració de PeerTube per determinar en quina interfície i port s'han de fer les sol·licituds.
fr: Si ce paramètre est laissé vide, et que vous utilisez Peertube >= 5.1, le plugin va utiliser les valeurs de votre fichier de configuration Peertube pour devenir sur quelle interface et quel port les requêtes doivent être faites.

source: Note: the plugin requires Prosody >= 0.12.0. If you are using an older version, Chat Federation could be broken, and it could have some unexpected behaviour.
ca: Nota: la versió de Prosody hade ser superior o igual a 0.12.0. Si utilitzeu una versió anterior, pot haver-hi errors a la federació de xat i altres comportaments inesperats.
fr: Note : la version de Prosody devrait être supérieure ou égale à 0.12.0. Si vous utilisez une version plus ancienne, il pourrait y avoir des bugs sur la fédération du tchat, et d'autres comportements inattendus.

source: In some case (like for some Docker Peertube installation), the diagnostic tools displays an error for the test called "API Prosody -> Peertube is KO".
ca: En alguns casos (com les instal·lacions de PeerTube a Docker), l'eina de diagnòstic mostra un error anomenat «API Prosody -> PeerTube està KO».
fr: Dans certains cas (comme par exemple les installation Peertube sous Docker), l'outil de diagnostique affiche une erreur appelée "API Prosody Peertube is KO".

source: [{{% livechat_label livechat_configuration_channel_terms_label %}}](/peertube-plugin-livechat/documentation/user/streamers/terms)
ca: [{{% livechat_label livechat_configuration_channel_terms_label %}}](/peertube-plugin-livechat/ca/documentation/user/streamers/terms)
fr: [{{% livechat_label livechat_configuration_channel_terms_label %}}](/peertube-plugin-livechat/fr/documentation/user/streamers/terms)

source: This page describes the behaviour of livechat versions >= 10.0.0. There were some changes in the way we manage access rights for Peertube administrators and moderators.
fr: Cette page décrit le comportement des versions de livechat >= 10.0.0. Il y a eu quelques changements dans la façon dont nous gérons les droits d'accès pour les administrateur⋅rices et modérateur⋅rices de Peertube.

source: You can sort tasks, or move tasks from one list to another, simply using drag & drop.
fr: Vous pouvez trier les tâches ou les déplacer d'une liste à l'autre par simple "glisser-déposer".

source: Configure channel's chat terms & conditions
fr: Configurer les conditions d'utilisation des tchats de la chaîne

source: Terms & conditions
fr: Conditions d'utilisation

source: You can add terms & conditions to your channel. These terms will be shown to all users joining the chat.
fr: Vous pouvez ajouter des conditions d'utilisation à votre chaîne. Ces conditions seront affichées à tous les utilisateur⋅rices qui rejoignent le tchat.

source: To configure the terms & conditions, go to the [channel configuration page](/peertube-plugin-livechat/documentation/user/streamers/channel):
fr: Pour configurer les conditions d'utilisation, veuillez vous rendre sur [la page de configuration de la chaîne](/peertube-plugin-livechat/fr/documentation/user/streamers/channel) :

source: Peertube instance's admin can also set global terms & conditions. If so, these terms will be shown above your channel's terms.
fr: L'administrateur⋅rice de l'instance Peertube peut également définir des conditions générales. Si c'est le cas, ces conditions seront affichées au-dessus de celles de votre chaîne.

source: Anonymous users will only see the terms & conditions once they have chosen their nickname (in other words: once they are able to talk).
fr: Les utilisateur⋅rices anonymes ne verront les conditions d'utilisation qu'une fois qu'iels auront choisi leur pseudonyme (en d'autres termes : une fois qu'iels seront en mesure de parler).

source: Users can hide the terms & conditions. When doing so, terms won't be shown again, unless you change the content.
fr: Les utilisateur⋅rices peuvent masquer les conditions d'utilisation. Dans ce cas, les conditions ne s'afficheront plus, sauf si vous en modifiez le contenu.

source: ![Screenshot of Peertube plugins admin page. The search fields contains "livechat", and the search results show the livechat plugin.](/peertube-plugin-livechat/images/installation.png?classes=shadow,border&height=200px "Livechat installation")
fr: ![Capture d'écran de la page d'administration du plugin Peertube. Le champs de recherche contient "livechat", and les résultats de la recherche montrent le plugin livechat.](/peertube-plugin-livechat/images/installation.png?classes=shadow,border&height=200px "Installation livechat")

source: Bug tracking & new features
fr: Évolutions / Bugs

source: 127.0.0.1 anon.example.org room.example.org
ca: 127.0.0.1 anon.exemple.cat room.exemple.cat

source: [xmpp.mypeertube] Anonymous=true Server="anon.example.org:52822" Muc="room.example.org" Nick="Matterbridge" RemoteNickFormat="[{PROTOCOL}] <{NICK}> " NoTLS=true
ca: [xmpp.elmeupeertube] Anonymous=true Server="anon.exemple.cat:52822" Muc="room.exemple.cat" Nick="Matterbridge" RemoteNickFormat="[{PROTOCOL}] <{NICK}> " NoTLS=true

source: #!/bin/sh /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl \ --root \ --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua \ cert import \ room.your_instance.tld your_instance.tld /etc/letsencrypt/live
ca: #!/bin/sh /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosodyAppImage/squashfs-root/AppRun prosodyctl \ --root \ --config /var/www/peertube/storage/plugins/data/peertube-plugin-livechat/prosody/prosody.cfg.lua \ cert import \ room.exemple.cat exemple.cat /etc/letsencrypt/live

source: ![Screenshot of a dialog with an "OpenID Connect" button.](/peertube-plugin-livechat/images/external_login_dialog_oidc.png?classes=shadow,border&height=200px "External login dialog - OpenID Connect")
ca: ![Captura de pantalla d'un diàleg amb un botó "OpenID Connect".](/peertube-plugin-livechat/images/external_login_dialog_oidc.png?classes=shadow,border&height=200px "Diàleg d'inici de sessió extern - OpenID Connect")

source: ![Screenshot of the "{{% livechat_label prosody_firewall_configuration %}}" form.](/peertube-plugin-livechat/images/mod_firewall.png?classes=shadow,border&height=400px "{{% livechat_label prosody_firewall_configuration %}}")
ca: ![Captura de pantalla del formulari "{{% livechat_label prosody_firewall_configuration %}}".](/peertube-plugin-livechat/images/mod_firewall.png?classes=shadow,border&height=400px "{{% livechat_label prosody_firewall %}}_configuration")

source: ![Sepia avatar example](/peertube-plugin-livechat/images/avatar_sepia.png?classes=shadow,border&height=40px "Sepia")
ca: ![Exemple d'avatar sèpia](/peertube-plugin-livechat/images/avatar_sepia.png?classes=shadow,border&height=40px "Sepia")

source: ![Cats avatar example](/peertube-plugin-livechat/images/avatar_cat.png?classes=shadow,border&height=40px "Cats")
ca: ![Exemple d'avatar de gats](/peertube-plugin-livechat/images/avatar_cat.png?classes=shadow,border&height=40px "Gats")

source: ![Birds avatar example](/peertube-plugin-livechat/images/avatar_bird.png?classes=shadow,border&height=40px "Birds")
ca: ![Exemple d'avatar d'ocells](/peertube-plugin-livechat/images/avatar_bird.png?classes=shadow,border&height=40px "Ocells")

source: ![Fenecs avatar example](/peertube-plugin-livechat/images/avatar_fenec.png?classes=shadow,border&height=40px "Fenecs")
ca: ![Exemple d'avatar de fenecs](/peertube-plugin-livechat/images/avatar_fenec.png?classes=shadow,border&height=40px "Fenecs")

source: ![Abstracts avatar example](/peertube-plugin-livechat/images/avatar_abstract.png?classes=shadow,border&height=40px "Abtracts")
ca: ![Exemple d'avatar abstracte](/peertube-plugin-livechat/images/avatar_abstract.png?classes=shadow,border&height=40px "Abstracte")

source: ![Legacy avatar example](/peertube-plugin-livechat/images/avatar_legacy.jpg?classes=shadow,border&height=40px "Legacy")
ca: ![Exemple d'avatar Legacy](/peertube-plugin-livechat/images/avatar_legacy.jpg?classes=shadow,border&height=40px "Legacy")

source: ![Screenshot of the plugin's settings page, with a "launch diagnostic" button.](/peertube-plugin-livechat/images/launch_diagnostic.png?classes=shadow,border&height=200px "Launch diagnostic")
ca: ![Captura de pantalla de la pàgina de configuració del connector, amb un botó de "diagnòstic d'inici".](/peertube-plugin-livechat/images/launch_diagnostic.png?classes=shadow,border&height=200px "Executar diagnòstic")

source: ![Screenshot of the diagnostic result page. This gives a lot of information, with status for different test suites.](/peertube-plugin-livechat/images/diagnostic.png?classes=shadow,border&height=200px "Diagnostic result")
ca: ![Captura de pantalla de la pàgina de resultats del diagnòstic. Això proporciona molta informació, amb l'estat de diferents conjunts de proves.](/peertube-plugin-livechat/images/diagnostic.png?classes=shadow,border&height=200px "Resultat del diagnòstic")

source: ![Screenshot of a Peertube live, replay, with the chat included at the bottom of the video stream.](/peertube-plugin-livechat/images/embed_chat_in_livestream.png?classes=shadow,border&height=200px "Embeding the chat in a live stream")
ca: ![Captura de pantalla d'un Peertube en directe, reproducció, amb el xat inclòs a la part inferior del flux de vídeo.](/peertube-plugin-livechat/images/embed_chat_in_livestream.png?classes=shadow,border&height=200px "Incrustar el xat en una emissió en directe")

source: ![Screenshot of the "{{% livechat_label share_chat_link %}}" dialog, where the "{{% livechat_label read_only %}}" option is checked.](/peertube-plugin-livechat/images/share_readonly.png?classes=shadow,border&height=200px "Share link popup")
ca: ![Captura de pantalla del diàleg "{{% livechat_label share_chat_link %}}", on l'opció "{{% livechat_label read_only %}}" està marcada.](/peertube-plugin-livechat/images/share_readonly.png?classes=shadow,border&height=200px "Finestra emergent de compartir l'enllaç")

source: ![Screenshot of the OBS software, where the chat was added as web browser source.](/peertube-plugin-livechat/images/embed_chat_in_obs.png?classes=shadow,border&height=200px "Embeding the chat in OBS")
ca: ![Captura de pantalla del programari OBS, on el xat s'ha afegit com a font del navegador web.](/peertube-plugin-livechat/images/embed_chat_in_obs.png?classes=shadow,border&height=200px "Incrustació del xat a OBS")

source: ![Screenshot of the "{{% livechat_label share_chat_link %}}" dialog, on the "{{% livechat_label share_chat_dock %}} tab. A token was generated, and is selectionable."](/peertube-plugin-livechat/images/share_dock.png?classes=shadow,border&height=200px "Share link popup - dock tab")
ca: ![Captura de pantalla del diàleg "{{% livechat_label share_chat_link %}}", a la pestanya "{{% livechat_label share_chat_dock %}}. S'ha generat una fitxa i es pot seleccionar."](/peertube-plugin-livechat/images/share_dock.png?classes=shadow,border&height=200px "Finestra emergent de compartir enllaç - pestanya d'acoblaments")

source: ![Screenshot of the OBS Dock menu, with a "Custom Browser Docks" entry.](/peertube-plugin-livechat/images/obs_dock_menu.png?classes=shadow,border&height=200px "OBS - Dock menu")
ca: ![Captura de pantalla del menú Passis OBS, amb una entrada "Acoblaments de navegador personalitzats".](/peertube-plugin-livechat/images/obs_dock_menu.png?classes=shadow,border&height=200px "OBS - Menú acoblament")

source: ![Screenshot of the OBS Custom Browser Docks dialog, with a new dock called "My chat".](/peertube-plugin-livechat/images/obs_dock_dialog.png?classes=shadow,border&height=200px "OBS - Dock dialog")
ca: ![Captura de pantalla del diàleg OBS Acoblaments de navegador personalitzats, amb un nou acoblament anomenat "El meu xat".](/peertube-plugin-live chat/images/obs dock dialog.png?classes=shadow,border height=200px "OBS - Diàleg d'acoblaments")

source: ![Screenshot of OBS with a new dock including the chat. The user is logged in with their Peertube account, and can chat directly from OBS.](/peertube-plugin-livechat/images/obs_dock.png?classes=shadow,border&height=200px "OBS - Dock")
ca: ![Captura de pantalla d'OBS amb un nou acoblament inclòs el xat. La persona ha iniciat sessió amb el seu compte de Peertube i pot xatejar directament des d'OBS.](/peertube-plugin-livechat/images/obs_dock.png?classes=shadow,border&height=200px "OBS - Acoblament")

source: ![Screenshot of a chat session. On top of the message field, there is a "{{% livechat_label announcements_message_type %}}" selector. In the chat, we can see three types of announcements: a highlighted message, an announcement, and a warning. Each of these announcements have a special color to distinguish them. The announcement and the warning have also bold titles.](/peertube-plugin-livechat/images/announcements.png?classes=shadow,border&height=400px "Announcements")
ca: ![Captura de pantalla d'una sessió de xat. A la part superior del camp del missatge, hi ha un selector "{{% livechat_label announcements_message_type %}}". Al xat podem veure tres tipus d'anuncis: un missatge destacat, un anunci i un avís. Cadascun d'aquests anuncis té un color especial per distingir-los. L'anunci i l'avís també tenen títols en negreta.](/peertube-plugin-livechat/images/announcements.png?classes=shadow,border&height=400px "Anuncis")

source: ![Screenshot of the Peertube new live form.](/peertube-plugin-livechat/images/new_live.png?classes=shadow,border&height=200px "New live")
ca: ![Captura de pantalla del formulari de Peertube Nou directe.](/peertube-plugin-livechat/images/new_live.png?classes=shadow,border&height=200px "Nou directe")

source: ![Screenshot of the form, with a "{{% livechat_label use_chat %}}" checkbox.](/peertube-plugin-livechat/images/new_live_activate_chat.png?classes=shadow,border&height=200px "Activate the chat")
ca: ![Captura de pantalla del formulari, amb una casella de selecció "{{% livechat_label use_chat %}}".](/peertube-plugin-livechat/images/new_live_activate_chat.png?classes=shadow,border&height=200px "Activar el xat")
