Repository: JohnXLivingston/peertube-plugin-livechat
Catalog: support/documentation/po/livechat.*.po
Languages: ca, fr, pt_br

source: Update localization files and generate documentation translations
ca: Actualitzar els fitxers de localització i generar traduccions de la documentació
fr: Mettre à jour les fichiers de localisation et générer les traductions de la documentation
pt_br: Atualizar arquivos de localização e gerar traduções de documentação

source: For now, you only have the english version. To update documentation strings, and generate translations, you have to run the `doc-translate.sh` script.
ca: De moment només teniu la versió en anglès. Per actualitzar les cadenes i generar les traduccions, heu d'executar l'script `doc-translate.sh`.
fr: Pour l'instant, vous n'avez que la version anglaise. Pour mettre à jour les chaînes et générer les traductions, vous devez lancer le script `doc-translate.sh`.
pt_br: Por enquanto, você só tem a versão em inglês. Para atualizar as strings de documentação e gerar traduções, você precisa executar o script `doc-translate.sh`.

source: Some linux distro (like Debian Bullseye for example) have too old version of `po4a`. Please make sure to install a compatible version. If you are using Debian Bullseye for example, you can download the Bookworm po4a.deb file from [https://packages.debian.org](https://packages.debian.org/bookworm/all/po4a/download), and install it manually.
ca: Algunes distribucions de Linux (com ara Debian Bullseye) tenen una versió anterior de `po4a`. Assegureu-vos d'instal·lar-me una debcompatible. Si utilitzeu Debian Bullseye podeu descarregar el fitxer Bookworm po4a.deb des de [https://packages.debian.org](https://packages.debian.org/bookworm/all/po4a/download), i instal·lar-lo manualment.
fr: Certaines distributions linux (comme Debian Bullseye par exemple) ont une version trop ancienne de `po4a`. Veillez à installer une version compatible. Si vous utilisez Debian Bullseye par exemple, vous pouvez télécharger le fichier Bookworm po4a.deb depuis [https://packages.debian.org](https://packages.debian.org/bookworm/all/po4a/download), et l'installer manuellement.
pt_br: Algumas distribuições Linux (como o Debian Bullseye, por exemplo) possuem versões muito antigas do `po4a`. Certifique-se de instalar uma versão compatível. Se você estiver usando o Debian Bullseye, por exemplo, pode baixar o arquivo Bookworm po4a.deb em [https://packages.debian.org](https://packages.debian.org/bookworm/all/po4a/download) e instalá-lo manualmente.

source: To handle translations, just do:
ca: Per gestionar les traduccions només cal fer el següent:
fr: Pour gérer les traductions, il suffit de faire :
pt_br: Para lidar com traduções, basta fazer:

source: You can then preview the result using `hugo serve -s support/documentation/`, and using the language selector.
ca: A continuació podeu previsualitzar el resultat utilitzant `hugo serve -s support/documentation/` i utilitzant el selector d'idioma.
fr: Vous pouvez ensuite prévisualiser le résultat en utilisant `hugo serve -s support/documentation/`, et en utilisant le sélecteur de langue.
pt_br: Você pode então visualizar o resultado usando `hugo serve -s support/documentation/` e usar o seletor de idioma.

source: Write documentation
ca: Escriure documentació
fr: Écrire la documentation
pt_br: Escrever documentação

source: Just edit the english files in `support/documentation/content/en`.
ca: Editeu només fitxers en anglès a `support/documentation/content/en`.
fr: Éditez seulement les fichiers anglais dans `support/documentation/content/en`.
pt_br: Basta editar os arquivos em inglês em `support/documentation/content/en`.

source: Then, before commiting, always run `npm run doc:translate`, so that changes in english files can be propagated to the `support/documentation/po/livechat.en.pot` file.
ca: Aleshores, abans de fer `commit`, executeu sempre `npm run doc:translate`, de manera que els canvis en els fitxers en anglès es puguin propagar al fitxer `support/documentation/po/livechat.en.pot`.
fr: Ensuite, avant de commiter, lancez toujours `npm run doc:translate`, afin que les changements dans les fichiers anglais puissent être propagés dans le fichier `support/documentation/po/livechat.en.pot`.
pt_br: Então, antes de confirmar, sempre execute `npm run doc:translate`, para que as alterações nos arquivos em inglês possam ser propagadas para o arquivo `support/documentation/po/livechat.en.pot`.

source: You can use the `livechat_label` short code to use application strings. See here: [Documentation translation](/peertube-plugin-livechat/contributing/translate/#documentation-translation).
ca: Podeu utilitzar el codi curt `livechat_label` per utilitzar cadenes de l'aplicació. Vegeu aquí: [Traducció de la documentació](/peertube-plugin-livechat/contributing/translate/#documentation-translation).
fr: Vous pouvez utiliser le code court `livechat_label` pour utiliser des chaînes de l'application. Voir ici : [Traduction de la documentation](/peertube-plugin-livechat/fr/contribuer/translate/#documentation-translation).
pt_br: Você pode usar o código curto `livechat_label` para usar strings de aplicativo. Veja aqui: [Tradução da documentação](/peertube-plugin-livechat/contributing/translate/#documentation-translation).

source: It is possible to prevent a file from beeing translating, using `livechatnotranslation: true` in the Yaml Font Matter section. See here: [Documentation translation](/peertube-plugin-livechat/contributing/translate/#documentation-translation).
ca: És possible evitar que es tradueixi un fitxer utilitzant `livechatnotranslation: true` a la secció Yaml Font Matter. Vegeu aquí: [Traducció de la documentació](/peertube-plugin-livechat/contributing/translate/#documentation-translation).
fr: Il est possible d'empêcher un fichier d'être traduit, en utilisant `livechatnotranslation : true` dans la section Yaml Font Matter. Voir ici : [Traduction de la documentation](/peertube-plugin-livechat/fr/contribuer/translate/#documentation-translation).
pt_br: É possível impedir que um arquivo seja traduzido usando `livechatnotranslation: true` na seção Yaml Font Matter. Veja aqui: [Tradução da documentação](/peertube-plugin-livechat/contributing/translate/#documentation-translation).

source: Please use the `livechatnotranslation` option for technical documentation. We don't want technical documentation to be translated, to avoid issues because of a wrong translation.
ca: Si us plau, utilitzeu l'opció `livechatnotranslation` per a la documentació tècnica. No volem traduir documentació tècnica, per tal d'evitar problemes relacionats amb una traducció deficient.
fr: Veuillez utiliser l'option `livechatnotranslation` pour la documentation technique. Nous ne voulons pas traduire la documentation technique, afin d'éviter les problèmes liés à une mauvaise traduction.
pt_br: Use a opção `livechatnotranslation` para documentação técnica. Não queremos que a documentação técnica seja traduzida para evitar problemas devido a uma tradução incorreta.

source: To facilitate translators work, avoid making too long paragraphs.
ca: Per facilitar la feina dels traductors eviteu fer paràgrafs massa llargs.
fr: Pour faciliter le travail des traducteur⋅rices, évitez de faire des paragraphes trop longs.
pt_br: Para facilitar o trabalho dos tradutores, evite fazer parágrafos muito longos.

source: For now, it is not possible to use Markdown tables: the translation tools will break them.
ca: De moment no és possible utilitzar les taules Markdown: les eines de traducció no saben com gestionar-les.
fr: Pour l'instant il n'est pas possible d'utiliser des tableaux Markdown : les outils de translation ne savent pas les gérer.
pt_br: Por enquanto, não é possível usar tabelas Markdown: as ferramentas de tradução irão quebrá-las.

source: There may be links to this documentation elsewhere on the web. Try not to change the urls of the documentation pages. Or at the very least, put links to the new location on the previous url.
ca: És possible que hi hagi enllaços a aquesta documentació en altres llocs del web. Intenteu no canviar els URL de les pàgines de documentació. O almenys posar enllaços a les pàgines noves als URL antics.
fr: Il peut y avoir des liens vers cette documentation ailleurs sur le web. Essayez de ne pas changer les urls des pages de documentation. Ou au moins, mettez des liens vers les nouvelles pages dans les anciennes urls.
pt_br: Pode haver links para esta documentação em outros lugares da web. Tente não alterar os URLs das páginas de documentação. Ou, pelo menos, insira links para o novo local no URL anterior.

source: When a new feature is released, you can use the `livechat_version_notice` short code to display an infobox with the version with which the features is available. This short code takes the version number as parameter. Here is an example:
ca: Quan hi hagi una funció nova disponible, podeu utilitzar `livechat_version_notice` per mostrar un quadre d'informació amb la versió en què aquesta funció està disponible. Aquest codi pren el número de versió com a paràmetre. Aquí teniu un exemple:
fr: Lorsqu'une nouvelle fonctionnalité est disponible, vous pouvez utiliser `livechat_version_notice` pour afficher une boite d'information avec la version dans laquelle cette fonctionnalité est disponible. Ce code prend le numéro de version comme paramètre. Voici un exemple :
pt_br: Quando um novo recurso é lançado, você pode usar o código curto `livechat_version_notice` para exibir uma infobox com a versão em que o recurso está disponível. Este código curto recebe o número da versão como parâmetro. Veja um exemplo:

source: What if I can't use hugo and/or po4a?
ca: Què he de fer si no puc utilitzar hugo i/o po4a?
fr: Que faire si je ne peux pas utiliser hugo et/ou po4a ?
pt_br: E se eu não puder usar hugo e/ou po4a?

source: Just edit english markdown files, and specify that you can't build translations when you make your Pull Request.
ca: Simplement editeu els fitxers de reducció en anglès i en fer «Pull Request» especifiqueu que no podeu compilar les traduccions.
fr: Il suffit d'éditer les fichiers markdown en anglais, et de spécifier que vous ne pouvez pas compiler les traductions lorsque vous faites votre Pull Request.
pt_br: Basta editar os arquivos markdown em inglês e especificar que você não pode criar traduções ao fazer seu Pull Request.

source: Publication
ca: Publicació
pt_br: Publicação

source: Publishing the documentation is automatic, as soon as the changes are merged into the `documentation` branch.
ca: La publicació de la documentació és automàtica, tan bon punt les modificacions es fusionen a la branca `documentació`.
fr: La publication de la documentation est automatique, dès que les modifications sont fusionnées dans la branche `documentation`.
pt_br: A publicação da documentação é automática, assim que as alterações são mescladas na ramificação `documentation`.

source: Give your feedback
ca: Doneu la vostra opinió
fr: Donnez vos retours
pt_br: Dê seu feedback

source: You don't need to know how to code to start contributing to this plugin! Other contributions are very valuable too, among which: you can test the software and report bugs, you can give feedback, features that you are interested in, user interface, design, ...
ca: No cal que codifiqueu per començar a contribuir a aquest connector! També són valuoses altres formes de contribució, com ara: podeu provar el connector i informar de qualsevol error que trobeu, compartir els vostres comentaris, proposar funcions que us interessen, informar dels vostres comentaris sobre la interfície, el disseny, etc.
fr: Vous n'avez pas besoin de coder pour commencer à contribuer à ce plugin ! Les autres formes de contributions sont également précieuses, parmis lesquelles : vous pouvez tester le plugin et remonter les bugs que vous rencontrez, partager vos retours d'expérience, proposer des fonctionnalités qui vous intéressent, remonter vos remarques sur l'interface, le design, etc.
pt_br: Você não precisa saber programar para começar a contribuir com este plugin! Outras contribuições também são muito valiosas, entre elas: você pode testar o software e relatar bugs, dar feedback, recursos de seu interesse, interface de usuário, design, etc.

source: Contributing
ca: Contribuir
fr: Contribuer
pt_br: Contribuindo

source: Interested in contributing? Awesome!
ca: Us interessa contribuir? Genial!
fr: Intéressé⋅e pour contribuer ? Super !
pt_br: Interessado em contribuir? Ótimo!

source: Translate the plugin
ca: Traduir el plugin
fr: Traduire le plugin
pt_br: Traduzir o plugin

source: Translate
ca: Traduir
fr: Traduction
pt_br: Traduzir

source: You can contribute to this plugin translation. Translations are handled using the [Weblate](https://weblate.org/) software, using [Framasoft Weblate instance](https://weblate.framasoft.org/).
ca: Podeu contribuir a la traducció d'aquest connector de Peertube. Les traduccions les gestiona el programari [Weblate](https://weblate.org/), mitjançant [la instància de Framasoft Weblate](https://weblate.framasoft.org/).
fr: Vous pouvez contribuer à la traduction de ce plugin Peertube. Les traductions sont gérées par le logiciel [Weblate](https://weblate.org/), via [l'instance Weblate de Framasoft](https://weblate.framasoft.org/).
pt_br: Você pode contribuir para a tradução deste plugin. As traduções são feitas usando o software [Weblate](https://weblate.org/), utilizando a [instância Framasoft Weblate](https://weblate.framasoft.org/).

source: Never modify directly files in the `languages` folder, this could lead to conflicts.
ca: No modifiqueu mai directament els fitxers de la carpeta `languages` del connector, correu el risc de crear conflictes.
fr: Ne modifiez jamais directement les fichiers dans le dossier `languages` du plugin, vous risqueriez de créer des conflits.
pt_br: Nunca modifique diretamente os arquivos na pasta `languages`, isso pode causar conflitos.

source: How to
ca: Com fer
fr: Comment faire
pt_br: Como fazer

source: Create an account: https://weblate.framasoft.org/accounts/register/
ca: Creeu un compte: https://weblate.framasoft.org/accounts/register/
fr: Créez-vous un compte : https://weblate.framasoft.org/accounts/register/
pt_br: Crie uma conta: https://weblate.framasoft.org/accounts/register/

source: Validate your email and follow the link sent
ca: Valideu la vostra adreça electrònica fent clic a l'enllaç rebut
fr: Validez votre email en cliquant sur le lien reçu
pt_br: Valide seu e-mail e siga o link enviado

source: Create your password and setup your account
ca: Trieu la vostra contrasenya i configureu el vostre compte
fr: Choisissez votre mot de passe, et configurez votre compte
pt_br: Crie sua senha e configure sua conta

source: Go to the plugin project page: https://weblate.framasoft.org/projects/peertube-livechat/peertube-plugin-livechat/
ca: Aneu al projecte del connector de xat: https://weblate.framasoft.org/projects/peertube-livechat/peertube-plugin-livechat/
fr: Allez sur le projet du plugin de tchat : https://weblate.framasoft.org/projects/peertube-livechat/peertube-plugin-livechat/
pt_br: Acesse a página do projeto do plugin: https://weblate.framasoft.org/projects/peertube-livechat/peertube-plugin-livechat/

source: Choose the locale you want to translate
ca: Trieu l'idioma que voleu traduir
fr: Choisissez la langue que vous voulez traduire
pt_br: Selecione o local que você deseja traduzir

source: Just translate missing sentences, or correct the ones that seems incorrect to you.
ca: Només cal afegir les traduccions que falten o corregir les que semblin incorrectes.
fr: Il ne vous reste plus qu'à ajouter les traductions manquantes, ou corriger celles qui vous semblent erronées.
pt_br: Apenas traduza as frases que faltam ou corrija aquelas que parecem incorretas para você.

source: There might be some «very technical» strings. If you are not 100% sure of the meaning, or of your translation, you better not translate it, so it will display in english.
ca: Pot haver-hi cadenes «bastant tècniques». Si no teniu certesa del significat, o de la traducció, és millor no traduir-lo; de manera que es mostrarà la versió en anglès.
fr: Il peut y avoir des chaînes «assez techniques». Si vous n'êtes pas sûr⋅e à 100% du sens, ou de la traduction, il vaut mieux ne pas la traduire du tout ; ainsi la version anglaise s'affichera.
pt_br: Pode haver algumas sequências de caracteres "muito técnicas". Se você não tiver 100% de certeza do significado ou da sua tradução, é melhor não traduzi-la, para que ela seja exibida em inglês.

source: ConverseJS translations
ca: Traduccions de ConverseJS
fr: Traductions de ConverseJS
pt_br: Traduções do ConverseJS

source: This plugin relies on [ConverseJS](https://conversejs.org/) for the chat front-end. ConverseJS has its own translations, on its own [weblate instance](https://hosted.weblate.org/projects/conversejs/#languages). You can also translate directly in the code repository. For more information, check [ConverseJS translations documentation](https://conversejs.org/docs/html/translations.html).
ca: Aquest connector es basa en [ConverseJS](https://conversejs.org/) per a la visualització del xat. ConverseJS té les seves traduccions a la pròpia [instància de Weblate](https://hosted.weblate.org/projects/conversejs/#languages). També podeu traduir directament al repositori de codi. Per obtenir més informació, consulteu la [documentació de traducció de ConverseJS](https://conversejs.org/docs/html/translations.html).
fr: Ce plugin s'appuie sur [ConverseJS](https://conversejs.org/) pour l'affichage du tchat. ConverseJS a ses propres traductions, sur sa propre [instance Weblate](https://hosted.weblate.org/projects/conversejs/#languages). Vous pouvez également traduire directement dans le dépôt de code. Pour plus d'information, veuillez vous référer à la [documentation de traduction de ConverseJS](https://conversejs.org/docs/html/translations.html).
pt_br: Este plugin utiliza o [ConverseJS](https://conversejs.org/) para o front-end de bate-papo. O ConverseJS possui suas próprias traduções, em sua própria [instância do Weblate](https://hosted.weblate.org/projects/conversejs/#languages). Você também pode traduzir diretamente no repositório de código. Para mais informações, consulte a [documentação de traduções do ConverseJS](https://conversejs.org/docs/html/translations.html).

source: Adding a new locale
ca: Afegir un idioma nou
fr: Ajouter une nouvelle langue
pt_br: Adicionando uma nova localidade

source: If you think there is a missing locale, please check first if it is handled in Peertube. If so, you can [open an issue](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) to ask for it.
ca: Si l'idioma que us interessa no és present, primer assegureu-vos que sigui compatible amb PeerTube. Si és així, podeu [obrir un tiquet](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) per sol·licitar que s'afegeixi.
fr: Si la langue qui vous intéresse n'est pas présente, assurez-vous d'abord qu'elle est bien supportée par Peertube. Si c'est le cas, vous pouvez [ouvrir un ticket](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) pour en demander l'ajout.
pt_br: Se você acha que há alguma localidade faltando, verifique primeiro se ela é gerenciada no Peertube. Se for o caso, você pode [abrir um problema](https://github.com/JohnXLivingston/peertube-plugin-livechat/issues) para solicitá-la.

source: Adding new strings / use translations in the code
ca: Afegir noves cadenes / utilitzar traduccions al codi
fr: Ajout de nouveau segment / utilisation dans le code
pt_br: Adicionar novas strings / usar traduções no código

source: If you are working on new features, and need new strings, you can create them directly in Weblate. The english version is mandatory. Start with it.
ca: Si esteu treballant en una funció nova i necessiteu noves cadenes, creeu-los directament a Weblate. La versió en anglès és obligatòria, comenceu per aquesta.
fr: Si vous travaillez sur une nouvelle fonctionnalité, et que vous avez besoin de nouveaux segments, créez les directement dans Weblate. La version anglaise est obligatoire, commencez par celle-ci.
pt_br: Se você estiver trabalhando em novos recursos e precisar de novas strings, poderá criá-las diretamente no Weblate. A versão em inglês é obrigatória. Comece por ela.

source: Each string is linked to a key (for example `use_chat`). Choose an explicit key in english, lower case.
ca: Cada cadena està enllaçada a una clau (p. ex., `use_chat`). Trieu una clau en anglès, prou explícita i en minúscula.
fr: Chaque segment est lié à une clé (par exemple `use_chat`). Choisissez une clé en anglais, suffisamment explicite, et en minuscule.
pt_br: Cada string está vinculada a uma chave (por exemplo, `use_chat`). Escolha uma chave explícita, em inglês, com letras minúsculas.

source: If you have to test new strings without waiting for a Weblate merge, you can modify `languages/*.yml` files, but avoid to commit these changes (to minimize conflict risks).
ca: Si necessiteu provar les vostres localitzacions sense esperar la fusió de Weblate, podeu modificar els fitxers `languages/*.yml`, però eviteu fer-ne «commit» (per minimitzar el risc de conflictes).
fr: Si vous avez besoin de tester vos localisations sans attendre la fusion venant de Weblate, vous pouvez modifier les fichiers `languages/*.yml`, mais évitez de les commit (pour minimiser le risque de conflits).
pt_br: Se você precisar testar novas strings sem esperar por uma mesclagem do Weblate, você pode modificar os arquivos `languages/*.yml`, mas evite confirmar essas alterações (para minimizar os riscos de conflito).

source: Use translations in front-end code
ca: Utilitzar traduccions al codi del «front-end»
fr: Utiliser un segment dans le code front-end
pt_br: Use traduções no código front-end

source: Before using a string in front-end, you need to declare a new constant in `client/@types/global.d.ts`. The constant name must:
ca: Abans d'utilitzar una cadena al «front-end» heu de declarar una constant nova a `client/@types/global.d.ts`. La constant ha de:
fr: Avant d'utiliser une chaîne en front-end, il faut déclarer une nouvelle constante dans `client/@types/global.d.ts`. La constante doit :
pt_br: Antes de usar uma string no front-end, você precisa declarar uma nova constante em `client/@types/global.d.ts`. O nome da constante deve:

source: start with the prefix "LOC_"
ca: començar amb el prefix «LOC_»
fr: commencer par le préfixe "LOC_"
pt_br: comece com o prefixo "LOC_"

source: use the string key, upper cased
ca: utilitzar la clau de la cadena, en majúscules
fr: utiliser la clé de la chaîne, en majuscule
pt_br: use a tecla string, em maiúsculas

source: you just have to declare its type, not its value
ca: només heu de declarar-ne el tipus, no el valor
fr: vous ne devez déclarer que son type, pas sa valeur
pt_br: você só precisa declarar seu tipo, não seu valor

source: For example, to use "use_chat", you have to declare:
ca: Per exemple, per utilitzar «use_chat», heu de declarar:
fr: Par exemple, pour utiliser "use_chat", vous devez déclarer :
pt_br: Por exemplo, para usar "use_chat", você deve declarar:

source: declare const LOC_USE_CHAT: string
pt_br: declarar const LOC_USE_CHAT: string
